#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Artemis_SnowSurfaceCoverageMap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Bp_E_Artemis_SnowSurfaceCoverageMap_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_Artemis_SnowSurfaceCoverageMap_Struct_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Artemis_SnowSurfaceCoverageMap.BP_Artemis_SnowSurfaceCoverageMap_C
// 0x0150 (0x03D8 - 0x0288)
class ABP_Artemis_SnowSurfaceCoverageMap_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      SnowmaskOffsets;                                   // 0x0298(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                LandscapeBias;                                     // 0x02A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LandscapeSize;                                     // 0x02C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 SnowRT_BitArray;                                   // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RenderTargetResolution;                            // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     RTMaterial;                                        // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        CoverageThreshold;                                 // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, EBp_E_Artemis_SnowSurfaceCoverageMap> SnowProgressionServer;                 // 0x0300(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        DebugDrawBitArrayDuration;                         // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowBitArrayPopulation;                           // 0x0358(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Release_ClearRenderTargetBitArrayOnCompletion;     // 0x0359(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35A[0x6];                                      // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              s19BitArrayPopulated;                              // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          BitArraySuccesfullyPopulated;                      // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 SnowRT_DiskAsset;                                  // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FBP_Artemis_SnowSurfaceCoverageMap_Struct SnowProgressionState;                           // 0x0380(0x0008)(Edit, BlueprintVisible, Net, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, EBp_E_Artemis_SnowSurfaceCoverageMap> SnowProgressionClient;                 // 0x0388(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void CallClearRenderTargetOnDisk();
	void ClearRenderTargetOnDisk();
	void ExecuteUbergraph_BP_Artemis_SnowSurfaceCoverageMap(int32 EntryPoint);
	void FindAndSetSnowProgressionPhase(const TMap<class FString, EBp_E_Artemis_SnowSurfaceCoverageMap>& SnowProgressionEvents);
	void GetSnowProgressionPhase(EBp_E_Artemis_SnowSurfaceCoverageMap* SnowProgressionPhase);
	void IgnoreCalendarEventsWarningLog();
	void OnReady_60D0298240509AEB035A67BBB4E888A1();
	void OnRep_SnowProgression();
	void OnRep_SnowProgressionState();
	void PopulateBitArray();
	void QuerySnowCalendarEvents(const TMap<class FString, EBp_E_Artemis_SnowSurfaceCoverageMap>& Events, bool* EventFound, class FString* FoundEventName, double* EventTimespanRatio);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Release_ClearRenderTarget();
	void RemoveSnowOnClient();
	void SetAllowBitArrayPopulation(bool AllowBitArrayPopulation_0);
	void SetSnowProgressionPhase(int32 Index_0);
	void SetupRT();
	void UpdateSnowProgressionMPC();
	void UpdateSnowVisuals();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Artemis_SnowSurfaceCoverageMap_C">();
	}
	static class ABP_Artemis_SnowSurfaceCoverageMap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Artemis_SnowSurfaceCoverageMap_C>();
	}
};

}

