#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerPawn_NonParticipant

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteAI_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_PlayerPawn_Athena_Phoebe_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerPawn_NonParticipant.BP_PlayerPawn_NonParticipant_C
// 0x0200 (0x6270 - 0x6070)
class ABP_PlayerPawn_NonParticipant_C : public ABP_PlayerPawn_Athena_Phoebe_C
{
public:
	uint8                                         Pad_6064[0x4];                                     // 0x6064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PlayerPawn_NonParticipant_C;     // 0x6068(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortAthenaAlertStateComponent*         FortAthenaAlertState;                              // 0x6070(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        VOAudioComponent;                                  // 0x6078(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          UseAlertness;                                      // 0x6080(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseVO;                                             // 0x6081(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseIdleVO;                                         // 0x6082(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDropExtraLootOnDeath;                           // 0x6083(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseFullBodyHitReact;                               // 0x6084(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlertLevel                                   AlertLevel;                                        // 0x6085(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	EAlertLevel                                   OldAlertLevel;                                     // 0x6086(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6087[0x1];                                     // 0x6087(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           GameplayCueAlertState;                             // 0x6088(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_608C[0x4];                                     // 0x608C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_NPC_Status_Stressed_Infinite;                   // 0x6090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_NPC_Status_Stressed_Cooldown;                   // 0x6098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        MinDistanceToTargetToPlayCombatAlertAnimation;     // 0x60A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         MinIdleVODelay;                                    // 0x60A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MaxIdleVODelay;                                    // 0x60D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   LootTierNameToSpawnWhenDead;                       // 0x60F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LootTier_Medium;                                   // 0x60FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LootTier_Shell;                                    // 0x6100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LootTier_Heavy;                                    // 0x6104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LootTier_Light;                                    // 0x6108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LootTier_Rockets;                                  // 0x610C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGameplayDataTrackerComponentManager* DataTrackerComponentManager;                     // 0x6110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AlertLevelUnawareTag;                              // 0x6118(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AlertLevelAlertedTag;                              // 0x611C(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AlertLevelAggressiveTag;                           // 0x6120(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TC_DisguiseTag;                                    // 0x6124(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_RemoveDisguise;                                 // 0x6128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySet*                        HitReactAbilitySet;                                // 0x6130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           DefaultFullbodyHitReactionMontage;                 // 0x6138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFortPatrolAnimAsset*                   CurrentPatrolAnimAsset;                            // 0x6140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 PatrolLayerAnimBP;                                 // 0x6148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortPatrolAnimSetWeaponPair>   PatrolAnimSetPairs;                                // 0x6150(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bShouldDoFullAnimationUpdate;                      // 0x6160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6161[0x3];                                     // 0x6161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            GEDuelHandle;                                      // 0x6164(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_616C[0x4];                                     // 0x616C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_DuelTag;                                        // 0x6170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        Challenger;                                        // 0x6178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 OverrideLayerAnimBP;                               // 0x6180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFortPatrolAnimAsset*                   FallbackPatrolAnimAsset;                           // 0x6188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Quantize_VO_To_Music;                              // 0x6190(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6191[0x7];                                     // 0x6191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuartzQuantizationBoundary            QuantizationBoundary;                              // 0x6198(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   VO_QuantizationClockName;                          // 0x61B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInVehicleThatSupportsNoAlertState;              // 0x61BC(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61BD[0x3];                                     // 0x61BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            GE_Quest_Converted_Handle;                         // 0x61C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            GE_Quest_Converted_HireNPC;                        // 0x61C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USoundBase*                             DeathFX_Sound;                                     // 0x61D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              PawnConverter;                                     // 0x61D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TagsToApplyOnConvertedPawn;                        // 0x61E0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TagsToApplyOnConvertingPawn;                       // 0x6200(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundLibrary*                          PawnSoundLibrary;                                  // 0x6220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySet*                        GASToApplyOnConvertedPawn;                         // 0x6228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          RemoveGASOnUnconverted;                            // 0x6230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6231[0x7];                                     // 0x6231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortAbilitySetHandle                  HNDL_EquippedAbilitySet;                           // 0x6238(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ActivateAlertDBNOCleanUp();
	void AlertLevelChanged(EAlertLevel OldAlertLevel_0, EAlertLevel InputPin);
	void BndEvt__BP_PlayerPawn_NonParticipant_ConvertComponent_K2Node_ComponentBoundEvent_1_ConvertedEvent__DelegateSignature(class AFortPawn* InstigatorPawn, class AFortPawn* ConvertedPawn);
	void BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void BndEvt__ConvertComponent_K2Node_ComponentBoundEvent_1_UnconvertedEvent__DelegateSignature(class AFortPawn* UnconvertedPawn, EUnconvertReason UnconvertReason);
	void ChallengerDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void ClientOnAlertLevelChanged(EAlertLevel OldAlertLevel_0, EAlertLevel NewAlertLevel);
	void DataTrackerSetup(bool Is_Registering);
	void ExecuteUbergraph_BP_PlayerPawn_NonParticipant(int32 EntryPoint);
	void GameplayCue_Player_Interrogation_Voice_PickedUp(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GetCurrentFullbodyHitReactionMontage(class UAnimMontage** CurrentMontage);
	void HandleAlertStateUpdates();
	void HandlePawnConverted(class AFortPawn* InstigatorPawn, class AFortPawn* ConvertedPawn);
	void HandlePawnUnconverted(class AFortPawn* UnconvertedPawn);
	void InitializeAnimInstanceSettings();
	void LinkOverrideAnimLayer();
	void LinkPatrolAnimLayer();
	void OnAlertLEvelCHangedEvent(class AFortAthenaAIBotController* BotController, EAlertLevel OldAlertLevel_0, EAlertLevel NewAlertLevel);
	void OnAnimInputEvent(const class UFortAnimInputEvent* AnimInputEvent);
	void OnCharacterCustomizationCompleted(class AFortPlayerPawn* Pawn);
	void OnDBNOStateChanged_Event(class AFortPawn* FortPawn, bool bInIsDBNO);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDied_Event(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnEnteredVehicleEvent();
	void OnExitedVehicle();
	void OnExitedVehicleEvent();
	void OnRep_AlertLevel();
	void OnRep_bIsInVehicleThatSupportsNoAlertState();
	void OnWeaponAttachmentChangedDelegate_Event_0(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void OnWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void PlayAlertLevelVO(EAlertLevel OldAlertLevel_0, EAlertLevel NewAlertLevel);
	void PlayVoiceComponentSoundByTag(const struct FGameplayTag& SoundBankTag, class UAudioComponent** AudioComponent);
	void PlayVoiceSoundByTag(const struct FGameplayTag& SoundBankTag);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReLinkAnimLayer();
	void SetAlertedStateGameplayCue(bool Alerted, bool Combat);
	void SetChallenger(class AFortPlayerPawn* Challenger_0);
	void SetDataTrackerActorStateFromAlertLevel(EAlertLevel AlertLevel_0);
	void SetupLootTierNameWithWeapon();
	void SoundLibrarySetup(bool IsAdding);
	void TriggerIdleVO();
	void UpdateAlertStateVehicleCheck();
	void UpdatePatrolAnimSet(class AFortWeapon* NewWeapon);
	void UserConstructionScript();

	void GetIconPlacement(const class AActor* SelfActor, const class AActor* ViewingActor, struct FVector* OutLocation, struct FVector* OutExtents) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerPawn_NonParticipant_C">();
	}
	static class ABP_PlayerPawn_NonParticipant_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PlayerPawn_NonParticipant_C>();
	}
};

}

