#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS24_LandingPages

#include "Basic.hpp"

#include "BattlePassBase_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BPS24_LandingPages.BPS24_LandingPages_C.BndEvt__BPS20_LandingPages_Button_BonusRewards_K2Node_ComponentBoundEvent_11_OnShowButtonDetails__DelegateSignature
// 0x0080 (0x0080 - 0x0000)
struct BPS24_LandingPages_C_BndEvt__BPS20_LandingPages_Button_BonusRewards_K2Node_ComponentBoundEvent_11_OnShowButtonDetails__DelegateSignature final
{
public:
	struct FBattlePassLandingPageButtonDisplayDetails DisplayInfo;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 ButtonID;                                          // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function BPS24_LandingPages.BPS24_LandingPages_C.BndEvt__BPS20_LandingPages_Button_CharacterCustomizer_K2Node_ComponentBoundEvent_9_OnShowButtonDetails__DelegateSignature
// 0x0080 (0x0080 - 0x0000)
struct BPS24_LandingPages_C_BndEvt__BPS20_LandingPages_Button_CharacterCustomizer_K2Node_ComponentBoundEvent_9_OnShowButtonDetails__DelegateSignature final
{
public:
	struct FBattlePassLandingPageButtonDisplayDetails DisplayInfo;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 ButtonID;                                          // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function BPS24_LandingPages.BPS24_LandingPages_C.BndEvt__BPS20_LandingPages_Button_JoinSubscription_K2Node_ComponentBoundEvent_12_OnShowButtonDetails__DelegateSignature
// 0x0080 (0x0080 - 0x0000)
struct BPS24_LandingPages_C_BndEvt__BPS20_LandingPages_Button_JoinSubscription_K2Node_ComponentBoundEvent_12_OnShowButtonDetails__DelegateSignature final
{
public:
	struct FBattlePassLandingPageButtonDisplayDetails DisplayInfo;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 ButtonID;                                          // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function BPS24_LandingPages.BPS24_LandingPages_C.BndEvt__BPS20_LandingPages_Button_Quests_K2Node_ComponentBoundEvent_10_OnShowButtonDetails__DelegateSignature
// 0x0080 (0x0080 - 0x0000)
struct BPS24_LandingPages_C_BndEvt__BPS20_LandingPages_Button_Quests_K2Node_ComponentBoundEvent_10_OnShowButtonDetails__DelegateSignature final
{
public:
	struct FBattlePassLandingPageButtonDisplayDetails DisplayInfo;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 ButtonID;                                          // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function BPS24_LandingPages.BPS24_LandingPages_C.BndEvt__BPS20_LandingPages_Button_Rewards_K2Node_ComponentBoundEvent_8_OnShowButtonDetails__DelegateSignature
// 0x0080 (0x0080 - 0x0000)
struct BPS24_LandingPages_C_BndEvt__BPS20_LandingPages_Button_Rewards_K2Node_ComponentBoundEvent_8_OnShowButtonDetails__DelegateSignature final
{
public:
	struct FBattlePassLandingPageButtonDisplayDetails DisplayInfo;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 ButtonID;                                          // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function BPS24_LandingPages.BPS24_LandingPages_C.BndEvt__BPS23_LandingPages_Button_WeeklyRewards_K2Node_ComponentBoundEvent_3_OnShowButtonDetails__DelegateSignature
// 0x0080 (0x0080 - 0x0000)
struct BPS24_LandingPages_C_BndEvt__BPS23_LandingPages_Button_WeeklyRewards_K2Node_ComponentBoundEvent_3_OnShowButtonDetails__DelegateSignature final
{
public:
	struct FBattlePassLandingPageButtonDisplayDetails DisplayInfo;                                   // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 ButtonID;                                          // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function BPS24_LandingPages.BPS24_LandingPages_C.Button_BonusRewards_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPS24_LandingPages_C_Button_BonusRewards_Event_0 final
{
public:
	class UBPS24_LandingPageButton_C*             Button_BonusRewards_0;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function BPS24_LandingPages.BPS24_LandingPages_C.Button_CharacterCustomizer_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPS24_LandingPages_C_Button_CharacterCustomizer_Event_0 final
{
public:
	class UBPS24_LandingPageButton_C*             Button_CharacterCustomizer_0;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function BPS24_LandingPages.BPS24_LandingPages_C.Button_JoinSubscription_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPS24_LandingPages_C_Button_JoinSubscription_Event_0 final
{
public:
	class UBPS24_LandingPageButton_C*             Button_JoinSubscription_0;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function BPS24_LandingPages.BPS24_LandingPages_C.Button_MysteryRewards_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BPS24_LandingPages_C_Button_MysteryRewards_Event_0 final
{
public:
	class UBPS24_LandingPageButton_C*             Button_MysteryRewards;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function BPS24_LandingPages.BPS24_LandingPages_C.Button_RewardOverview_Event_2
// 0x0008 (0x0008 - 0x0000)
struct BPS24_LandingPages_C_Button_RewardOverview_Event_2 final
{
public:
	class UBPS24_LandingPageButton_C*             Button_RewardOverview;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function BPS24_LandingPages.BPS24_LandingPages_C.ExecuteUbergraph_BPS24_LandingPages
// 0x03F0 (0x03F0 - 0x0000)
struct BPS24_LandingPages_C_ExecuteUbergraph_BPS24_LandingPages final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPS24_LandingPageButton_C*             K2Node_CustomEvent_Button_RewardOverview;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBPS24_LandingPageButton_C*             K2Node_CustomEvent_Button_CharacterCustomizer;     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBPS24_LandingPageButton_C*             K2Node_CustomEvent_Button_MysteryRewards;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBPS24_LandingPageButton_C*             K2Node_CustomEvent_Button_BonusRewards;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBPS24_LandingPageButton_C*             K2Node_CustomEvent_Button_JoinSubscription;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_BPComplete;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPS24_LandingPageButton_C*             K2Node_DynamicCast_AsBPS24_Landing_Page_Button;    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSubscriptionAllowed;                 // 0x0059(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBattlePassLandingPageButtonDisplayDetails K2Node_ComponentBoundEvent_DisplayInfo_5;      // 0x0068(0x0070)()
	class FString                                 K2Node_ComponentBoundEvent_ButtonID_5;             // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBattlePassLandingPageButtonDisplayDetails K2Node_ComponentBoundEvent_DisplayInfo_4;      // 0x00E8(0x0070)()
	class FString                                 K2Node_ComponentBoundEvent_ButtonID_4;             // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBattlePassLandingPageButtonDisplayDetails K2Node_ComponentBoundEvent_DisplayInfo_3;      // 0x0168(0x0070)()
	class FString                                 K2Node_ComponentBoundEvent_ButtonID_3;             // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBattlePassLandingPageButtonDisplayDetails K2Node_ComponentBoundEvent_DisplayInfo_2;      // 0x01E8(0x0070)()
	class FString                                 K2Node_ComponentBoundEvent_ButtonID_2;             // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBattlePassLandingPageButtonDisplayDetails K2Node_ComponentBoundEvent_DisplayInfo_1;      // 0x0268(0x0070)()
	class FString                                 K2Node_ComponentBoundEvent_ButtonID_1;             // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBPS24_LandingPageButton_C*             K2Node_DynamicCast_AsBPS24_Landing_Page_Button_1;  // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBattlePassLandingPageButtonDisplayDetails K2Node_ComponentBoundEvent_DisplayInfo;        // 0x02F8(0x0070)()
	class FString                                 K2Node_ComponentBoundEvent_ButtonID;               // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0378(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0388(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0390(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBPS24_LandingPageButton_C*             K2Node_DynamicCast_AsBPS24_Landing_Page_Button_2;  // 0x0398(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AA[0x6];                                      // 0x03AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x03C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x03D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1;      // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Bottom_ImplicitCast;             // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Top_ImplicitCast;                // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS24_LandingPages.BPS24_LandingPages_C.On BattlePass completed
// 0x0001 (0x0001 - 0x0000)
struct BPS24_LandingPages_C_On_BattlePass_completed final
{
public:
	bool                                          BPComplete;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS24_LandingPages.BPS24_LandingPages_C.OnBattlePassSubscriptionAllowed
// 0x0001 (0x0001 - 0x0000)
struct BPS24_LandingPages_C_OnBattlePassSubscriptionAllowed final
{
public:
	bool                                          bSubscriptionAllowed;                              // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPS24_LandingPages.BPS24_LandingPages_C.Play intro
// 0x0008 (0x0008 - 0x0000)
struct BPS24_LandingPages_C_Play_intro final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BPS24_LandingPages.BPS24_LandingPages_C.SequenceEvent__ENTRYPOINTBPS24_LandingPages
// 0x0008 (0x0008 - 0x0000)
struct BPS24_LandingPages_C_SequenceEvent__ENTRYPOINTBPS24_LandingPages final
{
public:
	class UBPS24_LandingPageButton_C*             Button_RewardOverview;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function BPS24_LandingPages.BPS24_LandingPages_C.SequenceEvent__ENTRYPOINTBPS24_LandingPages_0
// 0x0008 (0x0008 - 0x0000)
struct BPS24_LandingPages_C_SequenceEvent__ENTRYPOINTBPS24_LandingPages_0 final
{
public:
	class UBPS24_LandingPageButton_C*             Button_CharacterCustomizer_0;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function BPS24_LandingPages.BPS24_LandingPages_C.SequenceEvent__ENTRYPOINTBPS24_LandingPages_1
// 0x0008 (0x0008 - 0x0000)
struct BPS24_LandingPages_C_SequenceEvent__ENTRYPOINTBPS24_LandingPages_1 final
{
public:
	class UBPS24_LandingPageButton_C*             Button_MysteryRewards;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function BPS24_LandingPages.BPS24_LandingPages_C.SequenceEvent__ENTRYPOINTBPS24_LandingPages_2
// 0x0008 (0x0008 - 0x0000)
struct BPS24_LandingPages_C_SequenceEvent__ENTRYPOINTBPS24_LandingPages_2 final
{
public:
	class UBPS24_LandingPageButton_C*             Button_BonusRewards_0;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function BPS24_LandingPages.BPS24_LandingPages_C.SequenceEvent__ENTRYPOINTBPS24_LandingPages_3
// 0x0008 (0x0008 - 0x0000)
struct BPS24_LandingPages_C_SequenceEvent__ENTRYPOINTBPS24_LandingPages_3 final
{
public:
	class UBPS24_LandingPageButton_C*             Button_JoinSubscription_0;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function BPS24_LandingPages.BPS24_LandingPages_C.SequenceEvent__ENTRYPOINTBPS24_LandingPages_4
// 0x0008 (0x0008 - 0x0000)
struct BPS24_LandingPages_C_SequenceEvent__ENTRYPOINTBPS24_LandingPages_4 final
{
public:
	class UBPS24_LandingPageButton_C*             Button_RewardOverview;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function BPS24_LandingPages.BPS24_LandingPages_C.SetBattlePassOwned
// 0x0044 (0x0044 - 0x0000)
struct BPS24_LandingPages_C_SetBattlePassOwned final
{
public:
	bool                                          bOwned;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            UnownedSeasonColor;                                // 0x0004(0x0014)(Edit, BlueprintVisible)
	struct FSlateColor                            OwnedSeasonColor;                                  // 0x0018(0x0014)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0030(0x0014)()
};

}

