#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterCollectionMapScreen

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "CharacterCollectionMapScreen_structs.hpp"
#include "CollectionMapShared_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class CharacterCollectionMapScreen.AthenaCollectionScreenMapCharacter
// 0x0070 (0x0720 - 0x06B0)
class UAthenaCollectionScreenMapCharacter : public UAthenaCollectionScreenMapBase
{
public:
	struct FCollectionScreenServiceData           SharedServiceData;                                 // 0x06B0(0x0070)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCollectionScreenMapCharacter">();
	}
	static class UAthenaCollectionScreenMapCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCollectionScreenMapCharacter>();
	}
};

// Class CharacterCollectionMapScreen.CollectionNPCServiceContainer
// 0x0010 (0x0278 - 0x0268)
class UCollectionNPCServiceContainer : public UUserWidget
{
public:
	class UDynamicEntryBox*                       EntryBox_ServiceGroups;                            // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxGroupSize;                                      // 0x0270(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CollectionNPCServiceContainer">();
	}
	static class UCollectionNPCServiceContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectionNPCServiceContainer>();
	}
};

// Class CharacterCollectionMapScreen.CollectionNPCServiceGroup
// 0x0008 (0x0270 - 0x0268)
class UCollectionNPCServiceGroup : public UUserWidget
{
public:
	class UDynamicEntryBox*                       EntryBox_Services;                                 // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CollectionNPCServiceGroup">();
	}
	static class UCollectionNPCServiceGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectionNPCServiceGroup>();
	}
};

// Class CharacterCollectionMapScreen.CollectionNPCServiceInfoOverlay
// 0x00A8 (0x0518 - 0x0470)
class UCollectionNPCServiceInfoOverlay : public UAthenaCollectionScreenInfoOverlay
{
public:
	class UCollectionNPCServiceContainer*         Services;                                          // 0x0470(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_ServiceIcon;                                 // 0x0478(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_480[0x8];                                      // 0x0480(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCollectionScreenServiceData           SharedServiceData;                                 // 0x0488(0x0070)(Transient, NativeAccessSpecifierPrivate)
	TArray<class UDataTable*>                     GameFeatureLootTierData;                           // 0x04F8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class UDataTable*>                     GameFeatureLootPackageData;                        // 0x0508(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CollectionNPCServiceInfoOverlay">();
	}
	static class UCollectionNPCServiceInfoOverlay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectionNPCServiceInfoOverlay>();
	}
};

// Class CharacterCollectionMapScreen.CollectionNPCServiceWidget
// 0x0000 (0x0268 - 0x0268)
class UCollectionNPCServiceWidget : public UUserWidget
{
public:
	void PopulateData(const struct FNPCServiceWidgetData& WidgetData);
	void PopulateEmpty();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CollectionNPCServiceWidget">();
	}
	static class UCollectionNPCServiceWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectionNPCServiceWidget>();
	}
};

}

