#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChatMessageEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChatMessageEntry.ChatMessageEntry_C
// 0x0030 (0x03F8 - 0x03C8)
class UChatMessageEntry_C final : public UFortChatMessageEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          MessageBackground;                                 // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                MessageWrapper;                                    // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 DefaultStyle_0;                                    // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 SelfStyle;                                         // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 OtherUserStyle;                                    // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Button_FocusTarget_K2Node_ComponentBoundEvent_35_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_ChatMessageEntry(int32 EntryPoint);
	void HandleSelectionStatusChanged(bool bIsSelected);
	void OnEntryUpdated_1();
	void OnFocusedChanged(bool bIsFocused);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChatMessageEntry_C">();
	}
	static class UChatMessageEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatMessageEntry_C>();
	}
};

}

