#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClamberingCodeRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ClamberingCodeRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function ClamberingCodeRuntime.ClamberingComponent.BP_HandleClamberingStateChanged
// 0x0002 (0x0002 - 0x0000)
struct ClamberingComponent_BP_HandleClamberingStateChanged final
{
public:
	EClamberingState                              OldClamberingState;                                // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EClamberingState                              NewClamberingState;                                // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.BP_HandleSynchedActionStarted
// 0x0030 (0x0030 - 0x0000)
struct ClamberingComponent_BP_HandleSynchedActionStarted final
{
public:
	struct FSynchedActionInfo                     SynchedActionInfo;                                 // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.DrawDebugHUD
// 0x0010 (0x0010 - 0x0000)
struct ClamberingComponent_DrawDebugHUD final
{
public:
	class AHUD*                                   HUD;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCanvas*                                Canvas;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.HandleOwnerASCInitialized
// 0x0010 (0x0010 - 0x0000)
struct ClamberingComponent_HandleOwnerASCInitialized final
{
public:
	class UFortAbilitySystemComponent*            AbilitySystemComponent;                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerPawn*                        AffectedPawn;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.HandleOwnerDied
// 0x0008 (0x0008 - 0x0000)
struct ClamberingComponent_HandleOwnerDied final
{
public:
	class AFortPawn*                              DeadPawn;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.HandleOwnerJumpInput
// 0x0001 (0x0001 - 0x0000)
struct ClamberingComponent_HandleOwnerJumpInput final
{
public:
	bool                                          bPressed;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.HandleOwnerMovementModeChanged
// 0x0010 (0x0010 - 0x0000)
struct ClamberingComponent_HandleOwnerMovementModeChanged final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovementMode                                 PreviousMovementMode;                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         PreviousCustomMode;                                // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ClamberingCodeRuntime.ClamberingComponent.HandleOwnerTeleported
// 0x0008 (0x0008 - 0x0000)
struct ClamberingComponent_HandleOwnerTeleported final
{
public:
	class AFortPawn*                              TeleportedOwner;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.HandleTargetActorDestroyed
// 0x0008 (0x0008 - 0x0000)
struct ClamberingComponent_HandleTargetActorDestroyed final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.HandleTargetingDataValid
// 0x00D0 (0x00D0 - 0x0000)
struct ClamberingComponent_HandleTargetingDataValid final
{
public:
	struct FClamberingTargetingData               TargetingData;                                     // 0x0000(0x00D0)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.NetMulticast_ClamberingLedgeFailed
// 0x0002 (0x0002 - 0x0000)
struct ClamberingComponent_NetMulticast_ClamberingLedgeFailed final
{
public:
	EClamberingFailedReason                       FailedReason;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EClamberingState                              FailedState;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.OnPlayerStatePawnSet
// 0x0018 (0x0018 - 0x0000)
struct ClamberingComponent_OnPlayerStatePawnSet final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  OldPawn;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.RegisterMutatorUpdatedDelegate
// 0x0008 (0x0008 - 0x0000)
struct ClamberingComponent_RegisterMutatorUpdatedDelegate final
{
public:
	class APawn*                                  AffectedPawn;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.ServerStartClambering
// 0x0080 (0x0080 - 0x0000)
struct ClamberingComponent_ServerStartClambering final
{
public:
	struct FReplicatedClamberingTargetingData     InReplicatedTargetingData;                         // 0x0000(0x0078)(ConstParm, Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	double                                        ClientLastTeleportTime;                            // 0x0078(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.SetTutorialModeEnabled
// 0x0001 (0x0001 - 0x0000)
struct ClamberingComponent_SetTutorialModeEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.BP_CanStartClambering
// 0x0001 (0x0001 - 0x0000)
struct ClamberingComponent_BP_CanStartClambering final
{
public:
	bool                                          bCanStartClambering;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.BP_CanStartTargeting
// 0x0001 (0x0001 - 0x0000)
struct ClamberingComponent_BP_CanStartTargeting final
{
public:
	bool                                          bCanStartTargeting;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.BP_IsValidTargetActor
// 0x0010 (0x0010 - 0x0000)
struct ClamberingComponent_BP_IsValidTargetActor final
{
public:
	const class AActor*                           TargetActor;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsValidTargetActor;                               // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ClamberingCodeRuntime.ClamberingComponent.IsAutoClamberingEnabled
// 0x0001 (0x0001 - 0x0000)
struct ClamberingComponent_IsAutoClamberingEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.IsClamberingEnabled
// 0x0001 (0x0001 - 0x0000)
struct ClamberingComponent_IsClamberingEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.IsTutorialModeEnabled
// 0x0001 (0x0001 - 0x0000)
struct ClamberingComponent_IsTutorialModeEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.ShouldShowClamberIndicator
// 0x0001 (0x0001 - 0x0000)
struct ClamberingComponent_ShouldShowClamberIndicator final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingLibrary.PerformClamberingTargeting
// 0x00E0 (0x00E0 - 0x0000)
struct ClamberingLibrary_PerformClamberingTargeting final
{
public:
	const class ACharacter*                       Character;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FClamberingTargetingData               OutTargetingData;                                  // 0x0008(0x00D0)(Parm, OutParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00D8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

