#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CompanionAI

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "VerseNPC_classes.hpp"
#include "VerseNative_structs.hpp"
#include "VerseCreature_classes.hpp"
#include "CompanionAI_0_classes.hpp"
#include "CompanionAI_structs.hpp"
#include "Verse_structs.hpp"
#include "VerseAIBase_0_structs.hpp"
#include "VerseAIBase_0_classes.hpp"
#include "UnrealEngineExperimental_0_classes.hpp"
#include "VerseNative_0_classes.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VGameplayRst_0_structs.hpp"


namespace SDK
{

// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$GetObstacle
// 0x00B8 (0x0200 - 0x0148)
class Utask_CompanionAI_companion_ai_runtime_GetObstacle final : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*      _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              _RetVal;                                           // 0x0158(0x0029)(Parm, OutParm, ReturnParm, NoDestructor)
	FOptionProperty_                              __verse_0x00000000__1;                             // 0x0181(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_183[0x5];                                      // 0x0183(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseAIBase_fort_obstacle_info        __verse_0x39C5E53E_ObstacleInfo_3;                 // 0x0188(0x0028)(NoDestructor)
	class UObject*                                __verse_0x00000000__4;                             // 0x01B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_0;                                // 0x01B8(0x0029)(NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x01E8(0x0010)(HasGetValueTypeHash)
	struct CompanionAI::Ftuple_L_R                _ExprResult_2;                                     // 0x01F8(0x0001)(HasGetValueTypeHash)
	uint8                                         _ExprResult_3 : 1;                                 // 0x01F9(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_4;                                // 0x01FA(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_CompanionAI_companion_ai_runtime$GetObstacle">();
	}
	static class Utask_CompanionAI_companion_ai_runtime_GetObstacle* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_CompanionAI_companion_ai_runtime_GetObstacle>();
	}
};

// VerseClass CompanionAI.CompanionAI_fort_creature_component
// 0x0010 (0x0118 - 0x0108)
class UCompanionAI_fort_creature_component final : public UVerseCreature_creature_component
{
public:
	FVerseFunctionProperty_                       __verse_0xECDDAB04_RunDefaultBehavior;             // 0x0108(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UConcurrency_task* RunDefaultBehavior(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CompanionAI_fort_creature_component">();
	}
	static class UCompanionAI_fort_creature_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompanionAI_fort_creature_component>();
	}
};

// VerseClass CompanionAI.task_CompanionAI_fort_npc_component$RunDefaultBehavior
// 0x0010 (0x0158 - 0x0148)
class Utask_CompanionAI_fort_npc_component_RunDefaultBehavior final : public UConcurrency_task
{
public:
	class UCompanionAI_fort_npc_component*        _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0151(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_CompanionAI_fort_npc_component$RunDefaultBehavior">();
	}
	static class Utask_CompanionAI_fort_npc_component_RunDefaultBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_CompanionAI_fort_npc_component_RunDefaultBehavior>();
	}
};

// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$GetAttackCommandTarget_L_Nping__info_R
// 0x03C0 (0x0508 - 0x0148)
class Utask_CompanionAI_companion_ai_runtime_GetAttackCommandTarget_L_Nping__info_R final : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*      _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCompanionAI_ping_info                 __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0038)(Parm, NoDestructor)
	FOptionProperty_                              _RetVal;                                           // 0x0188(0x0031)(Parm, OutParm, ReturnParm, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        InvokeResultDummy_0;                               // 0x01C0(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_1;                                // 0x01D0(0x0011)(HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_2;                                     // 0x01E8(0x0010)(HasGetValueTypeHash)
	uint8                                         _ExprResult_3 : 1;                                 // 0x01F8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__3;                             // 0x0200(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0208(0x0010)(HasGetValueTypeHash)
	struct CompanionAI::Ftuple_L_R                _ExprResult_5;                                     // 0x0218(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_6;                                     // 0x0220(0x0010)(HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_7;                                      // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_8;                                 // 0x0238(0x0010)(HasGetValueTypeHash)
	int64                                         _AsyncResult_9;                                    // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x0E44D420_ClosestTargetDistance_4;        // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0xA08A30EA_ClosestTarget_4;                // 0x0258(0x0031)(NoDestructor)
	FOptionProperty_                              __verse_0x00000000__5;                             // 0x0289(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_10 : 1;                                // 0x028B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_11;                               // 0x028C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28E[0x2];                                      // 0x028E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVerseAIBase_fort_threat_info>  _ForIterable_12;                                   // 0x0290(0x0010)(ContainsInstancedReference)
	class UObject*                                __verse_0x00000000__9;                             // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_13;                               // 0x02A8(0x0011)(ContainsInstancedReference)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_14;                                        // 0x02C0(0x0010)(HasGetValueTypeHash)
	struct CompanionAI::Ftuple_L_R                _ExprResult_15;                                    // 0x02D0(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ForIndex_16;                                      // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_17;                                     // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_threat_info          __verse_0xD4ED8431_Threat_10;                      // 0x02E8(0x0030)(NoDestructor)
	FVerseDynamicProperty_                        InvokeResultDummy_18;                              // 0x0318(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_19;                               // 0x0328(0x0011)(HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_20;                                    // 0x0340(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_21;                                    // 0x0350(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_22;                               // 0x0360(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_23;                                        // 0x0368(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Lentity_Mtuple_L_R_Mtuple_L_R_R _ExprResult_24;                                    // 0x0378(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_25;                               // 0x0388(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct CompanionAI::Ftuple_L_R                _ExprResult_26;                                    // 0x0390(0x0001)(HasGetValueTypeHash)
	struct CompanionAI::Ftuple_L_R                _ExprResult_27;                                    // 0x0391(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_28;                         // 0x0392(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_393[0x5];                                      // 0x0393(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_29;                                        // 0x0398(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_30;                                    // 0x03A8(0x0010)(HasGetValueTypeHash)
	double                                        __verse_0xD58F9071_TargetDistance_15;              // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_31;                                        // 0x03C0(0x0010)(HasGetValueTypeHash)
	struct CompanionAI::Ftuple_Lvector3_Mvector3_R _ExprResult_32;                                   // 0x03D0(0x0030)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResultStack_33;                               // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_34;                                        // 0x0418(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_35;                               // 0x0428(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              _ExprResult_36;                                    // 0x0438(0x0031)(NoDestructor)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseAIBase_fort_threat_info          __verse_0x19FFC917_AttackTarget_17;                // 0x0470(0x0030)(NoDestructor)
	FOptionProperty_                              _ExprResultStack_37;                               // 0x04A0(0x0031)(NoDestructor)
	EVerseTrue                                    _InvokeSureResultDummy_38;                         // 0x04D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D2[0x6];                                      // 0x04D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_39;                                        // 0x04D8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_40;                                    // 0x04E8(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_41;                                // 0x04F8(0x0010)(HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_CompanionAI_companion_ai_runtime$GetAttackCommandTarget_L_Nping__info_R">();
	}
	static class Utask_CompanionAI_companion_ai_runtime_GetAttackCommandTarget_L_Nping__info_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_CompanionAI_companion_ai_runtime_GetAttackCommandTarget_L_Nping__info_R>();
	}
};

// VerseClass CompanionAI.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class CompanionAI::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass CompanionAI.$SolarisSignatureFunctionOuter", true>();
	}
	static class CompanionAI::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<CompanionAI::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass CompanionAI.CompanionAI
// 0x0000 (0x0028 - 0x0028)
class UCompanionAI final : public UObject
{
public:
	static uint8 _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RCompare_L_Nfort__obstacle__info_M_Nentity_R(const struct Ftuple_Lfort__obstacle__info_Mentity_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetAgent_U_L_Nentity_M_Ntuple_L_R_R(const struct Ftuple_Lentity_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetFortBRCharacterActions_U_L_Nfort__character_M_Ntuple_L_R_R(const struct CompanionAI::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetFortBRCreatureActions_U_L_Nfort__character_M_Ntuple_L_R_R(const struct CompanionAI::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetFortPing_U_L_Nfort__character_M_Ntuple_L_R_R(const struct CompanionAI::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static struct CompanionAI::Ftuple_Lfloat_Mfloat_R _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetNPCLeashRadius_U_L_Nfort__character_M_Ntuple_L_R_R(const struct CompanionAI::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static TArray<class USimulation_agent*> _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetTeamMembers_U_L_Nagent_M_Ntuple_L_R_R(const struct CompanionAI::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eIsBeingDBNOCarried_U_L_Nfort__character_M_Ntuple_L_R_R(const struct CompanionAI::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static FVerseStringProperty_ _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RToString_L_Ncommand__type_R(ECompanionAI_PingCommand_command_type __verse_0xB2CDDD72_Argument);
	static FVerseStringProperty_ _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RToString_L_Nentity__type_R(ECompanionAI_PingCommand_entity_type __verse_0xB2CDDD72_Argument);
	static struct FCompanionAI_ping_info CompanionAI_ping_info_Factory();

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CompanionAI">();
	}
	static class UCompanionAI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompanionAI>();
	}
};

// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$GoToAndAttackTask_L_Nfort__threat__info_R
// 0x0120 (0x0268 - 0x0148)
class Utask_CompanionAI_companion_ai_runtime_GoToAndAttackTask_L_Nfort__threat__info_R final : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*      _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_threat_info          __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0030)(Parm, NoDestructor)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0188(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0198(0x0010)(HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_3 : 1;                            // 0x01A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_4;                                      // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_5;                                 // 0x01B8(0x0010)(HasGetValueTypeHash)
	struct CompanionAI::Ftuple_L_R                _ExprResult_6;                                     // 0x01C8(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_7;                                    // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_8 : 1;                            // 0x01D8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_1D8_1 : 7;                                  // 0x01D8(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _AsyncBeginCount_9 : 1;                            // 0x01D9(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__2;                             // 0x01E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_10;                                     // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_11;                                // 0x01F0(0x0010)(HasGetValueTypeHash)
	int64                                         _AsyncResult_12;                                   // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_13 : 1;                           // 0x0208(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__3;                             // 0x0210(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_14;                                     // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_15;                                // 0x0220(0x0010)(HasGetValueTypeHash)
	struct CompanionAI::Ftuple_L_R                _ExprResult_16;                                    // 0x0230(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_17;                                   // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_18;                         // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_19;                                        // 0x0248(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_20;                                    // 0x0258(0x0010)(HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_CompanionAI_companion_ai_runtime$GoToAndAttackTask_L_Nfort__threat__info_R">();
	}
	static class Utask_CompanionAI_companion_ai_runtime_GoToAndAttackTask_L_Nfort__threat__info_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_CompanionAI_companion_ai_runtime_GoToAndAttackTask_L_Nfort__threat__info_R>();
	}
};

// VerseClass CompanionAI.CompanionAI_companion_ai
// 0x0060 (0x0128 - 0x00C8)
class UCompanionAI_companion_ai final : public UVerseAIBase_ai_behavior
{
public:
	class UDiagnostics_log*                       __verse_0xF524C2AC_Logger;                         // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         __verse_0x4222121E_DebugDisplay : 1;               // 0x00D0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColors_color                          __verse_0x71320F52_DebugScreenColor;               // 0x00D8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	double                                        __verse_0x2D4D6684_DebugScreenDuration;            // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x5155C58D_GoToLeashDistance;              // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4D92C49B_GoToAttackTargetDistance;       // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x8D041DAB_HoldPositionLeashDistance;      // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x5EF17E77_BackToMeMovementThreshold;      // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x80F3C16A_ReviveDistance;                 // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x53BD03B7_AttackCommand_TargetProximityRadius; // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UConcurrency_task* OnBegin(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CompanionAI_companion_ai">();
	}
	static class UCompanionAI_companion_ai* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompanionAI_companion_ai>();
	}
};

// VerseClass CompanionAI.CompanionAI_companion_creature
// 0x00A0 (0x0168 - 0x00C8)
class UCompanionAI_companion_creature final : public UVerseAIBase_ai_behavior
{
public:
	FOptionProperty_                              __verse_0x4645AA12_PingActionsInterface;           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0xECE2B758_CreatureActionsInterface;       // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x9146CB8B_AIMovementInterface;            // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x8FB74E85_AbilitySystemComponent;         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0xF524C2AC_Logger;                         // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         __verse_0x4222121E_DebugDisplay : 1;               // 0x00F0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColors_color                          __verse_0x71320F52_DebugScreenColor;               // 0x00F8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	double                                        __verse_0x2D4D6684_DebugScreenDuration;            // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4611DC7E_DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R; // 0x0118(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xAAC24BD9_GameLoop;                       // 0x0128(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xA3816CC6__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__creature_N_RLogAndDisplayOnScreen_L_N_Kchar_R; // 0x0138(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4EF41FF5__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__creature_N_ROnConverted; // 0x0148(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xA397BC2D__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__creature_N_ROnUnconverted; // 0x0158(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__creature_N_RLogAndDisplayOnScreen_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__creature_N_ROnConverted(const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__creature_N_ROnUnconverted(const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lvector3_Mfloat_Mcolor_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GameLoop(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* OnBegin(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CompanionAI_companion_creature">();
	}
	static class UCompanionAI_companion_creature* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompanionAI_companion_creature>();
	}
};

// VerseClass CompanionAI.CompanionAI_companion_ai_runtime
// 0x0290 (0x02B8 - 0x0028)
class UCompanionAI_companion_ai_runtime final : public UObject
{
public:
	class UCompanionAI_companion_ai*              __verse_0xF8ADD547_CompanionAIScript;              // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x963EC691_Character;                      // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xCCC0089F_Navigation;                     // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x47B0B441_CharacterMovement;              // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x193FB9C5_Leash;                          // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x3FE20196_FortPing;                       // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x03CEBA4E_CharacterActions;               // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xF161303F_WeaponActions;                  // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x0F05355D_ThreatPerception;               // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x00C33D6C_ObstaclePerception;             // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCD79BE49_CheckForReviveTeamMembers_L_Nping__info_R; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFD71F6F9_CrouchService;                  // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x42EEAE4C_CrouchUntilHit;                 // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4611DC7E_DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xAAC24BD9_GameLoop;                       // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x48CFCF8A_GetAttackCommandTarget_L_Nping__info_R; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0C45B447_GetNewObstacle;                 // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x2E34E338_GetNewTargetPerception;         // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0CD61383_GetNewThreat;                   // 0x00F8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8CAF1B4F_GetObstacle;                    // 0x0108(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x088B6B1E_GetThreat;                      // 0x0118(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x55602A55_GoToAndAttackTask_L_Nfort__threat__info_R; // 0x0128(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0F435CCE_GoToPositionTask_L_Nvector3_M_N_Qagent_M_Nlogic_M_Nfloat_M_Nlogic_R; // 0x0138(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCDB7A2EB_HandleBackToMeCommand_L_Nping__info_R; // 0x0148(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xA6BE52A1_HandleGoTo_L_Nping__info_R;     // 0x0158(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDA8C4382_HandleGoToCommand_L_Nping__info_R; // 0x0168(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x732222FF_HandleHoldPositionCommand_L_Nping__info_R; // 0x0178(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x598CA1A6_HandleNPCCommand_L_Nping__info_R; // 0x0188(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6FDBE601_HandleObstacleTask_L_N_Qentity_R; // 0x0198(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x76F49D7B_HandleReviveCommand_L_Nping__info_R; // 0x01A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x20C82F48__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_RLogAndDisplayOnScreen_L_N_Kchar_R; // 0x01B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xB0983B50_LookAroundTask_L_Nvector3_M_Nfloat_M_Nfloat_R; // 0x01C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x62AFAEFE_LookAtOrAttackTarget;           // 0x01D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3F6E3D53_LookAtThreatTask;               // 0x01E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xAADC54BA__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnConverted_L_Nany_R_Nvoid; // 0x01F8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4E82FBC7__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnConverted; // 0x0208(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF2BC523E__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnUnconverted_L_Nany_R_Nvoid; // 0x0218(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC0C030F4__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnUnconverted; // 0x0228(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x46368FA8_ReviveCommand_L_Nagent_R;       // 0x0238(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0E35E3BF_SetLeashPosition_L_Nvector3_M_Nfloat_M_Nagent_R; // 0x0248(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDBC1E5D6_ShootTargetService_L_Nfloat_R;  // 0x0258(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xED5B1563_SprintService;                  // 0x0268(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x10E1DFC8_TacticalSprintService;          // 0x0278(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x76BD3EE2_WaitForDamage;                  // 0x0288(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x866FD0D5_WaitForTargetInVehicle_L_Nfort__character_R; // 0x0298(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF5B50F35_WaitForTargetMovement_L_Nfort__character_M_Nfloat_R; // 0x02A8(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_RLogAndDisplayOnScreen_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnConverted(const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnConverted_L_Nany_R_Nvoid(FVerseDynamicProperty_ __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnUnconverted(const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnUnconverted_L_Nany_R_Nvoid(FVerseDynamicProperty_ __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* CheckForReviveTeamMembers_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* CrouchService(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* CrouchUntilHit(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lvector3_Mfloat_Mcolor_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GameLoop(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GetAttackCommandTarget_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GetNewObstacle(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GetNewTargetPerception(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GetNewThreat(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GetObstacle(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GetThreat(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GoToAndAttackTask_L_Nfort__threat__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FVerseAIBase_fort_threat_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GoToPositionTask_L_Nvector3_M_N_Qagent_M_Nlogic_M_Nfloat_M_Nlogic_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* HandleBackToMeCommand_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* HandleGoTo_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* HandleGoToCommand_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* HandleHoldPositionCommand_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* HandleNPCCommand_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* HandleObstacleTask_L_N_Qentity_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, FOptionProperty_ __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* HandleReviveCommand_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* LookAroundTask_L_Nvector3_M_Nfloat_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI::Ftuple_Lvector3_Mfloat_Mfloat_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* LookAtOrAttackTarget(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* LookAtThreatTask(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* ReviveCommand_L_Nagent_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, class USimulation_agent* __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* SetLeashPosition_L_Nvector3_M_Nfloat_M_Nagent_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lvector3_Mfloat_Magent_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* ShootTargetService_L_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, double __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* SprintService(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* TacticalSprintService(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* WaitForDamage(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* WaitForTargetInVehicle_L_Nfort__character_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, class UObject* __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* WaitForTargetMovement_L_Nfort__character_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lfort__character_Mfloat_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CompanionAI_companion_ai_runtime">();
	}
	static class UCompanionAI_companion_ai_runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompanionAI_companion_ai_runtime>();
	}
};

// VerseClass CompanionAI.CompanionAI_fort_br_character_actions_interface
// 0x0000 (0x0028 - 0x0028)
class UCompanionAI_fort_br_character_actions_interface final : public UObject
{
public:
	uint8 _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__br__character__actions__interface_N_RIsFollowingBehaviorEnabled(const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* RunDefaultBehavior(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CompanionAI_fort_br_character_actions_interface">();
	}
	static class UCompanionAI_fort_br_character_actions_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompanionAI_fort_br_character_actions_interface>();
	}
};

// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$GetNewThreat
// 0x00D8 (0x0220 - 0x0148)
class Utask_CompanionAI_companion_ai_runtime_GetNewThreat final : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*      _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              _RetVal;                                           // 0x0158(0x0031)(Parm, OutParm, ReturnParm, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseAIBase_fort_threat_info          __verse_0x1EB80E5B_ThreatInfo_1;                   // 0x0190(0x0030)(NoDestructor)
	class UObject*                                __verse_0x00000000__2;                             // 0x01C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__3;                             // 0x01C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x01D0(0x0010)(HasGetValueTypeHash)
	struct CompanionAI::Ftuple_L_R                _ExprResult_1;                                     // 0x01E0(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_2;                                     // 0x01E8(0x0010)(HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_3;                                      // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_4;                                 // 0x0200(0x0010)(HasGetValueTypeHash)
	struct CompanionAI::Ftuple_L_R                _ExprResult_5;                                     // 0x0210(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_6;                                    // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_CompanionAI_companion_ai_runtime$GetNewThreat">();
	}
	static class Utask_CompanionAI_companion_ai_runtime_GetNewThreat* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_CompanionAI_companion_ai_runtime_GetNewThreat>();
	}
};

// VerseClass CompanionAI.CompanionAI_fort_br_creature_actions_interface
// 0x0000 (0x0028 - 0x0028)
class UCompanionAI_fort_br_creature_actions_interface final : public UObject
{
public:
	class UConcurrency_task* RunDefaultBehavior(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CompanionAI_fort_br_creature_actions_interface">();
	}
	static class UCompanionAI_fort_br_creature_actions_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompanionAI_fort_br_creature_actions_interface>();
	}
};

// VerseClass CompanionAI.CompanionAI_fort_npc_component
// 0x0020 (0x0350 - 0x0330)
class UCompanionAI_fort_npc_component final : public UVerseNPC_npc_component
{
public:
	FVerseFunctionProperty_                       __verse_0xECDDAB04_RunDefaultBehavior;             // 0x0330(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x290D45C4__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__br__character__actions__interface_N_RIsFollowingBehaviorEnabled; // 0x0340(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__br__character__actions__interface_N_RIsFollowingBehaviorEnabled(const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* RunDefaultBehavior(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CompanionAI_fort_npc_component">();
	}
	static class UCompanionAI_fort_npc_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompanionAI_fort_npc_component>();
	}
};

// VerseClass CompanionAI.CompanionAI_fort_ping_interface
// 0x0000 (0x0028 - 0x0028)
class UCompanionAI_fort_ping_interface final : public UObject
{
public:
	uint8 _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RAreNPCCommandsEnabled(const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RCanAcceptPingCommand(const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RConvertedEvent(const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RConvertPingToAttack_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RDeclineNPCCommand_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_REnableCommandWheel_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RGetCurrentNPCCommand(const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RIsAttackCommandEnabled(const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffort__ping__interface_N_RUnconvertedEvent(const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* OnNPCCommand(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CompanionAI_fort_ping_interface">();
	}
	static class UCompanionAI_fort_ping_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompanionAI_fort_ping_interface>();
	}
};

// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$LookAroundTask_L_Nvector3_M_Nfloat_M_Nfloat_R
// 0x01E8 (0x0330 - 0x0148)
class Utask_CompanionAI_companion_ai_runtime_LookAroundTask_L_Nvector3_M_Nfloat_M_Nfloat_R final : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*      _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI::Ftuple_Lvector3_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument;                 // 0x0150(0x0028)(Parm, HasGetValueTypeHash)
