#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrewUI

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "CrewUI_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function CrewUI.BattlePassCrewPurchaseContainer.OnContentStateUpdated
// 0x0002 (0x0002 - 0x0000)
struct BattlePassCrewPurchaseContainer_OnContentStateUpdated final
{
public:
	EBattlePassCrewContentState                   InState;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInScreenOpened;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.BattlePassCrewPurchaseContainer.OnTriggerIntroAnimation
// 0x0001 (0x0001 - 0x0000)
struct BattlePassCrewPurchaseContainer_OnTriggerIntroAnimation final
{
public:
	bool                                          bCanClaimRewards;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.BattlePassPurchaseScreen.OnPurchaseStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BattlePassPurchaseScreen_OnPurchaseStateChanged final
{
public:
	EBattlePassPurchaseState                      InCurrentState;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.BattlePassPurchaseScreen.OnSetNavButtonNotificationText
// 0x0018 (0x0018 - 0x0000)
struct BattlePassPurchaseScreen_OnSetNavButtonNotificationText final
{
public:
	class FText                                   NotificationText;                                  // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CrewUI.BattlePassPurchaseScreen.OnSetScreenInteractable
// 0x0001 (0x0001 - 0x0000)
struct BattlePassPurchaseScreen_OnSetScreenInteractable final
{
public:
	bool                                          bInteractable;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.BattlePassPurchaseScreen.OnShowNavButtonNotification
// 0x0001 (0x0001 - 0x0000)
struct BattlePassPurchaseScreen_OnShowNavButtonNotification final
{
public:
	bool                                          bShowNotification;                                 // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.CrewMultiSubscriptionAlertModal.OnSetHowToCancelURL
// 0x0010 (0x0010 - 0x0000)
struct CrewMultiSubscriptionAlertModal_OnSetHowToCancelURL final
{
public:
	class FString                                 MoreInfoUrl;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.CrewPriceChangeAcknowledgeModal.OnSetPriceChangeAcknowledgeBodyTable
// 0x0010 (0x0010 - 0x0000)
struct CrewPriceChangeAcknowledgeModal_OnSetPriceChangeAcknowledgeBodyTable final
{
public:
	TArray<struct FCrewTableRow>                  PriceChangeByRegionRows;                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CrewUI.CrewPriceChangeAcknowledgeModal.OnSetPriceChangeAcknowledgeBodyText
// 0x0018 (0x0018 - 0x0000)
struct CrewPriceChangeAcknowledgeModal_OnSetPriceChangeAcknowledgeBodyText final
{
public:
	class FText                                   BodyText;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CrewUI.CrewPriceChangeAcknowledgeModal.OnSetPriceChangeAcknowledgeCancelSubscriptionButtonText
// 0x0018 (0x0018 - 0x0000)
struct CrewPriceChangeAcknowledgeModal_OnSetPriceChangeAcknowledgeCancelSubscriptionButtonText final
{
public:
	class FText                                   CancelSubscriptionButtonText;                      // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CrewUI.CrewPriceChangeAcknowledgeModal.OnSetPriceChangeAcknowledgeCheckboxText
// 0x0018 (0x0018 - 0x0000)
struct CrewPriceChangeAcknowledgeModal_OnSetPriceChangeAcknowledgeCheckboxText final
{
public:
	class FText                                   CheckboxText;                                      // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CrewUI.CrewPriceChangeAcknowledgeModal.OnSetPriceChangeAcknowledgeConfirmButtonText
// 0x0018 (0x0018 - 0x0000)
struct CrewPriceChangeAcknowledgeModal_OnSetPriceChangeAcknowledgeConfirmButtonText final
{
public:
	class FText                                   ConfirmButtonText;                                 // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CrewUI.CrewPriceChangeAcknowledgeModal.OnSetPriceChangeAcknowledgeMoreInfoText
// 0x0018 (0x0018 - 0x0000)
struct CrewPriceChangeAcknowledgeModal_OnSetPriceChangeAcknowledgeMoreInfoText final
{
public:
	class FText                                   ConfirmButtonText;                                 // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CrewUI.CrewPriceChangeAcknowledgeModal.OnSetPriceChangeAcknowledgeMoreInfoUrl
// 0x0018 (0x0018 - 0x0000)
struct CrewPriceChangeAcknowledgeModal_OnSetPriceChangeAcknowledgeMoreInfoUrl final
{
public:
	class FText                                   MoreInfoUrl;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CrewUI.CrewPriceChangeAcknowledgeModal.OnSetPriceChangeAcknowledgeTitle
// 0x0018 (0x0018 - 0x0000)
struct CrewPriceChangeAcknowledgeModal_OnSetPriceChangeAcknowledgeTitle final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CrewUI.CrewPurchaseScreen.BeginProgress
// 0x0018 (0x0018 - 0x0000)
struct CrewPurchaseScreen_BeginProgress final
{
public:
	class FText                                   ProgressLabel;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CrewUI.CrewPurchaseScreen.BlockScreenContent
// 0x0020 (0x0020 - 0x0000)
struct CrewPurchaseScreen_BlockScreenContent final
{
public:
	bool                                          bBlockScreen;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ContentBlockedText;                                // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CrewUI.CrewPurchaseScreen.OnContainerTabVisibilityUpdated
// 0x0008 (0x0008 - 0x0000)
struct CrewPurchaseScreen_OnContainerTabVisibilityUpdated final
{
public:
	bool                                          bTabsVisible;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpacingAdjustmentForTabs;                          // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.CrewPurchaseScreen.OnSetNavButtonNotificationText
// 0x0018 (0x0018 - 0x0000)
struct CrewPurchaseScreen_OnSetNavButtonNotificationText final
{
public:
	class FText                                   NotificationText;                                  // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CrewUI.CrewPurchaseScreen.OnShowNavButtonNotification
// 0x0001 (0x0001 - 0x0000)
struct CrewPurchaseScreen_OnShowNavButtonNotification final
{
public:
	bool                                          bShowNotification;                                 // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.CrewPurchaseScreen.OnUpdatePurchaseButtonState
// 0x0001 (0x0001 - 0x0000)
struct CrewPurchaseScreen_OnUpdatePurchaseButtonState final
{
public:
	ECrewPurchaseButtonState                      ButtonState;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.CrewPurchaseScreen.OnUpdateVBuckRefundVisibility
// 0x0001 (0x0001 - 0x0000)
struct CrewPurchaseScreen_OnUpdateVBuckRefundVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.CrewPurchaseScreen.OnUserInformationTextsUpdated
// 0x0038 (0x0038 - 0x0000)
struct CrewPurchaseScreen_OnUserInformationTextsUpdated final
{
public:
	class FText                                   UserInformationText1;                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   UserInformationText2;                              // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EMcpSubscriptionState                         SubscriptionState;                                 // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CrewUI.CrewRewardTile.OnDownloadTileImageComplete
// 0x0008 (0x0008 - 0x0000)
struct CrewRewardTile_OnDownloadTileImageComplete final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.CrewRewardTile.OnUpdateOwnedState
// 0x0001 (0x0001 - 0x0000)
struct CrewRewardTile_OnUpdateOwnedState final
{
public:
	bool                                          bOwned;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.CrewRewardTile.IsMonthlyBenefit
// 0x0001 (0x0001 - 0x0000)
struct CrewRewardTile_IsMonthlyBenefit final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.CrewSubscriptionContentContainer.OnTabSelected
// 0x0004 (0x0004 - 0x0000)
struct CrewSubscriptionContentContainer_OnTabSelected final
{
public:
	int32                                         TabIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.CrewTileDetailsTag.OnTagSetup
// 0x0002 (0x0002 - 0x0000)
struct CrewTileDetailsTag_OnTagSetup final
{
public:
	ECrewDetailsTag                               RewardTag;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOwnedTag;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.FortProgressiveScreenBase.BP_OnContainerTabVisibilityUpdated
// 0x0008 (0x0008 - 0x0000)
struct FortProgressiveScreenBase_BP_OnContainerTabVisibilityUpdated final
{
public:
	bool                                          bTabsVisible;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpacingAdjustmentForTabs;                          // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.FortProgressiveItemScreen.BlockScreenContent
// 0x0020 (0x0020 - 0x0000)
struct FortProgressiveItemScreen_BlockScreenContent final
{
public:
	bool                                          bBlockScreen;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ContentBlockedText;                                // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CrewUI.FortProgressiveItemScreen.OnErrorStateTextUpdated
// 0x0018 (0x0018 - 0x0000)
struct FortProgressiveItemScreen_OnErrorStateTextUpdated final
{
public:
	class FText                                   ErrorStateText;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CrewUI.FortProgressiveItemScreen.OnSetIsSoloScreen
// 0x0001 (0x0001 - 0x0000)
struct FortProgressiveItemScreen_OnSetIsSoloScreen final
{
public:
	bool                                          bInIsSoloScreen;                                   // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.FortProgressiveItemScreen.OnUpdateSubscriptionState
// 0x0001 (0x0001 - 0x0000)
struct FortProgressiveItemScreen_OnUpdateSubscriptionState final
{
public:
	bool                                          bSubscribed;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.FortProgressiveItemStateTitleWidget.BP_OnSetHeaderInfo
// 0x0028 (0x0028 - 0x0000)
struct FortProgressiveItemStateTitleWidget_BP_OnSetHeaderInfo final
{
public:
	class FText                                   Subheading;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bSubscribed;                                       // 0x0018(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UnlockedStages;                                    // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxStages;                                         // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CrewUI.FortProgressiveItemWidget.OnPeekStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FortProgressiveItemWidget_OnPeekStateChanged final
{
public:
	bool                                          bIsInPeekState;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.FortProgressiveItemWidget.OnStageItemChanged
// 0x0070 (0x0070 - 0x0000)
struct FortProgressiveItemWidget_OnStageItemChanged final
{
public:
	struct FProgressiveStageItemInfo              InStageItemInfo;                                   // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CrewUI.FortProgressiveItemWidget.OnTileMaterialLoaded
// 0x0001 (0x0001 - 0x0000)
struct FortProgressiveItemWidget_OnTileMaterialLoaded final
{
public:
	bool                                          bSubscribed;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.FortProgressiveSetDetailsWidget.BP_OnUpdateSetDetails
// 0x0038 (0x0038 - 0x0000)
struct FortProgressiveSetDetailsWidget_BP_OnUpdateSetDetails final
{
public:
	class FText                                   SetName;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ExpiringText;                                      // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bCompleted;                                        // 0x0030(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CrewUI.FortProgressiveSetList.AddSetTile
// 0x0008 (0x0008 - 0x0000)
struct FortProgressiveSetList_AddSetTile final
{
public:
	class UFortProgressiveSetTile*                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.FortProgressiveSetTile.BP_OnInitializeSetInfo
// 0x00A0 (0x00A0 - 0x0000)
struct FortProgressiveSetTile_BP_OnInitializeSetInfo final
{
public:
	struct FProgressiveSetInfo                    InSetInfo;                                         // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   BottomText;                                        // 0x0068(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   BottomSubtext;                                     // 0x0080(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bSubscribed;                                       // 0x0098(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CrewUI.FortProgressiveSetTile.BP_OnTileMaterialLoaded
// 0x0001 (0x0001 - 0x0000)
struct FortProgressiveSetTile_BP_OnTileMaterialLoaded final
{
public:
	bool                                          bSubscribed;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.FortProgressiveStageList.AddStageWidget
// 0x0008 (0x0008 - 0x0000)
struct FortProgressiveStageList_AddStageWidget final
{
public:
	class UFortProgressiveStageWidget*            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.FortProgressiveStageList.SelectStageInDirection
// 0x0004 (0x0004 - 0x0000)
struct FortProgressiveStageList_SelectStageInDirection final
{
public:
	int32                                         Direction;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.FortProgressiveStageWidget.AddStageItemWidget
// 0x0008 (0x0008 - 0x0000)
struct FortProgressiveStageWidget_AddStageItemWidget final
{
public:
	class UFortProgressiveItemWidget*             ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.FortProgressiveStageWidget.OnPeekStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FortProgressiveStageWidget_OnPeekStateChanged final
{
public:
	bool                                          bIsInPeekState;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.FortProgressiveStageWidget.OnSetTooltipText
// 0x0018 (0x0018 - 0x0000)
struct FortProgressiveStageWidget_OnSetTooltipText final
{
public:
	class FText                                   InToolTipText;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CrewUI.FortProgressiveStageWidget.OnSetTooltipVisible
// 0x0001 (0x0001 - 0x0000)
struct FortProgressiveStageWidget_OnSetTooltipVisible final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.FortProgressiveTableOfContentsScreen.BlockScreenContent
// 0x0020 (0x0020 - 0x0000)
struct FortProgressiveTableOfContentsScreen_BlockScreenContent final
{
public:
	bool                                          bBlockScreen;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ContentBlockedText;                                // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CrewUI.FortProgressiveTableOfContentsScreen.BP_OnSetDescriptionText
// 0x0018 (0x0018 - 0x0000)
struct FortProgressiveTableOfContentsScreen_BP_OnSetDescriptionText final
{
public:
	class FText                                   ProductDescription;                                // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CrewUI.FortProgressiveTableOfContentsScreen.BP_OnUpdateBanner
// 0x0020 (0x0020 - 0x0000)
struct FortProgressiveTableOfContentsScreen_BP_OnUpdateBanner final
{
public:
	class FText                                   BannerText;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bAllSetsCompleted;                                 // 0x0018(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSubscribed;                                       // 0x0019(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CrewUI.FortProgressiveTableOfContentsScreen.BP_OnUpdateErrorStateText
// 0x0018 (0x0018 - 0x0000)
struct FortProgressiveTableOfContentsScreen_BP_OnUpdateErrorStateText final
{
public:
	class FText                                   ErrorStateText;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CrewUI.FortProgressiveTableOfContentsScreen.BP_OnUpdateNumTilesAvailable
// 0x0004 (0x0004 - 0x0000)
struct FortProgressiveTableOfContentsScreen_BP_OnUpdateNumTilesAvailable final
{
public:
	int32                                         NumTiles;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrewUI.FortProgressiveTableOfContentsScreen.BP_OnUpdateSubscriptionState
// 0x0001 (0x0001 - 0x0000)
struct FortProgressiveTableOfContentsScreen_BP_OnUpdateSubscriptionState final
{
public:
	bool                                          bSubscribed;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

