#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DiscoveryBrowserUI

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_classes.hpp"
#include "DiscoveryBrowserUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// Class DiscoveryBrowserUI.FortActivityBrowserTabButton
// 0x0000 (0x1410 - 0x1410)
class UFortActivityBrowserTabButton final : public UFortTabButton
{
public:
	void OnFavoriteChanged(bool bIsFavorite);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserTabButton">();
	}
	static class UFortActivityBrowserTabButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserTabButton>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowser
// 0x02A8 (0x0650 - 0x03A8)
class UFortActivityBrowser final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidgetSwitcher*       Switcher_TabActivityBrowserViews;                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Back;                                       // 0x03B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_ShowCustomMatchmakingModal;                 // 0x03C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_BackToTop;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_MobileShowGameDetails;                      // 0x03D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_MobileAccept;                               // 0x03D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_MobileClose;                                // 0x03E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_JoinAsSpectator;                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_ShowSpectateMatchModal;                     // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortTabListWidgetBase_Legacy*          TabList_BrowserTabs;                               // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FPrimaryContentSetup                   PrimaryContentSetup;                               // 0x0400(0x0003)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_403[0x5];                                      // 0x0403(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortTabButton>             TabButtonClass;                                    // 0x0408(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivityDetailsModal>  ActivityDetailsModalClass;                         // 0x0410(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivityModeSetSelectionModal> ActivityModeSetSelectionModalClass;        // 0x0418(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCommonActivatableWidget>   ActivityModeSetFirstTimeNotificationModalClass;    // 0x0420(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivityBrowserAttributionsModal> AttributionsModalClass;                 // 0x0428(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivityCreatorPageView> CreatorPageViewClass;                            // 0x0430(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivityCategoryPageView> CategoryPageViewClass;                          // 0x0438(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   SoftCustomMatchmakingModalClass;                   // 0x0440(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   SoftSpectateMatchModalClass;                       // 0x0468(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortCampaignPurchaseScreen> CampaignPurchaseScreenClass;                      // 0x0490(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCommonActivatableWidget>   CCUModalClass;                                     // 0x0498(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, class UFortActivityBrowserColorSchemeAsset*> ColorSchemes;                     // 0x04A0(0x0050)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UFortCreativeDiscoverySurfaceManager*   Manager;                                           // 0x04F0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FCachedSurfaceData>             CachedSurfacesData;                                // 0x04F8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_508[0x10];                                     // 0x0508(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameActivity*                      SelectedGameActivity;                              // 0x0518(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_520[0xF0];                                     // 0x0520(0x00F0)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameActivityProvider*              CachedWinterfestActivityProvider;                  // 0x0610(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_618[0x10];                                     // 0x0618(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortActivityBrowserColorSchemeAsset*   CurrentColorScheme;                                // 0x0628(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_630[0x8];                                      // 0x0630(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortActivityCategoryPageView*          CachedCategoryPageView;                            // 0x0638(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityCreatorPageView*           CachedCreatorPageView;                             // 0x0640(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCCUModalEnabled;                                  // 0x0648(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleTabChanged(class FName TabId);
	void OnActivitySelected();
	void OnEnableColorScheme(const bool bIsColorSchemeActive);
	void OnPlayerQueueTypeChanged(const EPlayerQueueType PlayerQueueType);
	void OnSwapColorScheme(const bool bInIsUsingAlternateColorScheme);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowser">();
	}
	static class UFortActivityBrowser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowser>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserColorSchemeAsset
// 0x0050 (0x0080 - 0x0030)
class UFortActivityBrowserColorSchemeAsset final : public UDataAsset
{
public:
	TMap<class UMaterialParameterCollection*, struct FColorSchemeParamaterValues> MaterialCollectionOverrides; // 0x0030(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserColorSchemeAsset">();
	}
	static class UFortActivityBrowserColorSchemeAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserColorSchemeAsset>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserListView
// 0x0200 (0x0460 - 0x0260)
class UFortActivityBrowserListView final : public UListViewBase
{
public:
	uint8                                         Pad_260[0xD8];                                     // 0x0260(0x00D8)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DirectionalNavigationTimeThreshold;                // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLockPositionForController;                        // 0x033C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LockedPositionAt;                                  // 0x0340(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortActivityBrowserRow>    PromotedActivityClass;                             // 0x0348(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, TSubclassOf<class UFortActivityBrowserRow>> RowTypes;                          // 0x0350(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A0[0xC0];                                     // 0x03A0(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserListView">();
	}
	static class UFortActivityBrowserListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserListView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserTileBase
// 0x0060 (0x1440 - 0x13E0)
class UFortActivityBrowserTileBase : public UCommonButtonBase
{
public:
	uint8                                         Pad_13E0[0x60];                                    // 0x13E0(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserTileBase">();
	}
	static class UFortActivityBrowserTileBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserTileBase>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserPlayWithFriendsTile
// 0x0010 (0x1450 - 0x1440)
class UFortActivityBrowserPlayWithFriendsTile final : public UFortActivityBrowserTileBase
{
public:
	class UFortJoinablePartyPortraitsDisplay*     PartyMembersAvatarsDisplay;                        // 0x1440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1448[0x8];                                     // 0x1448(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnTextureBeginLoading();
	void OnTextureLoadingComplete(const class UTexture* ThumbnailTexture);
	void OnTileActiveSet(const bool bIsTileActive);
	void UpdateIslandInformation(const class FText& ActivityName);
	void UpdateIslandInformationAndThumbnail(const class FText& ActivityName, const class UTexture* ThumbnailTexture);
	void UpdateJoinablePartySubText(const class FText& JoinablePartySubText);
	void UpdatePartyInformation(const int32 CurrentPartyCount, const int32 MaxPartyCount, const bool bIsActiveInvite, const bool bIsPartyPrivate);
	void UpdatePartyMemberNames(const class FText& Names);
	void UpdateRichPresence(const class FText& RichPresence);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserPlayWithFriendsTile">();
	}
	static class UFortActivityBrowserPlayWithFriendsTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserPlayWithFriendsTile>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserRow
// 0x00A8 (0x0338 - 0x0290)
class UFortActivityBrowserRow : public UCommonUserWidget
{
public:
	uint8                                         Pad_290[0x98];                                     // 0x0290(0x0098)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_CategoryName;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinimumVisibilityPercentageForRowActivation;       // 0x0330(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCategoryItemChanged(const bool bPlayAnimation);
	void OnRowIsActiveChanged(const bool bIsActive);
	void OnRowIsSelectedChanged(const bool bIsSelected);
	void OnRowMoveDown(const bool bMovingOffscreen);
	void OnRowMoveUp(const bool bMovingOffscreen);
	void OnRowPeekStateChanged(const bool bIsInPeekState);

	bool GetIsActive() const;
	bool GetIsInPeekState() const;
	bool GetIsSelected() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserRow">();
	}
	static class UFortActivityBrowserRow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserRow>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserRowHero
// 0x0080 (0x03B8 - 0x0338)
class UFortActivityBrowserRowHero final : public UFortActivityBrowserRow
{
public:
	class UFortActivityListView*                  ListView_Activities;                               // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSwipePanel*                        SwipePanel_Navigation;                             // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_348[0x3];                                      // 0x0348(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bPlayDetailsAnimationOnScreenOpen;                 // 0x034B(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DetailsDisplayUpdateDelay;                         // 0x034C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityDetailsDisplay*            DetailsDisplay_SelectedActivity;                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityVideoCycle*                ActivityVideoCycleWidget;                          // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_360[0x20];                                     // 0x0360(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       BoundKeyArtOutroAnimation;                         // 0x0380(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_388[0x2];                                      // 0x0388(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bShouldAutoCycle;                                  // 0x038A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38B[0x2D];                                     // 0x038B(0x002D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CheckUpdateDetailsDelay();
	void CycleNextActivity();
	void HandleActivityVideoCycleEndReached();
	void HandleActivityVideoCycleStarted();
	void OnActivityUpdated();
	void OnListViewFinishedAddingEntries(int32 ActivityCount);
	void OnPlayKeyArtIntro();
	void OnPlayKeyArtOutro();
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* Texture);
	void OnQueryActivitiesFinished();
	void OnQueryStatusChanged(bool bIsActive);
	void OnRowHeroFocusChanged(bool bHasFocus);
	void OnUpdateDetailsDisplay();
	void OnVideoEndReached();
	void OnVideoStarted();

	const class UTexture* GetCurrentTexture() const;
	class UWidgetAnimation* GetKeyArtOutroAnimation() const;
	bool IsImageLoading() const;
	bool IsInOutroState() const;
	bool IsShowingSeasonalContent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserRowHero">();
	}
	static class UFortActivityBrowserRowHero* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserRowHero>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserRowList
// 0x0020 (0x0358 - 0x0338)
class UFortActivityBrowserRowList final : public UFortActivityBrowserRow
{
public:
	class UFortActivityListView*                  ListView_Activities;                               // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_PageLeft;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_PageRight;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_350[0x8];                                      // 0x0350(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnQueryStatusChanged(bool bIsActive);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserRowList">();
	}
	static class UFortActivityBrowserRowList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserRowList>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserRowPromoted
// 0x0008 (0x0340 - 0x0338)
class UFortActivityBrowserRowPromoted final : public UFortActivityBrowserRow
{
public:
	class UCommonTextBlock*                       Text_ActivityName;                                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* Texture);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserRowPromoted">();
	}
	static class UFortActivityBrowserRowPromoted* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserRowPromoted>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserView
// 0x0090 (0x0488 - 0x03F8)
class UFortActivityBrowserView : public UFortActivityView
{
public:
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bShowCustomMatchmakingModalButton;                 // 0x0400(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowSpectateMatchModalButton;                     // 0x0401(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowMobileGameDetailsButton;                      // 0x0402(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowMobileAcceptButton;                           // 0x0403(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowBackToTopButton;                              // 0x0404(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_405[0x3];                                      // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DiscoverySurfaceName;                              // 0x0408(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40C[0x7C];                                     // 0x040C(0x007C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSurfaceDataDirty();

	EFortInvalidActivityReason GetInvalidActivityReason() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserView">();
	}
	static class UFortActivityBrowserView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserRowView
// 0x0198 (0x0620 - 0x0488)
class UFortActivityBrowserRowView : public UFortActivityBrowserView
{
public:
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MouseWheelScrollTimeThreshold;                     // 0x0490(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_494[0x4];                                      // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortActivityBrowserListView*           BrowserList_Activities;                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4A0[0x60];                                     // 0x04A0(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TabNameID;                                         // 0x0500(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_504[0xC];                                      // 0x0504(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x0510(0x00F0)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPrivate)
	class UFortSwipePanel*                        SwipePanel_Navigation;                             // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_608[0x18];                                     // 0x0608(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnActivityUpdated();
	void OnQueryActivitiesFinished();
	void OnRowChanged(const int32 NewCategoryIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserRowView">();
	}
	static class UFortActivityBrowserRowView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserRowView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserTile
// 0x0040 (0x1480 - 0x1440)
class UFortActivityBrowserTile final : public UFortActivityBrowserTileBase
{
public:
	class UFortActivityTileDetailsDisplay*        Display_TileDetails;                               // 0x1440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1448[0x38];                                    // 0x1448(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleActivitySelected();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserTile">();
	}
	static class UFortActivityBrowserTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserTile>();
	}
};

// Class DiscoveryBrowserUI.FortActivityPlayerBrowserView
// 0x0138 (0x05C0 - 0x0488)
class UFortActivityPlayerBrowserView : public UFortActivityBrowserView
{
public:
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameActivityProvider*              ActivityProvider;                                  // 0x0490(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortActivityTileView*                  TileView_PlayerActivities;                         // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   TabNameID;                                         // 0x04A0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4A4[0xC];                                      // 0x04A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x04B0(0x00F0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	EFortCreativeDiscoveryPlayHistoryType         PlayHistoryProviderType;                           // 0x05A0(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5A1[0x1F];                                     // 0x05A1(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnTileViewUpdated();
	void OnPlayViewIntro();
	void OnQueryActivitiesComplete();
	void OnQueryActivitiesStarted();
	void PlayViewIntro();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityPlayerBrowserView">();
	}
	static class UFortActivityPlayerBrowserView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityPlayerBrowserView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityCategoryPageView
// 0x0040 (0x0600 - 0x05C0)
class UFortActivityCategoryPageView : public UFortActivityPlayerBrowserView
{
public:
	uint8                                         Pad_5C0[0x8];                                      // 0x05C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonRichTextBlock*                   Text_CategoryTitle;                                // 0x05C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_BackToTop;                                  // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_MobileClose;                                // 0x05D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_MobileAccept;                               // 0x05E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Back;                                       // 0x05E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_MobileShowGameDetails;                      // 0x05F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5F8[0x8];                                      // 0x05F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityCategoryPageView">();
	}
	static class UFortActivityCategoryPageView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityCategoryPageView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityTileViewTileBase
// 0x0090 (0x1470 - 0x13E0)
class UFortActivityTileViewTileBase : public UCommonButtonBase
{
public:
	uint8                                         Pad_13E0[0x90];                                    // 0x13E0(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityTileViewTileBase">();
	}
	static class UFortActivityTileViewTileBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityTileViewTileBase>();
	}
};

// Class DiscoveryBrowserUI.FortActivityCategoryTile
// 0x0010 (0x1480 - 0x1470)
class UFortActivityCategoryTile final : public UFortActivityTileViewTileBase
{
public:
	class UCommonTextBlock*                       Text_CategoryTitle;                                // 0x1470(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1478[0x8];                                     // 0x1478(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnTileActiveSet(const bool bIsTileActive);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityCategoryTile">();
	}
	static class UFortActivityCategoryTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityCategoryTile>();
	}
};

// Class DiscoveryBrowserUI.FortActivityCategoryTilePanel
// 0x0070 (0x0300 - 0x0290)
class UFortActivityCategoryTilePanel final : public UCommonUserWidget
{
public:
	class UFortActivityTileView*                  TileView_Categories;                               // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Title;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         TileViewQueryThreshold;                            // 0x02A0(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCreativeDiscoveryActivityProvider* CachedActivityProvider;                            // 0x02A8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B0[0x50];                                     // 0x02B0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityCategoryTilePanel">();
	}
	static class UFortActivityCategoryTilePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityCategoryTilePanel>();
	}
};

// Class DiscoveryBrowserUI.FortActivityCategoryView
// 0x0128 (0x05B0 - 0x0488)
class UFortActivityCategoryView final : public UFortActivityBrowserView
{
public:
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TabNameID;                                         // 0x0490(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_494[0xC];                                      // 0x0494(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x04A0(0x00F0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UFortActivityCategoryTilePanel*         TilePanel_Featured;                                // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityCategoryTilePanel*         TilePanel_All;                                     // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityCategoryTilePanel*         CurrentSelectedPanel;                              // 0x05A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5A8[0x8];                                      // 0x05A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UFortActivityCategoryTilePanel* NavigateFromPanel(EUINavigation Direction, class UFortActivityCategoryTilePanel* NavigatingPanel);
	void OnCategoryTilePanelSelected(const class UFortActivityCategoryTilePanel* SelectedPanel);
	void OnSurfaceDataReady();

	const class UFortActivityCategoryTilePanel* GetCurrentSelectedPanel() const;
	class UFortActivityCategoryTilePanel* GetTopMostVisiblePanel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityCategoryView">();
	}
	static class UFortActivityCategoryView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityCategoryView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityCreateView
// 0x0128 (0x05B0 - 0x0488)
class UFortActivityCreateView final : public UFortActivityBrowserView
{
public:
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TabNameID;                                         // 0x0490(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_494[0xC];                                      // 0x0494(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x04A0(0x00F0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Create;                                     // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_598[0x18];                                     // 0x0598(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCreativeActivityUpdated();

	EFortInvalidActivityReason GetInvalidCreativeActivityReason() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityCreateView">();
	}
	static class UFortActivityCreateView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityCreateView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityCreatorPageView
// 0x0070 (0x0670 - 0x0600)
class UFortActivityCreatorPageView final : public UFortActivityCategoryPageView
{
public:
	uint8                                         Pad_600[0x8];                                      // 0x0600(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameActivity*                      ActivityDetailsSelectedGameActivity;               // 0x0608(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_610[0x20];                                     // 0x0610(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AmountOfCreatorLinkEntriesQueried;                 // 0x0630(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         ProcessedCreatorLinkEntries;                       // 0x0634(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         AmountOfEntriesQueried;                            // 0x0638(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_63C[0x34];                                     // 0x063C(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCreatorActivitiesQueryFinished();
	void OnNoContentFoundForCreator();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityCreatorPageView">();
	}
	static class UFortActivityCreatorPageView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityCreatorPageView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityDiscoverView
// 0x00A0 (0x06C0 - 0x0620)
class UFortActivityDiscoverView final : public UFortActivityBrowserRowView
{
public:
	bool                                          bPlayDetailsAnimationOnScreenOpen;                 // 0x0620(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_621[0x3];                                      // 0x0621(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DetailsDisplayUpdateDelay;                         // 0x0624(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivatableMovieWidget> MovieWidgetClass;                                 // 0x0628(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityDetailsDisplay*            DetailsDisplay_SelectedActivity;                   // 0x0630(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityDetailsDisplay*            DetailsDisplay_PromotedActivity;                   // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                           Panel_VideoSlot;                                   // 0x0640(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                           Panel_PromotedVideoSlot;                           // 0x0648(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivatableMovieWidget*            ActivityMovieWidget;                               // 0x0650(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivatableMovieWidget*            PromotedActivityMovieWidget;                       // 0x0658(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_660[0x48];                                     // 0x0660(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       BoundKeyArtOutroAnimation;                         // 0x06A8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6B0[0x10];                                     // 0x06B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CheckUpdateDetailsDelay();
	void HandleMovieWidgetMediaPreEndEvent();
	void HandleMovieWidgetMediaStarted();
	void OnMoviePlayingChanged(const bool bIsPlaying);
	void OnMoviePreEndEvent();
	void OnPlayKeyArtIntro();
	void OnPlayKeyArtOutro();
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* Texture);
	void OnUpdateDetailsDisplay();

	const class UTexture* GetCurrentTexture() const;
	class UWidgetAnimation* GetKeyArtOutroAnimation() const;
	class UFortActivatableMovieWidget* GetMovieWidget() const;
	class UFortActivatableMovieWidget* GetPromotedMovieWidget() const;
	bool IsImageLoading() const;
	bool IsInOutroState() const;
	bool IsShowingPromotedContent() const;
	bool IsShowingSeasonalContent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityDiscoverView">();
	}
	static class UFortActivityDiscoverView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityDiscoverView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityDiscoverViewV2
// 0x0030 (0x0650 - 0x0620)
class UFortActivityDiscoverViewV2 final : public UFortActivityBrowserRowView
{
public:
	uint8                                         Pad_620[0x30];                                     // 0x0620(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsShowingPromotedContent() const;
	bool IsShowingSeasonalContent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityDiscoverViewV2">();
	}
	static class UFortActivityDiscoverViewV2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityDiscoverViewV2>();
	}
};

// Class DiscoveryBrowserUI.FortActivityFavoriteBrowserView
// 0x0000 (0x05C0 - 0x05C0)
class UFortActivityFavoriteBrowserView final : public UFortActivityPlayerBrowserView
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityFavoriteBrowserView">();
	}
	static class UFortActivityFavoriteBrowserView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityFavoriteBrowserView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityListItemWrapper
// 0x0018 (0x0040 - 0x0028)
class UFortActivityListItemWrapper final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameActivity*                      GameActivity;                                      // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityListItemWrapper">();
	}
	static class UFortActivityListItemWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityListItemWrapper>();
	}
};

// Class DiscoveryBrowserUI.FortActivityListView
// 0x0178 (0x03D8 - 0x0260)
class UFortActivityListView final : public UListViewBase
{
public:
	uint8                                         Pad_260[0xD8];                                     // 0x0260(0x00D8)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DirectionalNavigationTimeThreshold;                // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOrientation                                  Orientation;                                       // 0x033C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EntrySpacing;                                      // 0x0340(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCircularNavigationEnabled;                        // 0x0344(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_345[0x3];                                      // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EActivityBrowserTileStyle, TSubclassOf<class UFortActivityBrowserTileBase>> TileTypes;      // 0x0348(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_398[0x40];                                     // 0x0398(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetInViewCount() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityListView">();
	}
	static class UFortActivityListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityListView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityLobbyTile
// 0x0070 (0x14A0 - 0x1430)
class UFortActivityLobbyTile : public UCommonButtonLegacy
{
public:
	class UCommonTextBlock*                       Text_ActivityName;                                 // 0x1430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityBrowserTag*                ActivityBrowserTag_EpicOriginal;                   // 0x1438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivityModeSetSelectionModal> ActivityModeSetSelectionModalClass;        // 0x1440(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortGameActivityProvider*              ActivityProvider;                                  // 0x1448(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortGameActivity*>              CachedQueriedActivities;                           // 0x1450(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1460[0x40];                                    // 0x1460(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDetailsUpdated();
	void OnHideChildActivityFirstTimeNotification();
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* Texture);
	void OnShowChildActivityChangedNotification(const class FText& DisplayName);
	void OnShowChildActivityFirstTimeNotification();
	void ShowModeSetSelectionModal();
	void TrySendFirstTimeNotification();

	class FText GetChildActivityDisplayName() const;
	bool IsActivityEpicCreated() const;
	bool IsModeSetActivity() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityLobbyTile">();
	}
	static class UFortActivityLobbyTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityLobbyTile>();
	}
};

// Class DiscoveryBrowserUI.FortActivityModeSetSelectionModal
// 0x0070 (0x0418 - 0x03A8)
class UFortActivityModeSetSelectionModal : public UCommonActivatableWidget
{
public:
	class UCommonTextBlock*                       Text_ActivityName;                                 // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3B0[0x40];                                     // 0x03B0(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_Back;                                       // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_BackBoard;                                  // 0x03F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityModeSetSelection*          List_SubModeList;                                  // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivitySquadFillButton*           Button_ActivitySquadFill;                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityPrivacyButton*             Button_ActivityPrivacy;                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnActivityChanged(const class UFortGameActivity* GameActivity, const class FString& StartingSelectedMnemonic);
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* Texture);
	void OnSubModeSelected();
	void OnSubModeSelectionChanged();
	void SaveSelectionAndClose();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityModeSetSelectionModal">();
	}
	static class UFortActivityModeSetSelectionModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityModeSetSelectionModal>();
	}
};

// Class DiscoveryBrowserUI.FortActivityPlayerBrowserTile
// 0x0050 (0x14C0 - 0x1470)
class UFortActivityPlayerBrowserTile final : public UFortActivityTileViewTileBase
{
public:
	class UFortActivityTileDetailsDisplay*        Display_TileDetails;                               // 0x1470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_LastPlayedDate;                               // 0x1478(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1480[0x40];                                    // 0x1480(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleActivitySelected();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityPlayerBrowserTile">();
	}
	static class UFortActivityPlayerBrowserTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityPlayerBrowserTile>();
	}
};

// Class DiscoveryBrowserUI.FortActivityPlayerView
// 0x0148 (0x05D0 - 0x0488)
class UFortActivityPlayerView final : public UFortActivityBrowserView
{
public:
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TabNameID;                                         // 0x0490(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_494[0xC];                                      // 0x0494(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x04A0(0x00F0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCommonButtonBase>          TabButtonClass;                                    // 0x0590(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortTabListWidgetBase_Legacy*          TabList_PlayerViewTabs;                            // 0x0598(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActivatableWidgetSwitcher*       Switcher_PlayerBrowserViews;                       // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityPlayerBrowserView*         BrowserView_Favorites;                             // 0x05A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityPlayerBrowserView*         BrowserView_History;                               // 0x05B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B8[0x18];                                     // 0x05B8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityPlayerView">();
	}
	static class UFortActivityPlayerView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityPlayerView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityPlayerViewTabButton
// 0x0000 (0x1410 - 0x1410)
class UFortActivityPlayerViewTabButton final : public UFortTabButton
{
public:
	class UCommonTextBlock*                       Text_Count;                                        // 0x1408(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityPlayerViewTabButton">();
	}
	static class UFortActivityPlayerViewTabButton* GetDefaultObj()
	{
