#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DryBoxRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "DryBoxRuntime_structs.hpp"


namespace SDK
{

// Class DryBoxRuntime.NyxGlassWeaponComponent_Swinging
// 0x0DE8 (0x1440 - 0x0658)
class UNyxGlassWeaponComponent_Swinging final : public UFortWeaponComponent_Swinging
{
public:
	struct FScalableFloat                         SwingTargetRaycastDist;                            // 0x0658(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         AttackTargetRaycastDist;                           // 0x0680(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         CameraDistScale;                                   // 0x06A8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TargetingSphereRadius;                             // 0x06D0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxAttachPointActorBoundsSize;                     // 0x06F8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxAttachPointActorExtent;                         // 0x0720(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinAttachPointDistFromCamera;                      // 0x0748(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinAttachPointAngleInRad;                          // 0x0770(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxSecondAttachPointDotProd;                       // 0x0798(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	ECollisionChannel                             TargetingCollisionChannel;                         // 0x07C0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7C1[0x7];                                      // 0x07C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class AActor>>             DisallowedActorClasses;                            // 0x07C8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class AActor>>             DirectRaycastDisallowedActorClasses;               // 0x07D8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<EFortBuildingType>                     AllowedBuildingTypes;                              // 0x07E8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SwingingAutoDetachDist;                            // 0x07F8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         AttackStartSlashDist;                              // 0x0820(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxAcceleration;                                   // 0x0848(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         GasOrthogonalPowerWhileAttacking;                  // 0x0870(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         GasOrthogonalPowerWhileSwinging;                   // 0x0898(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         GasReelInPowerSwinging;                            // 0x08C0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         GasReelInPowerAttacking;                           // 0x08E8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         bShouldInterpolateCurGasToGoal;                    // 0x0910(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         GasForceInterpSpeed;                               // 0x0938(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         bShouldAccelerateWhileAttached;                    // 0x0960(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         UnattachedDeaccelerationMultiplier;                // 0x0988(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         AttachedDeaccelerationMultiplier;                  // 0x09B0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TimeAttachedBeforeSpeedStartsIncreasing;           // 0x09D8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TimeAttachedForMaxSpeed;                           // 0x0A00(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinAttachedSpeedMultiplier;                        // 0x0A28(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxAttachedSpeedMultiplier;                        // 0x0A50(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinUnattachedSpeedMultiplier;                      // 0x0A78(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxSpeedMultiplier;                                // 0x0AA0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxSpeedDecreaseFromUpwardAngle;                   // 0x0AC8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            SpeedBasedOnHeightCurve;                           // 0x0AF0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         BaseSwingSpeed;                                    // 0x0AF8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         InitialAccelerationStartSpeed;                     // 0x0B20(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         InitialAccelerationTime;                           // 0x0B48(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            InitialAccelerationCurve;                          // 0x0B70(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SpeedSoftCapDrag;                                  // 0x0B78(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SpeedHardCapFailsafe;                              // 0x0BA0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxHoverTime;                                      // 0x0BC8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         FullHoverRechargeTime;                             // 0x0BF0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         DesiredHoverZSpeed;                                // 0x0C18(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         HoverZMultiplier;                                  // 0x0C40(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         HoverTimeWhileUnequipped;                          // 0x0C68(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         HoverZMultiplierWhileUnequipped;                   // 0x0C90(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SpeedSoftCapDragWhenHovering;                      // 0x0CB8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxHoverSpeed;                                     // 0x0CE0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         OldAttackDistanceXRange;                           // 0x0D08(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         OldAttackDistanceYRange;                           // 0x0D30(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         NewAttackDistanceXRange;                           // 0x0D58(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         NewAttackDistanceYRange;                           // 0x0D80(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            AttackAccelerationCurve;                           // 0x0DA8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ReelInForceAttackMinDist;                          // 0x0DB0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ReelInForceAttackMaxDist;                          // 0x0DD8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ReelInForceAttackMinMult;                          // 0x0E00(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ReelInForceAttackMaxMult;                          // 0x0E28(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         AttackStartSpeed;                                  // 0x0E50(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         AttackMaxSpeed;                                    // 0x0E78(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SpeedSoftCapDragWhenAttacking;                     // 0x0EA0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SlashLockDistance;                                 // 0x0EC8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinSlashDistToTarget;                              // 0x0EF0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SlashSpeed;                                        // 0x0F18(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SlashLockTime;                                     // 0x0F40(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SlashLeapBackTime;                                 // 0x0F68(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SlashLeapBackHeightModifier;                       // 0x0F90(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SlashLeapBackSpeed;                                // 0x0FB8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         Swinging_SwingGravityOverride;                     // 0x0FE0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         Swinging_GravityMultiplierWhileAttachedOverride;   // 0x1008(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         Swinging_bDisableGroundedSwingingCalcOverride;     // 0x1030(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         Hovering_SwingGravityOverride;                     // 0x1058(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         Hovering_GravityMultiplierWhileAttachedOverride;   // 0x1080(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         Hovering_bDisableGroundedSwingingCalcOverride;     // 0x10A8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         Attacking_SwingGravityOverride;                    // 0x10D0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         Attacking_GravityMultiplierWhileAttachedOverride;  // 0x10F8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         Attacking_bDisableGroundedSwingingCalcOverride;    // 0x1120(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LeapingBack_SwingGravityOverride;                  // 0x1148(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LeapingBack_GravityMultiplierWhileAttachedOverride; // 0x1170(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LeapingBack_bDisableGroundedSwingingCalcOverride;  // 0x1198(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LeapingBack_OverrideTimer;                         // 0x11C0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FName                                   ActorHasPreferredSwingMeshTag;                     // 0x11E8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ComponentIsPreferredSwingMeshTag;                  // 0x11EC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUsingDirectRaycast;                               // 0x11F0(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11F1[0x7];                                     // 0x11F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNyxGlassTargetingData                 CurTargetingData;                                  // 0x11F8(0x0048)(BlueprintVisible, Transient, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1240[0x200];                                   // 0x1240(0x0200)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EndSwingingSession();
	bool IsAttacking();
	void Multicast_SetTargetingDataOnRemoteClients(const struct FNyxGlassTargetingData& NewData);
	void OnAttached();
	void OnAttackStart();
	void OnBPWeaponFired();
	void OnDetached();
	void OnNyxGlassStateChanged(const ENyxGlassState OldState, const ENyxGlassState NewState);
	void OnServerTargetingDataReceived();
	void OnTargetingComplete(const struct FNyxGlassTargetingData& TargetingData);
	void OnWeaponFired();
	void OnWeaponUnequip(class AFortWeapon* Weapon);
	void Server_SetTargetingData(const struct FNyxGlassTargetingData& NewData);
	bool ShouldUpdateTargeting();
	void UpdateRopeVFX();

	float CalcInitialAccelerationAlpha() const;
	ENyxGlassSlashSubstate GetNyxGlassSlashSubstate() const;
	ENyxGlassState GetNyxGlassState() const;
	void OnVelocityCalculated(const struct FNyxGlassVelocityMetadata& VelocityMetadata) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NyxGlassWeaponComponent_Swinging">();
	}
	static class UNyxGlassWeaponComponent_Swinging* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNyxGlassWeaponComponent_Swinging>();
	}
};

// Class DryBoxRuntime.NyxGlassFuelAttributeSet
// 0x0080 (0x00B0 - 0x0030)
class UNyxGlassFuelAttributeSet final : public UFortAttributeSet
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayAttributeData             MaxFuel;                                           // 0x0038(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, NativeAccessSpecifierPrivate)
	struct FFortGameplayAttributeData             Fuel;                                              // 0x0060(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPrivate)
	struct FFortGameplayAttributeData             LocalFuel;                                         // 0x0088(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPrivate)

public:
	void OnRep_Fuel(const struct FFortGameplayAttributeData& OldValue);
	void OnRep_LocalFuel(const struct FFortGameplayAttributeData& OldValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NyxGlassFuelAttributeSet">();
	}
	static class UNyxGlassFuelAttributeSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNyxGlassFuelAttributeSet>();
	}
};

// Class DryBoxRuntime.NyxGlassSwingingMovementControls
// 0x0000 (0x0030 - 0x0030)
class UNyxGlassSwingingMovementControls final : public UFortMovementControls
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NyxGlassSwingingMovementControls">();
	}
	static class UNyxGlassSwingingMovementControls* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNyxGlassSwingingMovementControls>();
	}
};

}

