#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmberRae_Axe_L_AnimBP_Post

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass EmberRae_Axe_L_AnimBP_Post.EmberRae_Axe_L_AnimBP_Post_C
// 0x0C20 (0x1310 - 0x06F0)
class UEmberRae_Axe_L_AnimBP_Post_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x06F8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0700(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0708(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0728(0x00C0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x07E8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0808(0x0020)()
	uint8                                         Pad_828[0x8];                                      // 0x0828(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0830(0x0990)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x11C0(0x0128)()
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x12E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TranslateMSTR;                                     // 0x12F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BlueprintInitializeAnimation();
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_EmberRae_Axe_L_AnimBP_Post(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EmberRae_Axe_L_AnimBP_Post_C">();
	}
	static class UEmberRae_Axe_L_AnimBP_Post_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmberRae_Axe_L_AnimBP_Post_C>();
	}
};

}

