#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicMediaBasePlayer

#include "Basic.hpp"

#include "EpicStreamMediaSource_structs.hpp"
#include "MediaUtils_structs.hpp"


namespace SDK::Params
{

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.GetMediaPlayer
// 0x0008 (0x0008 - 0x0000)
struct EpicBaseStreamingVideo_GetMediaPlayer final
{
public:
	class UMediaPlayer*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.GetMediaPlayerOptions
// 0x0030 (0x0030 - 0x0000)
struct EpicBaseStreamingVideo_GetMediaPlayerOptions final
{
public:
	struct FMediaPlayerOptions                    ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.GetMediaSource
// 0x0008 (0x0008 - 0x0000)
struct EpicBaseStreamingVideo_GetMediaSource final
{
public:
	class UEpicStreamMediaSource*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.HandleLicensedAudioTreatmentChanged
// 0x0001 (0x0001 - 0x0000)
struct EpicBaseStreamingVideo_HandleLicensedAudioTreatmentChanged final
{
public:
	EUCPTypes                                     UCPType;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.HandleMediaOpenedFailed
// 0x0010 (0x0010 - 0x0000)
struct EpicBaseStreamingVideo_HandleMediaOpenedFailed final
{
public:
	class FString                                 FailedUrl;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.Init
// 0x0020 (0x0020 - 0x0000)
struct EpicBaseStreamingVideo_Init final
{
public:
	class UMediaTexture*                          InVideoTexture;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMediaPlayer*                           InMediaPlayer;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEpicStreamMediaSource*                 InMediaSource;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InCDNFailover;                                     // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.OnFailedURL
// 0x0010 (0x0010 - 0x0000)
struct EpicBaseStreamingVideo_OnFailedURL final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.OnSuccessfulURL
// 0x0010 (0x0010 - 0x0000)
struct EpicBaseStreamingVideo_OnSuccessfulURL final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.Open
// 0x0038 (0x0038 - 0x0000)
struct EpicBaseStreamingVideo_Open final
{
public:
	struct FMediaPlayerOptions                    InMediaOptions;                                    // 0x0000(0x0030)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.RetryOnError
// 0x0001 (0x0001 - 0x0000)
struct EpicBaseStreamingVideo_RetryOnError final
{
public:
	bool                                          bFromPlayer;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.SetSoundSubmixes
// 0x0018 (0x0018 - 0x0000)
struct EpicBaseStreamingVideo_SetSoundSubmixes final
{
public:
	class UMediaSoundComponent*                   InSoundComponent;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundSubmixBase*                       InDefault;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundSubmixBase*                       InLicensed;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.SetVideoSize
// 0x0008 (0x0008 - 0x0000)
struct EpicBaseStreamingVideo_SetVideoSize final
{
public:
	int32                                         Width;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.Start
// 0x0018 (0x0018 - 0x0000)
struct EpicBaseStreamingVideo_Start final
{
public:
	class FString                                 InVUID;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMediaTexture*                          InVideoTexture;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.Stop
// 0x0001 (0x0001 - 0x0000)
struct EpicBaseStreamingVideo_Stop final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

