#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicStreamMediaSource

#include "Basic.hpp"

#include "EpicStreamMediaSource_structs.hpp"
#include "MediaUtils_structs.hpp"
#include "EpicMediaUtilities_structs.hpp"


namespace SDK::Params
{

// Function EpicStreamMediaSource.EpicStreamMediaSource.CancelVideoUrlRequest
// 0x0001 (0x0001 - 0x0000)
struct EpicStreamMediaSource_CancelVideoUrlRequest final
{
public:
	bool                                          bInCancelled;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicStreamMediaSource.EpicStreamMediaSource.IsScreenRecordingInProgress
// 0x0001 (0x0001 - 0x0000)
struct EpicStreamMediaSource_IsScreenRecordingInProgress final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicStreamMediaSource.EpicStreamMediaSource.MetadataResultHandler
// 0x0140 (0x0140 - 0x0000)
struct EpicStreamMediaSource_MetadataResultHandler final
{
public:
	struct FEpicMediaMetadataExt                  MetaData;                                          // 0x0000(0x0138)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0138(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function EpicStreamMediaSource.EpicStreamMediaSource.RequestVideoUrl
// 0x0008 (0x0008 - 0x0000)
struct EpicStreamMediaSource_RequestVideoUrl final
{
public:
	const class APlayerController*                FortPC;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicStreamMediaSource.EpicStreamMediaSource.SetLocalizedOverlaysV2
// 0x0008 (0x0008 - 0x0000)
struct EpicStreamMediaSource_SetLocalizedOverlaysV2 final
{
public:
	class UEpicMediaDownloadLocalizedOverlays*    InOverlays;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicStreamMediaSource.EpicStreamMediaSource.SetPlaybackStartTime
// 0x0004 (0x0004 - 0x0000)
struct EpicStreamMediaSource_SetPlaybackStartTime final
{
public:
	float                                         StartTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicStreamMediaSource.EpicStreamMediaSource.SetUrl
// 0x0010 (0x0010 - 0x0000)
struct EpicStreamMediaSource_SetUrl final
{
public:
	class FString                                 InURL;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicStreamMediaSource.EpicStreamMediaSource.ShouldProtectPlayerFromContent
// 0x0001 (0x0001 - 0x0000)
struct EpicStreamMediaSource_ShouldProtectPlayerFromContent final
{
public:
	EUCPTypes                                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicStreamMediaSource.EpicStreamMediaSource.HasLocalFilePlayback
// 0x0001 (0x0001 - 0x0000)
struct EpicStreamMediaSource_HasLocalFilePlayback final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicStreamMediaSource.EpicStreamMediaSource.ShouldStreamBePlaying
// 0x0018 (0x0018 - 0x0000)
struct EpicStreamMediaSource_ShouldStreamBePlaying final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UPrimitiveComponent*              PrimitiveComponent;                                // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CullRadius;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function EpicStreamMediaSource.EpicStreamMediaSource.UpdatePlayerOptions
// 0x0060 (0x0060 - 0x0000)
struct EpicStreamMediaSource_UpdatePlayerOptions final
{
public:
	struct FMediaPlayerOptions                    PlayerOptions;                                     // 0x0000(0x0030)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMediaPlayerOptions                    ReturnValue;                                       // 0x0030(0x0030)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

}

