#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventScreenBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum EventScreenBase.EEventScreenView
// NumValues: 0x0007
enum class EEventScreenView : uint8
{
	None                                     = 0,
	LandingPage                              = 1,
	RewardPreview                            = 2,
	MoreInfo                                 = 3,
	PurchaseReward                           = 4,
	LoadError                                = 5,
	EEventScreenView_MAX                     = 6,
};

// ScriptStruct EventScreenBase.DoubleWidthItem
// 0x0050 (0x0050 - 0x0000)
struct FDoubleWidthItem final
{
public:
	TSoftObjectPtr<class UFortItemDefinition>     ItemDefinition;                                    // 0x0000(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UTexture2D>              CustomItemTexture;                                 // 0x0028(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct EventScreenBase.EventScreenTrackData
// 0x0020 (0x0020 - 0x0000)
struct FEventScreenTrackData final
{
public:
	struct FLinearColor                           TrackColorPrimary;                                 // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TrackColorSecondary;                               // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct EventScreenBase.EventScreenCMSResourceGroupOverride
// 0x0018 (0x0018 - 0x0000)
struct FEventScreenCMSResourceGroupOverride final
{
public:
	int32                                         ResourceValue;                                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 KeyArtOverrideURL;                                 // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct EventScreenBase.EventScreenCMSData
// 0x01B8 (0x01B8 - 0x0000)
struct FEventScreenCMSData final
{
public:
	class FString                                 EventCMSId;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   EventName;                                         // 0x0010(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   EventDescription;                                  // 0x0028(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   ResourceHeader;                                    // 0x0040(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   StarterHeader;                                     // 0x0058(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   CompletionHeader;                                  // 0x0070(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   EventCTA;                                          // 0x0088(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   EventCTACompleted;                                 // 0x00A0(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   HeaderCTA;                                         // 0x00B8(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   ItemShopCallout;                                   // 0x00D0(0x0018)(NativeAccessSpecifierPublic)
	class FString                                 CTAIconURL;                                        // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 KeyArtURL;                                         // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   MoreInfoHeader;                                    // 0x0108(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   MoreInfoSubHeader;                                 // 0x0120(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   MoreInfoBody;                                      // 0x0138(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   MoreInfoLegal;                                     // 0x0150(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   PurchaseLegal;                                     // 0x0168(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   RewardTrackLegal;                                  // 0x0180(0x0018)(NativeAccessSpecifierPublic)
	class FString                                 ItemShopOfferId;                                   // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FEventScreenCMSResourceGroupOverride> ResourceGroupOverrides;                      // 0x01A8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct EventScreenBase.EventScreenCMSGroup
// 0x0010 (0x0010 - 0x0000)
struct FEventScreenCMSGroup final
{
public:
	TArray<struct FEventScreenCMSData>            EventScreens;                                      // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

}

