#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortCosmeticItemCard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortCosmeticItemCard.FortCosmeticItemCard_C
// 0x0030 (0x0360 - 0x0330)
class UFortCosmeticItemCard_C final : public UFortCosmeticItemCard
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       archived;                                          // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Hover;                                        // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ImageMaterial_NewItemCard;                         // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        BaseIconScale;                                     // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AnimationIconScale;                                // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void ArchiveAnimation(bool IsArchived, bool UseAnimations);
	void ExecuteUbergraph_FortCosmeticItemCard(int32 EntryPoint);
	void HandleUpdateRarity(const struct FFortColorPalette& RarityColors);
	void HandleUpdateVisuals(bool bIsItem, bool bIsBorderAnimated, bool IsHero, bool IsReward, bool IsShuffleItem, bool ShowAsArchived, bool UseAnimations);
	void OnHover();
	void OnSizeChanged(float InCardWidth);
	void OnUnhover();
	void OnUpdateEnhanced(bool bEnhanced);
	void OnUpdateItemCardIcon(class UTexture2D* Icon, float IconScale);
	void OnUpdateItemCardMaterial(class UMaterialInterface* Material);
	void OnUpdateSeriesOrRarityColors(const struct FFortColorPalette& ColorPalette);
	void OnUpdateVisuals(bool bIsItem, bool bIsBorderAnimated, bool bIsHero, bool bReward, bool bIsShuffleItem, bool bShowAsArchived, bool bUseAnimations);
	void SequenceEvent__ENTRYPOINTFortCosmeticItemCard();
	void UpdateImageIconScale();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortCosmeticItemCard_C">();
	}
	static class UFortCosmeticItemCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCosmeticItemCard_C>();
	}
};

}

