#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayEventRouter

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "GameplayEventRouter_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GameplayEventRouter.AsyncAction_StartListeningToEvent
// 0x0050 (0x0080 - 0x0030)
class UAsyncAction_StartListeningToEvent final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(class UAsyncAction_StartListeningToEvent* ProxyObject)> OnEventReceived; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x40];                                      // 0x0040(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAction_StartListeningToEvent* StartListeningToEvent(class UObject* WorldContextObject, class UGameplayEventRouterComponent* Target, class UScriptStruct* EventType, class UObject* Context, EEventBubblingRule EventBubblingRule);

	bool GetPayload(int32& OutPayload);
	void StopListeningToEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncAction_StartListeningToEvent">();
	}
	static class UAsyncAction_StartListeningToEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_StartListeningToEvent>();
	}
};

// Class GameplayEventRouter.AsyncAction_StartListeningToStatefulEvent
// 0x0070 (0x00A0 - 0x0030)
class UAsyncAction_StartListeningToStatefulEvent final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(class UAsyncAction_StartListeningToStatefulEvent* ProxyObject)> OnEventReceived; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UAsyncAction_StartListeningToStatefulEvent* ProxyObject)> OnSavedEventStateExists; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UAsyncAction_StartListeningToStatefulEvent* ProxyObject)> OnEventStateCleared; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x40];                                      // 0x0060(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAction_StartListeningToStatefulEvent* StartListeningToStatefulEvent(class UObject* WorldContextObject, class UGameplayEventRouterComponent* Target, class UScriptStruct* EventType, class UObject* Context, EEventBubblingRule EventBubblingRule);

	bool GetPayload(int32& OutPayload);
	void StopListeningToStatefulEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncAction_StartListeningToStatefulEvent">();
	}
	static class UAsyncAction_StartListeningToStatefulEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_StartListeningToStatefulEvent>();
	}
};

// Class GameplayEventRouter.GameplayEventRouterComponent
// 0x0228 (0x02C8 - 0x00A0)
class UGameplayEventRouterComponent : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x228];                                     // 0x00A0(0x0228)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearEventState(const class UScriptStruct* EventType);
	void ClearEventStateByContext(const class UScriptStruct* EventType, const class UObject* Context);
	bool K2_BroadcastEvent(const int32& EventData, class UObject* EventContext);
	bool K2_BroadcastStatefulEvent(const int32& EventData, class UObject* EventContext);
	void StopListeningToEvent(struct FGameplayEventListenerHandle& HandleToRemove);

	bool HasValidEventState(const class UScriptStruct* EventType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayEventRouterComponent">();
	}
	static class UGameplayEventRouterComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayEventRouterComponent>();
	}
};

// Class GameplayEventRouter.GameplayEventRouterOwnerInterface
// 0x0000 (0x0000 - 0x0000)
class IGameplayEventRouterOwnerInterface final
{
public:
	TSubclassOf<class UGameplayEventRouterComponent> GetEventRouterClass() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayEventRouterOwnerInterface">();
	}
	static class IGameplayEventRouterOwnerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGameplayEventRouterOwnerInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class GameplayEventRouter.GameplayEventRouterSubsytem
// 0x00B0 (0x00E0 - 0x0030)
class UGameplayEventRouterSubsytem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0xB0];                                      // 0x0030(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UGameplayEventRouterComponent* GetEventRouter(class UClass* Scope, class AActor* ContextActor);
	static class UGameplayEventRouterComponent* GetGlobalEventRouter(const class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayEventRouterSubsytem">();
	}
	static class UGameplayEventRouterSubsytem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayEventRouterSubsytem>();
	}
};

}

