#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayInteractionsModule

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "StateTreeModule_structs.hpp"
#include "StateTreeModule_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "SmartObjectsModule_structs.hpp"
#include "SmartObjectsModule_classes.hpp"
#include "GameplayInteractionsModule_structs.hpp"
#include "GameplayTasks_classes.hpp"
#include "StructUtils_structs.hpp"
#include "ContextualAnimation_structs.hpp"


namespace SDK
{

// Class GameplayInteractionsModule.GameplayActuationStateProvider
// 0x0000 (0x0000 - 0x0000)
class IGameplayActuationStateProvider final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayActuationStateProvider">();
	}
	static class IGameplayActuationStateProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGameplayActuationStateProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class GameplayInteractionsModule.GameplayInteractionSmartObjectBehaviorDefinition
// 0x0018 (0x0040 - 0x0028)
class UGameplayInteractionSmartObjectBehaviorDefinition : public USmartObjectBehaviorDefinition
{
public:
	struct FStateTreeReference                    StateTreeReference;                                // 0x0028(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayInteractionSmartObjectBehaviorDefinition">();
	}
	static class UGameplayInteractionSmartObjectBehaviorDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayInteractionSmartObjectBehaviorDefinition>();
	}
};

// Class GameplayInteractionsModule.GameplayTaskTransition
// 0x0000 (0x0000 - 0x0000)
class IGameplayTaskTransition final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayTaskTransition">();
	}
	static class IGameplayTaskTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGameplayTaskTransition>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class GameplayInteractionsModule.AITask_UseGameplayInteraction
// 0x0078 (0x00E0 - 0x0068)
class UAITask_UseGameplayInteraction final : public UAITask
{
public:
	TMulticastInlineDelegate<void()>              OnFinished;                                        // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	struct FGameplayInteractionContext            GameplayInteractionContext;                        // 0x0078(0x0048)(Protected, NativeAccessSpecifierProtected)
	struct FSmartObjectClaimHandle                ClaimedHandle;                                     // 0x00C0(0x0018)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayInteractionAbortContext       AbortContext;                                      // 0x00D8(0x0001)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAITask_UseGameplayInteraction* UseClaimedGameplayInteractionSmartObject(class AAIController* Controller, const struct FSmartObjectClaimHandle& ClaimHandle, bool bLockAILogic);

	void RequestAbort();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AITask_UseGameplayInteraction">();
	}
	static class UAITask_UseGameplayInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAITask_UseGameplayInteraction>();
	}
};

// Class GameplayInteractionsModule.GameplayActuationComponent
// 0x0038 (0x00D8 - 0x00A0)
class UGameplayActuationComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       ActuationState;                                    // 0x00A8(0x0010)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInstancedStruct>               Transitions;                                       // 0x00C0(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bEnableTransitions;                                // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayActuationComponent">();
	}
	static class UGameplayActuationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayActuationComponent>();
	}
};

// Class GameplayInteractionsModule.GameplayInteractionStateTreeSchema
// 0x0020 (0x0048 - 0x0028)
class UGameplayInteractionStateTreeSchema final : public UStateTreeSchema
{
public:
	TSubclassOf<class AActor>                     ContextActorClass;                                 // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AActor>                     SmartObjectActorClass;                             // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FStateTreeExternalDataDesc>     ContextDataDescs;                                  // 0x0038(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayInteractionStateTreeSchema">();
	}
	static class UGameplayInteractionStateTreeSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayInteractionStateTreeSchema>();
	}
};

// Class GameplayInteractionsModule.GameplayTask_MoveTo
// 0x01B8 (0x0218 - 0x0060)
class UGameplayTask_MoveTo : public UGameplayTask
{
public:
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnRequestFailed;                                   // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(EGameplayTaskActuationResult Result, class AActor* Actor)> OnCompleted; // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	class UCharacterMovementComponent*            MovementComponent;                                 // 0x0088(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameplayActuationComponent*            ActuationComponent;                                // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAIMoveRequest                         MoveRequest;                                       // 0x0098(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x120];                                     // 0x00E8(0x0120)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayTask*                          StartTransitionTask;                               // 0x0208(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameplayTask*                          EndTransitionTask;                                 // 0x0210(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UGameplayTask_MoveTo* MoveTo(class AActor* Actor, const struct FVector& GoalLocation, class AActor* GoalActor, const EGameplayTaskMoveToIntent EndOfPathIntent, float AcceptanceRadius, EAIOptionFlag StopOnOverlap, EAIOptionFlag AcceptPartialPath, bool bUsePathfinding, bool bUseContinuousGoalTracking, EAIOptionFlag ProjectGoalOnNavigation);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayTask_MoveTo">();
	}
	static class UGameplayTask_MoveTo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayTask_MoveTo>();
	}
};

// Class GameplayInteractionsModule.GameplayTask_MoveToContextualAnim
// 0x0058 (0x0270 - 0x0218)
class UGameplayTask_MoveToContextualAnim final : public UGameplayTask_MoveTo
{
public:
	struct FGameplayActuationState_ContextualAnim NextState;                                         // 0x0218(0x0058)(Protected, NativeAccessSpecifierProtected)

public:
	static class UGameplayTask_MoveToContextualAnim* EnterContextualAnim(class AActor* Interactor, const class FName InteractorRole, class AActor* InteractableObject, const class FName InteractableObjectRole, const class FName SectionName, const class FName ExitSectionName, const class UContextualAnimSceneAsset* SceneAsset);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayTask_MoveToContextualAnim">();
	}
	static class UGameplayTask_MoveToContextualAnim* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayTask_MoveToContextualAnim>();
	}
};

// Class GameplayInteractionsModule.GameplayTask_MoveToStandTransition
// 0x00E0 (0x0140 - 0x0060)
class UGameplayTask_MoveToStandTransition final : public UGameplayTask
{
public:
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterMovementComponent*            MovementComponent;                                 // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_78[0xC8];                                      // 0x0078(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayTask_MoveToStandTransition">();
	}
	static class UGameplayTask_MoveToStandTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayTask_MoveToStandTransition>();
	}
};

// Class GameplayInteractionsModule.GameplayTask_PlayContextualAnim
// 0x01C0 (0x0220 - 0x0060)
class UGameplayTask_PlayContextualAnim final : public UGameplayTask
{
public:
	uint8                                         Pad_60[0x80];                                      // 0x0060(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnRequestFailed;                                   // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(EGameplayTaskActuationResult Result, class AActor* Actor)> OnCompleted; // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	int32                                         SectionIdx;                                        // 0x0100(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         AnimSetIdx;                                        // 0x0104(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FTransform>                     Pivots;                                            // 0x0108(0x0010)(Net, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UContextualAnimSceneAsset*              SceneAsset;                                        // 0x0118(0x0008)(Net, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   InteractorRole;                                    // 0x0120(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 InteractableObject;                                // 0x0128(0x0008)(Net, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   InteractableObjectRole;                            // 0x0130(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ExitSectionName;                                   // 0x0134(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UContextualAnimSceneInstance*           SceneInstance;                                     // 0x0138(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameplayActuationComponent*            ActuationComponent;                                // 0x0140(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FContextualAnimStartSceneParams        SceneParams;                                       // 0x0148(0x0068)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FTransform                             SafeExitPoint;                                     // 0x01B0(0x0060)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPlayContextualAnimStatus                     Status;                                            // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTeleportOnTaskEnd;                                // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_212[0xE];                                      // 0x0212(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UGameplayTask_PlayContextualAnim* PlayContextualAnim(class AActor* Interactor, const class FName InteractorRole_0, class AActor* InteractableObject_0, const class FName InteractableObjectRole_0, const class FName SectionName, const class FName ExitSectionName_0, const class UContextualAnimSceneAsset* SceneAsset_0);

	void OnSectionEndTimeReached(class UContextualAnimSceneInstance* SceneInstance_0);
	void SetExit(EPlayContextualAnimExitMode ExitMode, class FName NewExitSectionName);

	EPlayContextualAnimStatus GetStatus() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayTask_PlayContextualAnim">();
	}
	static class UGameplayTask_PlayContextualAnim* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayTask_PlayContextualAnim>();
	}
};

// Class GameplayInteractionsModule.GameplayTask_StandAt
// 0x00C8 (0x0128 - 0x0060)
class UGameplayTask_StandAt final : public UGameplayTask
{
public:
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnRequestFailed;                                   // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(EGameplayTaskActuationResult Result, class AActor* Actor)> OnCompleted; // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0x98];                                      // 0x0088(0x0098)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterMovementComponent*            MovementComponent;                                 // 0x0120(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UGameplayTask_StandAt* StandAt(class APawn* Pawn, float Duration);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayTask_StandAt">();
	}
	static class UGameplayTask_StandAt* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayTask_StandAt>();
	}
};

// Class GameplayInteractionsModule.GameplayTask_StandToMoveTransition
// 0x00E0 (0x0140 - 0x0060)
class UGameplayTask_StandToMoveTransition final : public UGameplayTask
{
public:
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterMovementComponent*            MovementComponent;                                 // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_78[0xC8];                                      // 0x0078(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayTask_StandToMoveTransition">();
	}
	static class UGameplayTask_StandToMoveTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayTask_StandToMoveTransition>();
	}
};

// Class GameplayInteractionsModule.GameplayTask_SuddenTurnTransition
// 0x00E0 (0x0140 - 0x0060)
class UGameplayTask_SuddenTurnTransition final : public UGameplayTask
{
public:
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterMovementComponent*            MovementComponent;                                 // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_78[0xC8];                                      // 0x0078(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayTask_SuddenTurnTransition">();
	}
	static class UGameplayTask_SuddenTurnTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayTask_SuddenTurnTransition>();
	}
};

}

