#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayInteractionsModule

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "StateTreeModule_structs.hpp"
#include "SmartObjectsModule_structs.hpp"
#include "StructUtils_structs.hpp"


namespace SDK
{

// Enum GameplayInteractionsModule.EGameplayTaskActuationResult
// NumValues: 0x0005
enum class EGameplayTaskActuationResult : uint8
{
	None                                     = 0,
	RequestFailed                            = 1,
	Failed                                   = 2,
	Succeeded                                = 3,
	EGameplayTaskActuationResult_MAX         = 4,
};

// Enum GameplayInteractionsModule.EGameplayTransitionResult
// NumValues: 0x0004
enum class EGameplayTransitionResult : uint8
{
	Cancelled                                = 0,
	Succeeded                                = 1,
	Failed                                   = 2,
	EGameplayTransitionResult_MAX            = 3,
};

// Enum GameplayInteractionsModule.EGameplayInteractionAbortReason
// NumValues: 0x0004
enum class EGameplayInteractionAbortReason : uint8
{
	Unset                                    = 0,
	ExternalAbort                            = 1,
	InternalAbort                            = 2,
	EGameplayInteractionAbortReason_MAX      = 3,
};

// Enum GameplayInteractionsModule.EGameplayInteractionModifyGameplayTagOperation
// NumValues: 0x0003
enum class EGameplayInteractionModifyGameplayTagOperation : uint8
{
	Add                                      = 0,
	Remove                                   = 1,
	EGameplayInteractionModifyGameplayTagOperation_MAX = 2,
};

// Enum GameplayInteractionsModule.EGameplayInteractionTaskModify
// NumValues: 0x0006
enum class EGameplayInteractionTaskModify : uint8
{
	OnEnterStateUndoOnExitState              = 0,
	OnEnterState                             = 1,
	OnExitState                              = 2,
	OnExitStateFailed                        = 3,
	OnExitStateSucceeded                     = 4,
	EGameplayInteractionTaskModify_MAX       = 5,
};

// Enum GameplayInteractionsModule.EGameplayInteractionTaskTrigger
// NumValues: 0x0005
enum class EGameplayInteractionTaskTrigger : uint8
{
	OnEnterState                             = 0,
	OnExitState                              = 1,
	OnExitStateSucceeded                     = 2,
	OnExitStateFailed                        = 3,
	EGameplayInteractionTaskTrigger_MAX      = 4,
};

// Enum GameplayInteractionsModule.EGameplayTaskMoveToIntent
// NumValues: 0x0003
enum class EGameplayTaskMoveToIntent : uint8
{
	Stop                                     = 0,
	KeepMoving                               = 1,
	EGameplayTaskMoveToIntent_MAX            = 2,
};

// Enum GameplayInteractionsModule.EPlayContextualAnimExitMode
// NumValues: 0x0004
enum class EPlayContextualAnimExitMode : uint8
{
	DefaultExit                              = 0,
	FastExit                                 = 1,
	Teleport                                 = 2,
	EPlayContextualAnimExitMode_MAX          = 3,
};

// Enum GameplayInteractionsModule.EPlayContextualAnimStatus
// NumValues: 0x0005
enum class EPlayContextualAnimStatus : uint8
{
	Unset                                    = 0,
	Playing                                  = 1,
	DonePlaying                              = 2,
	Failed                                   = 3,
	EPlayContextualAnimStatus_MAX            = 4,
};

// Enum GameplayInteractionsModule.EGameplayInteractionMatchSlotTagSource
// NumValues: 0x0003
enum class EGameplayInteractionMatchSlotTagSource : uint8
{
	ActivityTags                             = 0,
	RuntimeTags                              = 1,
	EGameplayInteractionMatchSlotTagSource_MAX = 2,
};

// Enum GameplayInteractionsModule.EGameplayInteractionSlotReferenceType
// NumValues: 0x0003
enum class EGameplayInteractionSlotReferenceType : uint8
{
	ByActivityTag                            = 0,
	ByLinkTag                                = 1,
	EGameplayInteractionSlotReferenceType_MAX = 2,
};

// Enum GameplayInteractionsModule.EGameplayInteractionSyncSlotTransitionState
// NumValues: 0x0004
enum class EGameplayInteractionSyncSlotTransitionState : uint8
{
	WaitingForFromTag                        = 0,
	WaitingForToTag                          = 1,
	Completed                                = 2,
	EGameplayInteractionSyncSlotTransitionState_MAX = 3,
};

// ScriptStruct GameplayInteractionsModule.GameplayActuationStateBase
// 0x0028 (0x0028 - 0x0000)
struct FGameplayActuationStateBase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActuationName;                                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                NavigationLocation;                                // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GameplayInteractionsModule.GameplayActuationPredictedLocation
// 0x0030 (0x0030 - 0x0000)
struct FGameplayActuationPredictedLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              Direction;                                         // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.GameplayActuationState_Moving
// 0x0060 (0x0088 - 0x0028)
struct FGameplayActuationState_Moving : public FGameplayActuationStateBase
{
public:
	struct FVector3f                              HeadingDirection;                                  // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayActuationPredictedLocation    Prediction;                                        // 0x0038(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x20];                                      // 0x0068(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.GameplayActuationState_Standing
// 0x0000 (0x0088 - 0x0088)
struct FGameplayActuationState_Standing final : public FGameplayActuationState_Moving
{
};

// ScriptStruct GameplayInteractionsModule.GameplayActuationState_MovingTransition
// 0x0000 (0x0088 - 0x0088)
struct FGameplayActuationState_MovingTransition final : public FGameplayActuationState_Moving
{
};

// ScriptStruct GameplayInteractionsModule.GameplayTransitionDesc
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FGameplayTransitionDesc
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionAbortContext
// 0x0001 (0x0001 - 0x0000)
struct FGameplayInteractionAbortContext final
{
public:
	EGameplayInteractionAbortReason               Reason;                                            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionContext
// 0x0048 (0x0048 - 0x0000)
struct FGameplayInteractionContext final
{
public:
	struct FStateTreeInstanceData                 StateTreeInstanceData;                             // 0x0000(0x0010)(Protected, NativeAccessSpecifierProtected)
	struct FSmartObjectClaimHandle                ClaimedHandle;                                     // 0x0010(0x0018)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayInteractionAbortContext       AbortContext;                                      // 0x0028(0x0001)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ContextActor;                                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 SmartObjectActor;                                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameplayInteractionSmartObjectBehaviorDefinition* Definition;                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionSlotUserData
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FGameplayInteractionSlotUserData final : public FSmartObjectSlotStateData
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionStateTreeTask
// 0x0000 (0x0020 - 0x0020)
struct FGameplayInteractionStateTreeTask : public FStateTreeTaskBase
{
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionStateTreeCondition
// 0x0000 (0x0020 - 0x0020)
struct FGameplayInteractionStateTreeCondition : public FStateTreeConditionBase
{
};

// ScriptStruct GameplayInteractionsModule.GameplayTransitionDesc_MoveToStand
// 0x0000 (0x0008 - 0x0008)
struct FGameplayTransitionDesc_MoveToStand final : public FGameplayTransitionDesc
{
};

// ScriptStruct GameplayInteractionsModule.GameplayActuationState_ContextualAnim
// 0x0030 (0x0058 - 0x0028)
struct FGameplayActuationState_ContextualAnim final : public FGameplayActuationStateBase
{
public:
	class FName                                   InteractorRole;                                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 InteractableObject;                                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InteractableObjectRole;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SectionName;                                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ExitSectionName;                                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UContextualAnimSceneAsset*              SceneAsset;                                        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UContextualAnimSceneInstance*           SceneInstance;                                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GameplayInteractionsModule.GameplayTransitionDesc_EnterContextualAnim
// 0x0000 (0x0008 - 0x0008)
struct FGameplayTransitionDesc_EnterContextualAnim final : public FGameplayTransitionDesc
{
};

// ScriptStruct GameplayInteractionsModule.GameplayTransitionDesc_ExitContextualAnim
// 0x0000 (0x0008 - 0x0008)
struct FGameplayTransitionDesc_ExitContextualAnim final : public FGameplayTransitionDesc
{
};

// ScriptStruct GameplayInteractionsModule.GameplayTransitionDesc_StandToMove
// 0x0000 (0x0008 - 0x0008)
struct FGameplayTransitionDesc_StandToMove final : public FGameplayTransitionDesc
{
};

// ScriptStruct GameplayInteractionsModule.GameplayTransitionDesc_SuddenTurn
// 0x0000 (0x0008 - 0x0008)
struct FGameplayTransitionDesc_SuddenTurn final : public FGameplayTransitionDesc
{
};

// ScriptStruct GameplayInteractionsModule.ContextualAnimStateTreeTaskInstanceData
// 0x0038 (0x0038 - 0x0000)
struct FContextualAnimStateTreeTaskInstanceData final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UContextualAnimSceneAsset*              ContextualAnimAsset;                               // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InteractableObject;                                // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameplayTask_PlayContextualAnim*       Task;                                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InteractorRole;                                    // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InteractableObjectRole;                            // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayInteractionAbortContext       AbortContext;                                      // 0x0030(0x0001)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.ContextualAnimStateTreeTask
// 0x0010 (0x0030 - 0x0020)
struct FContextualAnimStateTreeTask final : public FGameplayInteractionStateTreeTask
{
public:
	class FName                                   Section;                                           // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ExitSection;                                       // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnabled;                                          // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionMatchSlotTagsConditionInstanceData
// 0x0028 (0x0028 - 0x0000)
struct FGameplayInteractionMatchSlotTagsConditionInstanceData final
{
public:
	struct FSmartObjectSlotHandle                 Slot;                                              // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  TagsToMatch;                                       // 0x0008(0x0020)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionSlotTagsMatchCondition
// 0x0008 (0x0028 - 0x0020)
struct FGameplayInteractionSlotTagsMatchCondition final : public FGameplayInteractionStateTreeCondition
{
public:
	EGameplayInteractionMatchSlotTagSource        Source;                                            // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameplayContainerMatchType                   MatchType;                                         // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExactMatch;                                       // 0x0022(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvert;                                           // 0x0023(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionQuerySlotTagsConditionInstanceData
// 0x0008 (0x0008 - 0x0000)
struct FGameplayInteractionQuerySlotTagsConditionInstanceData final
{
public:
	struct FSmartObjectSlotHandle                 Slot;                                              // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionQuerySlotTagCondition
// 0x0058 (0x0078 - 0x0020)
struct FGameplayInteractionQuerySlotTagCondition final : public FGameplayInteractionStateTreeCondition
{
public:
	EGameplayInteractionMatchSlotTagSource        Source;                                            // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      TagQuery;                                          // 0x0028(0x0048)(Edit, NativeAccessSpecifierPublic)
	bool                                          bInvert;                                           // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionIsSlotHandleValidConditionInstanceData
// 0x0008 (0x0008 - 0x0000)
struct FGameplayInteractionIsSlotHandleValidConditionInstanceData final
{
public:
	struct FSmartObjectSlotHandle                 Slot;                                              // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionIsSlotHandleValidCondition
// 0x0008 (0x0028 - 0x0020)
struct FGameplayInteractionIsSlotHandleValidCondition final : public FGameplayInteractionStateTreeCondition
{
public:
	bool                                          bInvert;                                           // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionFindSlotTaskInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FGameplayInteractionFindSlotTaskInstanceData final
{
public:
	struct FSmartObjectSlotHandle                 ReferenceSlot;                                     // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSmartObjectSlotHandle                 ResultSlot;                                        // 0x0008(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionFindSlotTask
// 0x0010 (0x0030 - 0x0020)
struct FGameplayInteractionFindSlotTask final : public FGameplayInteractionStateTreeTask
{
public:
	EGameplayInteractionSlotReferenceType         ReferenceType;                                     // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           FindByTag;                                         // 0x0024(0x0004)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionGetSlotActorTaskInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FGameplayInteractionGetSlotActorTaskInstanceData final
{
public:
	struct FSmartObjectSlotHandle                 TargetSlot;                                        // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ResultActor;                                       // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionGetSlotActorTask
// 0x0008 (0x0028 - 0x0020)
struct FGameplayInteractionGetSlotActorTask final : public FGameplayInteractionStateTreeTask
{
public:
	bool                                          bFailIfNotFound;                                   // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionListenSlotEventsTaskInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FGameplayInteractionListenSlotEventsTaskInstanceData final
{
public:
	struct FSmartObjectSlotHandle                 TargetSlot;                                        // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionListenSlotEventsTask
// 0x0008 (0x0028 - 0x0020)
struct FGameplayInteractionListenSlotEventsTask final : public FGameplayInteractionStateTreeTask
{
public:
	uint8                                         Pad_20[0x8];                                       // 0x0020(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionModifySlotTagTaskInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FGameplayInteractionModifySlotTagTaskInstanceData final
{
public:
	struct FSmartObjectSlotHandle                 TargetSlot;                                        // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTagRemoved;                                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionModifySlotTagTask
// 0x0010 (0x0030 - 0x0020)
struct FGameplayInteractionModifySlotTagTask final : public FGameplayInteractionStateTreeTask
{
public:
	EGameplayInteractionTaskModify                Modify;                                            // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EGameplayInteractionModifyGameplayTagOperation Operation;                                        // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           tag;                                               // 0x0024(0x0004)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionSendSlotEventTaskInstanceData
// 0x0008 (0x0008 - 0x0000)
struct FGameplayInteractionSendSlotEventTaskInstanceData final
{
public:
	struct FSmartObjectSlotHandle                 TargetSlot;                                        // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionSendSlotEventTask
// 0x0020 (0x0040 - 0x0020)
struct FGameplayInteractionSendSlotEventTask final : public FGameplayInteractionStateTreeTask
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0020(0x0004)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       Payload;                                           // 0x0028(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	EGameplayInteractionTaskTrigger               Trigger;                                           // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShouldTriggerOnReselect;                          // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionSetSlotEnabledInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FGameplayInteractionSetSlotEnabledInstanceData final
{
public:
	struct FSmartObjectSlotHandle                 TargetSlot;                                        // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitialState;                                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionSetSlotEnabledTask
// 0x0008 (0x0028 - 0x0020)
struct FGameplayInteractionSetSlotEnabledTask final : public FGameplayInteractionStateTreeTask
{
public:
	EGameplayInteractionTaskModify                Modify;                                            // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableSlot;                                       // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionSyncSlotTagStateInstanceData
// 0x0018 (0x0018 - 0x0000)
struct FGameplayInteractionSyncSlotTagStateInstanceData final
{
public:
	struct FSmartObjectSlotHandle                 TargetSlot;                                        // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionSyncSlotTagStateTask
// 0x0010 (0x0030 - 0x0020)
struct FGameplayInteractionSyncSlotTagStateTask final : public FGameplayInteractionStateTreeTask
{
public:
	struct FGameplayTag                           TagToMonitor;                                      // 0x0020(0x0004)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           BreakEventTag;                                     // 0x0024(0x0004)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionSyncSlotTagTransitionInstanceData
// 0x0018 (0x0018 - 0x0000)
struct FGameplayInteractionSyncSlotTagTransitionInstanceData final
{
public:
	struct FSmartObjectSlotHandle                 TargetSlot;                                        // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.GameplayInteractionSyncSlotTagTransitionTask
// 0x0010 (0x0030 - 0x0020)
struct FGameplayInteractionSyncSlotTagTransitionTask final : public FGameplayInteractionStateTreeTask
{
public:
	struct FGameplayTag                           TransitionFromTag;                                 // 0x0020(0x0004)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           TransitionToTag;                                   // 0x0024(0x0004)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           TransitionEventTag;                                // 0x0028(0x0004)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.PlayMontageStateTreeTaskInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FPlayMontageStateTreeTaskInstanceData final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ComputedDuration;                                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GameplayInteractionsModule.PlayMontageStateTreeTask
// 0x0008 (0x0028 - 0x0020)
struct FPlayMontageStateTreeTask final : public FGameplayInteractionStateTreeTask
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0020(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct GameplayInteractionsModule.StateTreeTask_FindSlotEntryForActor_InstanceData
// 0x0080 (0x0080 - 0x0000)
struct FStateTreeTask_FindSlotEntryForActor_InstanceData final
{
public:
	class AActor*                                 UserActor;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSmartObjectSlotHandle                 ReferenceSlot;                                     // 0x0008(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             EntryTransform;                                    // 0x0010(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           EntryTag;                                          // 0x0070(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0xC];                                       // 0x0074(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameplayInteractionsModule.StateTreeTask_FindSlotEntryForActor
// 0x0030 (0x0050 - 0x0020)
struct FStateTreeTask_FindSlotEntryForActor final : public FGameplayInteractionStateTreeTask
{
public:
	EFSmartObjectSlotEntrySelectionMethod         SelectMethod;                                      // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRequireResultInNavigableSpace;                    // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseSlotLocationAsFallbackCandidate;               // 0x0022(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIncludeEntriesAsCandidates;                       // 0x0023(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIncludeExistsAsCandidates;                        // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UNavigationQueryFilter>     NavigationFilter;                                  // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector3f                              NavigationValidationExtents;                       // 0x0030(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator3f                             ResultRotationAdjustment;                          // 0x003C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

