#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameHubRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "PlayspaceSystem_classes.hpp"


namespace SDK
{

// Class GameHubRuntime.GameHubBaseMutator
// 0x0010 (0x0340 - 0x0330)
class AGameHubBaseMutator final : public AFortAthenaMutator
{
public:
	uint8                                         Pad_330[0x10];                                     // 0x0330(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameHubBaseMutator">();
	}
	static class AGameHubBaseMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameHubBaseMutator>();
	}
};

// Class GameHubRuntime.GameHubPlayerSpawningComponent
// 0x0020 (0x00D0 - 0x00B0)
class UGameHubPlayerSpawningComponent final : public UPlayspaceComponent_PlayerSpawning
{
public:
	struct FGameplayTagContainer                  PlayerStartRequirements;                           // 0x00B0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameHubPlayerSpawningComponent">();
	}
	static class UGameHubPlayerSpawningComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameHubPlayerSpawningComponent>();
	}
};

// Class GameHubRuntime.GameHubPlayspace
// 0x0028 (0x0698 - 0x0670)
class AGameHubPlayspace final : public AFortPlayspace
{
public:
	bool                                          bSimulatePlayerDamage;                             // 0x0670(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_671[0x7];                                      // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  PlayerStartRequirements;                           // 0x0678(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameHubPlayspace">();
	}
	static class AGameHubPlayspace* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameHubPlayspace>();
	}
};

}

