#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GiftingUI

#include "Basic.hpp"

#include "SocialUMG_classes.hpp"
#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"
#include "GiftingUI_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class GiftingUI.AthenaGiftConfirmedPanel
// 0x0028 (0x03D0 - 0x03A8)
class UAthenaGiftConfirmedPanel final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x18];                                     // 0x03A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class URichTextBlock*                         Text_RecipientInfo;                                // 0x03C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Back;                                       // 0x03C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftConfirmedPanel">();
	}
	static class UAthenaGiftConfirmedPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftConfirmedPanel>();
	}
};

// Class GiftingUI.AthenaGiftingConfirmationScreen
// 0x0158 (0x0500 - 0x03A8)
class UAthenaGiftingConfirmationScreen final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x30];                                     // 0x03A8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               PresentedGiftableOfferInfo;                        // 0x03D8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortStoreFrontOfferInfo*               PresentedOptionalTokenOfferInfo;                   // 0x03E0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E8[0xBC];                                     // 0x03E8(0x00BC)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinGiftSubmissionDelay;                            // 0x04A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxGiftSubmissionDelay;                            // 0x04A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4AC[0x14];                                     // 0x04AC(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    Button_WrapOptions;                                // 0x04C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Back;                                       // 0x04C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_MobileClose;                                // 0x04D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_MtxWallet;                                  // 0x04D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingPurchasePanel*            Panel_GiftingPurchase;                             // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingWrapOptionsPanel*         Panel_WrapOptions;                                 // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftConfirmedPanel*              Panel_GiftConfirmed;                               // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingErrorsPanel*              Panel_GiftingErrors;                               // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Dismiss(const bool bGiftConfirmed);
	void HandleGiftSent(bool bSuccess, const TArray<class FString>& IneligibleAccounts, const TArray<class FString>& ErrorCodes);
	void HandleTokenOfferPurchaseComplete(bool bSuccess, const TArray<struct FPurchasedItemInfo>& PurchasedItems);
	void OnPresentationModeChanged(EGiftingPresentationMode NewMode);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingConfirmationScreen">();
	}
	static class UAthenaGiftingConfirmationScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingConfirmationScreen>();
	}
};

// Class GiftingUI.AthenaGiftingErrorsPanel
// 0x0060 (0x0408 - 0x03A8)
class UAthenaGiftingErrorsPanel final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x30];                                     // 0x03A8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class URichTextBlock*                         Text_RecipientInfo;                                // 0x03D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                         Text_Title;                                        // 0x03E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_MobileClose;                                // 0x03E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Back;                                       // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Continue;                                   // 0x03F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTileView*                              TileView_Items;                                    // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void UpdateGiftEligibility(bool bStillGiftable);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingErrorsPanel">();
	}
	static class UAthenaGiftingErrorsPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingErrorsPanel>();
	}
};

// Class GiftingUI.AthenaGiftingPriceWidget
// 0x0020 (0x02B0 - 0x0290)
class UAthenaGiftingPriceWidget final : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                       Text_RealMoneyPrice;                               // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_FinalPrice;                                   // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_RegularPrice;                                 // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Overlay_SalePrice;                                 // 0x02A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetPresentationMode(EGiftingPricePresentationMode Mode);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingPriceWidget">();
	}
	static class UAthenaGiftingPriceWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingPriceWidget>();
	}
};

// Class GiftingUI.AthenaGiftingPurchaseButton
// 0x0010 (0x1490 - 0x1480)
class UAthenaGiftingPurchaseButton final : public UFortHoldableButton
{
public:
	class UAthenaGiftingPriceWidget*              Widget_Price;                                      // 0x1478(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Title;                                        // 0x1480(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1488[0x8];                                     // 0x1488(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingPurchaseButton">();
	}
	static class UAthenaGiftingPurchaseButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingPurchaseButton>();
	}
};

// Class GiftingUI.AthenaGiftingPurchasePanel
// 0x0048 (0x03F0 - 0x03A8)
class UAthenaGiftingPurchasePanel final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x18];                                     // 0x03A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaGiftingPurchaseButton*           Button_PurchaseGift;                               // 0x03C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSocialAvatarIcon*                  Avatar_MemberIcon;                                 // 0x03C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_SocialNameInfo;                               // 0x03D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemsCount;                                   // 0x03D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_OfferName;                                    // 0x03E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTileView*                              TileView_Items;                                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void PlayIntroAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingPurchasePanel">();
	}
	static class UAthenaGiftingPurchasePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingPurchasePanel>();
	}
};

// Class GiftingUI.AthenaGiftingScreen
// 0x01E0 (0x0850 - 0x0670)
class UAthenaGiftingScreen final : public UFortItemPreviewScreen
{
public:
	uint8                                         Pad_670[0x8];                                      // 0x0670(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGiftingUserSearchWidget*           SearchWidget_SocialSearchWidget;                   // 0x0678(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortGiftingSocialUserListView*         ListView_Recipients;                               // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTileView*                              TileView_Items;                                    // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0690(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_MobileClose;                                // 0x0698(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_GiftingPolicy;                              // 0x06A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CameraControl;                              // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_OfferName;                                    // 0x06B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_VBucksOffCount;                               // 0x06B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ShownItemIndex;                               // 0x06C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   Text_NoContent;                                    // 0x06C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_OfferItemOwnedCount;                      // 0x06D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Container_VBucksOffViolator;                       // 0x06D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_GiftCount;                                // 0x06E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingPriceWidget*              Widget_Price;                                      // 0x06E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaLockerItemInfo*                  Widget_ItemInfo;                                   // 0x06F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_FilterTabs;                               // 0x06F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActionWidget*                    ActionWidget_FilterTabsPrevious;                   // 0x0700(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActionWidget*                    ActionWidget_FilterTabsNext;                       // 0x0708(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingConfirmationScreen*       ActivatableWidget_GiftingConfirmation;             // 0x0710(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ItemCyclingInterval;                               // 0x0718(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_71C[0x4];                                      // 0x071C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    FilterTabsPreviousAction;                          // 0x0720(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    FilterTabsNextAction;                              // 0x0730(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	class FText                                   RegularGiftingPolicy;                              // 0x0740(0x0018)(Edit, NativeAccessSpecifierPrivate)
	class FText                                   BattlePassGiftingPolicy;                           // 0x0758(0x0018)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_770[0x60];                                     // 0x0770(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UCommonButtonLegacy*, EFilterType> FilterMap;                                         // 0x07D0(0x0050)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UCommonButtonGroupLegacy*               FilterGroup;                                       // 0x0820(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortItemDefinition*>            ItemDefinitions;                                   // 0x0828(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UFortItemDefinition*                    PresentedItemDefinition;                           // 0x0838(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortStoreFrontOfferInfo*               GiftableOfferInfo;                                 // 0x0840(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortStoreFrontOfferInfo*               OptionalTokenOfferInfo;                            // 0x0848(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BlockScreenContent(const bool bBlockScreen, const class FText& ContentBlockedText);
	void OnFilterChanged(EFilterType FilterType);
	void OnFriendSelectionChanged();
	void OnPartyListUpdated(bool bEmpty);
	void OnPresentationModeChanged(EGiftingScreenPresentationMode Mode);
	void OnSetupFilterTabButton(class UCommonButtonLegacy* Button, EFilterType FilterType);
	void OnShownItemChanged();
	void OnShowSearchWarningText(bool bShow);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingScreen">();
	}
	static class UAthenaGiftingScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingScreen>();
	}
};

// Class GiftingUI.AthenaGiftingWrapOptionsPanel
// 0x0068 (0x0410 - 0x03A8)
class UAthenaGiftingWrapOptionsPanel final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x28];                                     // 0x03A8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UFortGiftBoxItemDefinition>> GiftBoxes;                              // 0x03D0(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UFortGiftBoxItemDefinition*>     GiftBoxItemDefs;                                   // 0x03E0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3F0[0x10];                                     // 0x03F0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    Button_ConfirmWrap;                                // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTileView*                              TileView_WrapOptions;                              // 0x0408(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGiftingWrapOptionsPanel">();
	}
	static class UAthenaGiftingWrapOptionsPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftingWrapOptionsPanel>();
	}
};

// Class GiftingUI.FortGiftingSocialUserListEntry
// 0x00E0 (0x1530 - 0x1450)
class UFortGiftingSocialUserListEntry final : public USocialListEntryBase
{
public:
	uint8                                         Pad_1448[0xC0];                                    // 0x1448(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSocialAvatarIcon*                  Avatar_MemberIcon;                                 // 0x1508(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USocialNameTextBlock*                   Text_SocialName;                                   // 0x1510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_EligibilityStatus;                        // 0x1518(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_OwnedItems;                               // 0x1520(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaGiftingPriceWidget*              Widget_Price;                                      // 0x1528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BP_OnHighlightedStateChanged(bool bInIsHighlighted, bool bPlayAnimation);
	void BP_OnTouchSelectionConfirmed();
	void OnRecipientStatusUpdated();
	void OnUserItemSet();
	void SetPresentationMode(ERecipientPresentationMode Mode);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingSocialUserListEntry">();
	}
	static class UFortGiftingSocialUserListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingSocialUserListEntry>();
	}
};

// Class GiftingUI.FortGiftingSocialUserListView
// 0x00F8 (0x0458 - 0x0360)
class UFortGiftingSocialUserListView final : public USocialUserListViewBase
{
public:
	float                                         RefreshRecipientStatusDelay;                       // 0x0360(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_364[0xF4];                                     // 0x0364(0x00F4)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingSocialUserListView">();
	}
	static class UFortGiftingSocialUserListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingSocialUserListView>();
	}
};

// Class GiftingUI.FortGiftingUserSearchWidget
// 0x0048 (0x02D8 - 0x0290)
class UFortGiftingUserSearchWidget final : public UCommonUserWidget
{
public:
	class UEditableText*                          EditableText_SearchFriends;                        // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_ClearQuery;                                 // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_SubmitQuery;                                // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A8[0x30];                                     // 0x02A8(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FocusEditableText();
	void HandleSearchFriendsTextChanged(const class FText& Text);
	void HandleSearchFriendsTextEntered(const class FText& Text, ETextCommit CommitMethod);
	void OnSearchCommit(bool bSearchStringShort);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingUserSearchWidget">();
	}
	static class UFortGiftingUserSearchWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingUserSearchWidget>();
	}
};

// Class GiftingUI.FortGiftingWrapOptionListEntry
// 0x0020 (0x1450 - 0x1430)
class UFortGiftingWrapOptionListEntry final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_1430[0x8];                                     // 0x1430(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGiftBoxItemDefinition*             GiftBoxDefinition;                                 // 0x1438(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonLazyImage*                       Image_Gift;                                        // 0x1440(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1448[0x8];                                     // 0x1448(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingWrapOptionListEntry">();
	}
	static class UFortGiftingWrapOptionListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingWrapOptionListEntry>();
	}
};

// Class GiftingUI.FortGiftingData
// 0x0028 (0x0548 - 0x0520)
class UFortGiftingData final : public UFortGameFeatureData
{
public:
	TSoftClassPtr<class UClass>                   GiftingScreenClass;                                // 0x0520(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGiftingData">();
	}
	static class UFortGiftingData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGiftingData>();
	}
};

}

