#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HmxAudio

#include "Basic.hpp"

#include "HmxAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "HmxCore_structs.hpp"


namespace SDK::Params
{

// Function HmxAudio.MusicAssetBase.GetLengthMs
// 0x0004 (0x0004 - 0x0000)
struct MusicAssetBase_GetLengthMs final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.BTDecorator_StopAfterSpan.OnNextBeat
// 0x0008 (0x0008 - 0x0000)
struct BTDecorator_StopAfterSpan_OnNextBeat final
{
public:
	int32                                         beatNumber;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         beatInBar;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.BTDecorator_StopAfterSpan.OnNextMeasure
// 0x0004 (0x0004 - 0x0000)
struct BTDecorator_StopAfterSpan_OnNextMeasure final
{
public:
	int32                                         measureNumber;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.BTDecorator_StopAtMidiMsg.OnNoteOffMessage
// 0x0018 (0x0018 - 0x0000)
struct BTDecorator_StopAtMidiMsg_OnNoteOffMessage final
{
public:
	class FString                                 CursorName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Channel;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Note;                                              // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.BTDecorator_StopAtMidiMsg.OnNoteOnMessage
// 0x0020 (0x0020 - 0x0000)
struct BTDecorator_StopAtMidiMsg_OnNoteOnMessage final
{
public:
	class FString                                 CursorName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Channel;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Note;                                              // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Velocity;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HmxAudio.BTDecorator_StopAtMidiMsg.OnTextMessage
// 0x0020 (0x0020 - 0x0000)
struct BTDecorator_StopAtMidiMsg_OnTextMessage final
{
public:
	class FString                                 CursorName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Text;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.BTDecorator_StopAtNext.OnNextBeat
// 0x0008 (0x0008 - 0x0000)
struct BTDecorator_StopAtNext_OnNextBeat final
{
public:
	int32                                         beatNumber;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         beatInBar;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.BTDecorator_StopAtNext.OnNextMeasure
// 0x0004 (0x0004 - 0x0000)
struct BTDecorator_StopAtNext_OnNextMeasure final
{
public:
	int32                                         measureNumber;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.BTTask_WaitForMidiMsg.OnNoteOffMessage
// 0x0018 (0x0018 - 0x0000)
struct BTTask_WaitForMidiMsg_OnNoteOffMessage final
{
public:
	class FString                                 CursorName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Channel;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Note;                                              // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.BTTask_WaitForMidiMsg.OnNoteOnMessage
// 0x0020 (0x0020 - 0x0000)
struct BTTask_WaitForMidiMsg_OnNoteOnMessage final
{
public:
	class FString                                 CursorName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Channel;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Note;                                              // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Velocity;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HmxAudio.BTTask_WaitForMidiMsg.OnTextMessage
// 0x0020 (0x0020 - 0x0000)
struct BTTask_WaitForMidiMsg_OnTextMessage final
{
public:
	class FString                                 CursorName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Text;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.BTTask_WaitForNext.OnNextBeat
// 0x0008 (0x0008 - 0x0000)
struct BTTask_WaitForNext_OnNextBeat final
{
public:
	int32                                         beatNumber;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         beatInBar;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.BTTask_WaitForNext.OnNextMeasure
// 0x0004 (0x0004 - 0x0000)
struct BTTask_WaitForNext_OnNextMeasure final
{
public:
	int32                                         measureNumber;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.BTTask_WaitForSpan.OnNextBeat
// 0x0008 (0x0008 - 0x0000)
struct BTTask_WaitForSpan_OnNextBeat final
{
public:
	int32                                         beatNumber;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         beatInBar;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.BTTask_WaitForSpan.OnNextMeasure
// 0x0004 (0x0004 - 0x0000)
struct BTTask_WaitForSpan_OnNextMeasure final
{
public:
	int32                                         measureNumber;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.HmxAudioBlueprintUtil.FrequencyToMidiNote
// 0x0008 (0x0008 - 0x0000)
struct HmxAudioBlueprintUtil_FrequencyToMidiNote final
{
public:
	float                                         freq;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.HmxAudioBlueprintUtil.GetAudioLatencyMs
// 0x0010 (0x0010 - 0x0000)
struct HmxAudioBlueprintUtil_GetAudioLatencyMs final
{
public:
	class UObject*                                worldContextObj;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HmxAudio.HmxAudioBlueprintUtil.GetNoteNameFromNoteNumber
// 0x0018 (0x0018 - 0x0000)
struct HmxAudioBlueprintUtil_GetNoteNameFromNoteNumber final
{
public:
	int32                                         midiNoteNumber;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.HmxAudioBlueprintUtil.GetNoteNumberFromNoteName
// 0x0018 (0x0018 - 0x0000)
struct HmxAudioBlueprintUtil_GetNoteNumberFromNoteName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HmxAudio.HmxAudioBlueprintUtil.GetNoteOctaveFromNoteNumber
// 0x0008 (0x0008 - 0x0000)
struct HmxAudioBlueprintUtil_GetNoteOctaveFromNoteNumber final
{
public:
	int32                                         midiNoteNumber;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.HmxAudioBlueprintUtil.GetVideoLatencyMs
// 0x0010 (0x0010 - 0x0000)
struct HmxAudioBlueprintUtil_GetVideoLatencyMs final
{
public:
	class UObject*                                worldContextObj;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HmxAudio.HmxAudioBlueprintUtil.SetAudioLatencyMs
// 0x0010 (0x0010 - 0x0000)
struct HmxAudioBlueprintUtil_SetAudioLatencyMs final
{
public:
	class UObject*                                worldContextObj;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InAudioLatencyMs;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HmxAudio.HmxAudioBlueprintUtil.SetVideoLatencyMs
// 0x0010 (0x0010 - 0x0000)
struct HmxAudioBlueprintUtil_SetVideoLatencyMs final
{
public:
	class UObject*                                worldContextObj;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InVideoLatencyMs;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HmxAudio.MidiNoteFunctionLibrary.ByteToMidiNote
// 0x0002 (0x0002 - 0x0000)
struct MidiNoteFunctionLibrary_ByteToMidiNote final
{
public:
	uint8                                         InByte;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMidiNote                              ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiNoteFunctionLibrary.GetMaxMidiNote
// 0x0001 (0x0001 - 0x0000)
struct MidiNoteFunctionLibrary_GetMaxMidiNote final
{
public:
	struct FMidiNote                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiNoteFunctionLibrary.GetMaxNoteNumber
// 0x0001 (0x0001 - 0x0000)
struct MidiNoteFunctionLibrary_GetMaxNoteNumber final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiNoteFunctionLibrary.GetMaxNoteVelocity
// 0x0001 (0x0001 - 0x0000)
struct MidiNoteFunctionLibrary_GetMaxNoteVelocity final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiNoteFunctionLibrary.GetMaxNumNotes
// 0x0004 (0x0004 - 0x0000)
struct MidiNoteFunctionLibrary_GetMaxNumNotes final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiNoteFunctionLibrary.GetMinMidiNote
// 0x0001 (0x0001 - 0x0000)
struct MidiNoteFunctionLibrary_GetMinMidiNote final
{
public:
	struct FMidiNote                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiNoteFunctionLibrary.GetMinNoteNumber
// 0x0001 (0x0001 - 0x0000)
struct MidiNoteFunctionLibrary_GetMinNoteNumber final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiNoteFunctionLibrary.GetMinNoteVelocity
// 0x0001 (0x0001 - 0x0000)
struct MidiNoteFunctionLibrary_GetMinNoteVelocity final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiNoteFunctionLibrary.IntToMidiNote
// 0x0008 (0x0008 - 0x0000)
struct MidiNoteFunctionLibrary_IntToMidiNote final
{
public:
	int32                                         inInt;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMidiNote                              ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HmxAudio.MidiNoteFunctionLibrary.MakeLiteralMidiNote
// 0x0002 (0x0002 - 0x0000)
struct MidiNoteFunctionLibrary_MakeLiteralMidiNote final
{
public:
	struct FMidiNote                              Value;                                             // 0x0000(0x0001)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMidiNote                              ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiNoteFunctionLibrary.MidiNoteToByte
// 0x0002 (0x0002 - 0x0000)
struct MidiNoteFunctionLibrary_MidiNoteToByte final
{
public:
	struct FMidiNote                              InMidiNote;                                        // 0x0000(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiNoteFunctionLibrary.MidiNoteToInt
// 0x0008 (0x0008 - 0x0000)
struct MidiNoteFunctionLibrary_MidiNoteToInt final
{
public:
	struct FMidiNote                              InMidiNote;                                        // 0x0000(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MusicalTickFunctionLibrary.BeatToTick
// 0x0008 (0x0008 - 0x0000)
struct MusicalTickFunctionLibrary_BeatToTick final
{
public:
	float                                         inBeat;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MusicalTickFunctionLibrary.GetBeatsPerTick
// 0x0004 (0x0004 - 0x0000)
struct MusicalTickFunctionLibrary_GetBeatsPerTick final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MusicalTickFunctionLibrary.GetTicksPerBeat
// 0x0004 (0x0004 - 0x0000)
struct MusicalTickFunctionLibrary_GetTicksPerBeat final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MusicalTickFunctionLibrary.GetTicksPerBeatInt
// 0x0004 (0x0004 - 0x0000)
struct MusicalTickFunctionLibrary_GetTicksPerBeatInt final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MusicalTickFunctionLibrary.TickToBeat
// 0x0008 (0x0008 - 0x0000)
struct MusicalTickFunctionLibrary_TickToBeat final
{
public:
	float                                         inTick;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.TickSpanFuncitonLibrary.ClampTickSpan
// 0x0018 (0x0018 - 0x0000)
struct TickSpanFuncitonLibrary_ClampTickSpan final
{
public:
	struct FTickSpan                              Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTickSpan                              clampSpan;                                         // 0x0008(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTickSpan                              ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HmxAudio.TickSpanFuncitonLibrary.ClampTickSpanByRef
// 0x0018 (0x0018 - 0x0000)
struct TickSpanFuncitonLibrary_ClampTickSpanByRef final
{
public:
	struct FTickSpan                              Target;                                            // 0x0000(0x0008)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTickSpan                              clampSpan;                                         // 0x0008(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTickSpan                              Result;                                            // 0x0010(0x0008)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HmxAudio.TickSpanFuncitonLibrary.GetEndBeat
// 0x000C (0x000C - 0x0000)
struct TickSpanFuncitonLibrary_GetEndBeat final
{
public:
	struct FTickSpan                              Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.TickSpanFuncitonLibrary.GetEndTick
// 0x000C (0x000C - 0x0000)
struct TickSpanFuncitonLibrary_GetEndTick final
{
public:
	struct FTickSpan                              Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.TickSpanFuncitonLibrary.GetLengthBeats
// 0x000C (0x000C - 0x0000)
struct TickSpanFuncitonLibrary_GetLengthBeats final
{
public:
	struct FTickSpan                              Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.TickSpanFuncitonLibrary.GetLengthTicks
// 0x000C (0x000C - 0x0000)
struct TickSpanFuncitonLibrary_GetLengthTicks final
{
public:
	struct FTickSpan                              Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.TickSpanFuncitonLibrary.GetOffsetBeat
// 0x000C (0x000C - 0x0000)
struct TickSpanFuncitonLibrary_GetOffsetBeat final
{
public:
	struct FTickSpan                              Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.TickSpanFuncitonLibrary.GetOffsetTick
// 0x000C (0x000C - 0x0000)
struct TickSpanFuncitonLibrary_GetOffsetTick final
{
public:
	struct FTickSpan                              Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.TickSpanFuncitonLibrary.MakeTickSpan
// 0x0010 (0x0010 - 0x0000)
struct TickSpanFuncitonLibrary_MakeTickSpan final
{
public:
	int32                                         Offset;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Length;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTickSpan                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HmxAudio.TickSpanFuncitonLibrary.MakeTickSpanFromBeats
// 0x0010 (0x0010 - 0x0000)
struct TickSpanFuncitonLibrary_MakeTickSpanFromBeats final
{
public:
	float                                         Offset;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Length;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTickSpan                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicSequence.AppendTimeSlot
// 0x0020 (0x0020 - 0x0000)
struct MidiMusicSequence_AppendTimeSlot final
{
public:
	struct FMidiMusicTimeSlotArgs                 args;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UMidiMusicTimeSlot*                     ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicSequence.InsertTimeSlot
// 0x0020 (0x0020 - 0x0000)
struct MidiMusicSequence_InsertTimeSlot final
{
public:
	struct FMidiMusicTimeSlotArgs                 args;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UMidiMusicTimeSlot*                     ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicSequence.FindTimeSlotAt
// 0x0010 (0x0010 - 0x0000)
struct MidiMusicSequence_FindTimeSlotAt final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMidiMusicTimeSlot*                     ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicSequence.FindTimeSlotAtTick
// 0x0010 (0x0010 - 0x0000)
struct MidiMusicSequence_FindTimeSlotAtTick final
{
public:
	int32                                         Tick;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMidiMusicTimeSlot*                     ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicSequence.GetLastTimeSlot
// 0x0008 (0x0008 - 0x0000)
struct MidiMusicSequence_GetLastTimeSlot final
{
public:
	class UMidiMusicTimeSlot*                     ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicTimeSlot.SetCurrentPage
// 0x0004 (0x0004 - 0x0000)
struct MidiMusicTimeSlot_SetCurrentPage final
{
public:
	int32                                         inCurrentPage;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicTimeSlot.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct MidiMusicTimeSlot_SetEnabled final
{
public:
	bool                                          InEnabled;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicTimeSlot.SetLengthTick
// 0x0004 (0x0004 - 0x0000)
struct MidiMusicTimeSlot_SetLengthTick final
{
public:
	int32                                         inLength;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicTimeSlot.SetMidiMusicItem
// 0x0010 (0x0010 - 0x0000)
struct MidiMusicTimeSlot_SetMidiMusicItem final
{
public:
	TScriptInterface<class IMidiMusicInterface>   inMidiMusicItem;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicTimeSlot.SetNumPages
// 0x0004 (0x0004 - 0x0000)
struct MidiMusicTimeSlot_SetNumPages final
{
public:
	int32                                         inNumPages;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicTimeSlot.SetOffsetTick
// 0x0004 (0x0004 - 0x0000)
struct MidiMusicTimeSlot_SetOffsetTick final
{
public:
	int32                                         InOffset;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicTimeSlot.SetPages
// 0x0010 (0x0010 - 0x0000)
struct MidiMusicTimeSlot_SetPages final
{
public:
	TArray<bool>                                  inPages;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicTimeSlot.SetTickSpan
// 0x0008 (0x0008 - 0x0000)
struct MidiMusicTimeSlot_SetTickSpan final
{
public:
	struct FTickSpan                              inTickSpan;                                        // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicTimeSlot.GetCurrentPage
// 0x0004 (0x0004 - 0x0000)
struct MidiMusicTimeSlot_GetCurrentPage final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicTimeSlot.GetEnabled
// 0x0001 (0x0001 - 0x0000)
struct MidiMusicTimeSlot_GetEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicTimeSlot.GetEndBeat
// 0x0004 (0x0004 - 0x0000)
struct MidiMusicTimeSlot_GetEndBeat final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicTimeSlot.GetEndTick
// 0x0004 (0x0004 - 0x0000)
struct MidiMusicTimeSlot_GetEndTick final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicTimeSlot.GetIndexInSequence
// 0x0004 (0x0004 - 0x0000)
struct MidiMusicTimeSlot_GetIndexInSequence final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicTimeSlot.GetLengthBeats
// 0x0004 (0x0004 - 0x0000)
struct MidiMusicTimeSlot_GetLengthBeats final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicTimeSlot.GetLengthTick
// 0x0004 (0x0004 - 0x0000)
struct MidiMusicTimeSlot_GetLengthTick final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicTimeSlot.GetMidiMusicItem
// 0x0010 (0x0010 - 0x0000)
struct MidiMusicTimeSlot_GetMidiMusicItem final
{
public:
	TScriptInterface<class IMidiMusicInterface>   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicTimeSlot.GetNumPages
// 0x0004 (0x0004 - 0x0000)
struct MidiMusicTimeSlot_GetNumPages final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicTimeSlot.GetOffsetBeat
// 0x0004 (0x0004 - 0x0000)
struct MidiMusicTimeSlot_GetOffsetBeat final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicTimeSlot.GetOffsetTick
// 0x0004 (0x0004 - 0x0000)
struct MidiMusicTimeSlot_GetOffsetTick final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicTimeSlot.GetPages
// 0x0010 (0x0010 - 0x0000)
struct MidiMusicTimeSlot_GetPages final
{
public:
	TArray<bool>                                  ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MidiMusicTimeSlot.GetTickSpan
// 0x0008 (0x0008 - 0x0000)
struct MidiMusicTimeSlot_GetTickSpan final
{
public:
	struct FTickSpan                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MusicalGridEvent.Cancel
// 0x0001 (0x0001 - 0x0000)
struct MusicalGridEvent_Cancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.MusicalGridEvent.GetProgress
// 0x0004 (0x0004 - 0x0000)
struct MusicalGridEvent_GetProgress final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.StepSequencerTrack.AppendGridSquares
// 0x0008 (0x0008 - 0x0000)
struct StepSequencerTrack_AppendGridSquares final
{
public:
	int32                                         appendSquares;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          copyStates;                                        // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          copyMusicItems;                                    // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HmxAudio.StepSequencerTrack.InitGridSquares
// 0x000C (0x000C - 0x0000)
struct StepSequencerTrack_InitGridSquares final
{
public:
	int32                                         inGridSquareNum;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         inMaxGridSquares;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         inGridSquareBeats;                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.StepSequencerTrack.OnTimeSlotEnabledChanged
// 0x0008 (0x0008 - 0x0000)
struct StepSequencerTrack_OnTimeSlotEnabledChanged final
{
public:
	class UMidiMusicTimeSlot*                     timeSlot;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.StepSequencerTrack.OnTimeSlotMusicItemChanged
// 0x0008 (0x0008 - 0x0000)
struct StepSequencerTrack_OnTimeSlotMusicItemChanged final
{
public:
	class UMidiMusicTimeSlot*                     timeSlot;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.StepSequencerTrack.OnTimeSlotTimeSpanChanged
// 0x0008 (0x0008 - 0x0000)
struct StepSequencerTrack_OnTimeSlotTimeSpanChanged final
{
public:
	class UMidiMusicTimeSlot*                     timeSlot;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.StepSequencerTrack.PopGridSquares
// 0x0004 (0x0004 - 0x0000)
struct StepSequencerTrack_PopGridSquares final
{
public:
	int32                                         popSquares;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.StepSequencerTrack.SetCurrentPage
// 0x0004 (0x0004 - 0x0000)
struct StepSequencerTrack_SetCurrentPage final
{
public:
	int32                                         Page;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.StepSequencerTrack.SetGridSquareBeats
// 0x0004 (0x0004 - 0x0000)
struct StepSequencerTrack_SetGridSquareBeats final
{
public:
	float                                         inGridSquareBeats;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.StepSequencerTrack.SetGridSquareState
// 0x0008 (0x0008 - 0x0000)
struct StepSequencerTrack_SetGridSquareState final
{
public:
	int32                                         gridSquareIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isOn;                                              // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HmxAudio.StepSequencerTrack.SetGridSquareStateOnPage
// 0x000C (0x000C - 0x0000)
struct StepSequencerTrack_SetGridSquareStateOnPage final
{
public:
	int32                                         gridSquareIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PageIndex;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isOn;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HmxAudio.StepSequencerTrack.SetMusicItemAtGridSquare
// 0x0018 (0x0018 - 0x0000)
struct StepSequencerTrack_SetMusicItemAtGridSquare final
{
public:
	int32                                         gridSquareIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMidiMusicInterface>   MusicItem;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.StepSequencerTrack.SetMusicItemForWholeTrack
// 0x0010 (0x0010 - 0x0000)
struct StepSequencerTrack_SetMusicItemForWholeTrack final
{
public:
	TScriptInterface<class IMidiMusicInterface>   MusicItem;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.StepSequencerTrack.SetMusicItemsInTrack
// 0x0010 (0x0010 - 0x0000)
struct StepSequencerTrack_SetMusicItemsInTrack final
{
public:
	TArray<TScriptInterface<class IMidiMusicInterface>> musicItems;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function HmxAudio.StepSequencerTrack.SetNumPages
// 0x0004 (0x0004 - 0x0000)
struct StepSequencerTrack_SetNumPages final
{
public:
	int32                                         inNumPages;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.StepSequencerTrack.ToggleGridSquareState
// 0x0004 (0x0004 - 0x0000)
struct StepSequencerTrack_ToggleGridSquareState final
{
public:
	int32                                         gridSquareIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.StepSequencerTrack.FindGridSquareAtIndex
// 0x0010 (0x0010 - 0x0000)
struct StepSequencerTrack_FindGridSquareAtIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMidiMusicTimeSlot*                     ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.StepSequencerTrack.FindGridSquareAtTick
// 0x0010 (0x0010 - 0x0000)
struct StepSequencerTrack_FindGridSquareAtTick final
{
public:
	int32                                         Tick;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMidiMusicTimeSlot*                     ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.StepSequencerTrack.GetEndTick
// 0x0004 (0x0004 - 0x0000)
struct StepSequencerTrack_GetEndTick final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.StepSequencerTrack.GetGridSquareBeats
// 0x0004 (0x0004 - 0x0000)
struct StepSequencerTrack_GetGridSquareBeats final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.StepSequencerTrack.GetGridSquareState
// 0x0008 (0x0008 - 0x0000)
struct StepSequencerTrack_GetGridSquareState final
{
public:
	int32                                         gridSquareIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HmxAudio.StepSequencerTrack.GetNumGridSquares
// 0x0004 (0x0004 - 0x0000)
struct StepSequencerTrack_GetNumGridSquares final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.StepSequencerTrack.TicksPerSquare
// 0x0004 (0x0004 - 0x0000)
struct StepSequencerTrack_TicksPerSquare final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.HarmonixPlayerComponentBase.Continue
// 0x0001 (0x0001 - 0x0000)
struct HarmonixPlayerComponentBase_Continue final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.HarmonixPlayerComponentBase.FadeAndStop
// 0x0004 (0x0004 - 0x0000)
struct HarmonixPlayerComponentBase_FadeAndStop final
{
public:
	float                                         Seconds;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.HarmonixPlayerComponentBase.GetHarmonixHandle
// 0x0008 (0x0008 - 0x0000)
struct HarmonixPlayerComponentBase_GetHarmonixHandle final
{
public:
	class UHarmonixHandle*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.HarmonixPlayerComponentBase.GetSyncClip
// 0x0010 (0x0010 - 0x0000)
struct HarmonixPlayerComponentBase_GetSyncClip final
{
public:
	class UHarmonixPlayerComponentBase*           syncClip_0;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMusicPlayerComponentBase*              ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.HarmonixPlayerComponentBase.Pause
// 0x0001 (0x0001 - 0x0000)
struct HarmonixPlayerComponentBase_Pause final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.HarmonixPlayerComponentBase.SetGain
// 0x0004 (0x0004 - 0x0000)
struct HarmonixPlayerComponentBase_SetGain final
{
public:
	float                                         Gain_0;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.HarmonixPlayerComponentBase.SetMute
// 0x0001 (0x0001 - 0x0000)
struct HarmonixPlayerComponentBase_SetMute final
{
public:
	bool                                          mute_0;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.HarmonixPlayerComponentBase.SetParameterValue
// 0x000C (0x000C - 0x0000)
struct HarmonixPlayerComponentBase_SetParameterValue final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HmxAudio.HarmonixPlayerComponentBase.SetPlayEmitterFindMethod
// 0x0001 (0x0001 - 0x0000)
struct HarmonixPlayerComponentBase_SetPlayEmitterFindMethod final
{
public:
	EPlayEmitterFindMethod                        Method;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.HarmonixPlayerComponentBase.SetStartPosition
// 0x0001 (0x0001 - 0x0000)
struct HarmonixPlayerComponentBase_SetStartPosition final
{
public:
	EAudioClipStartPosition                       Pos;                                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.HarmonixPlayerComponentBase.SetSyncClip
// 0x0008 (0x0008 - 0x0000)
struct HarmonixPlayerComponentBase_SetSyncClip final
{
public:
	class UMusicPlayerComponentBase*              syncClip_0;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.HarmonixPlayerComponentBase.SetSyncEmitterSpec
// 0x0001 (0x0001 - 0x0000)
struct HarmonixPlayerComponentBase_SetSyncEmitterSpec final
{
public:
	ESyncEmitterFindMethod                        syncEmitterSpec_0;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.HarmonixPlayerComponentBase.SetTickOffset
// 0x0004 (0x0004 - 0x0000)
struct HarmonixPlayerComponentBase_SetTickOffset final
{
public:
	int32                                         Tick;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.HarmonixPlayerComponentBase.SetVolume
// 0x0004 (0x0004 - 0x0000)
struct HarmonixPlayerComponentBase_SetVolume final
{
public:
	float                                         Volume_0;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudio.HarmonixPlayerComponentBase.Stop
// 0x0001 (0x0001 - 0x0000)
struct HarmonixPlayerComponentBase_Stop final
{
public:
