#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HmxAudioGraphics

#include "Basic.hpp"

#include "HmxCore_structs.hpp"


namespace SDK::Params
{

// Function HmxAudioGraphics.MusicTempometerComponent.SetMaterialParameterCollection
// 0x0008 (0x0008 - 0x0000)
struct MusicTempometerComponent_SetMaterialParameterCollection final
{
public:
	class UMaterialParameterCollection*           InMaterialParameterCollection;                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudioGraphics.MusicTempometerComponent.SetSongPosInterface
// 0x0010 (0x0010 - 0x0000)
struct MusicTempometerComponent_SetSongPosInterface final
{
public:
	TScriptInterface<class ISongPosInterface>     InSongPosInterface;                                // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudioGraphics.MusicTempometerComponent.SetSongPosInterfaceFromActor
// 0x0008 (0x0008 - 0x0000)
struct MusicTempometerComponent_SetSongPosInterfaceFromActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudioGraphics.MusicTempometerComponent.GetBeatLifetime
// 0x0004 (0x0004 - 0x0000)
struct MusicTempometerComponent_GetBeatLifetime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudioGraphics.MusicTempometerComponent.GetBeatTick
// 0x0004 (0x0004 - 0x0000)
struct MusicTempometerComponent_GetBeatTick final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudioGraphics.MusicTempometerComponent.GetMaterialParameterCollection
// 0x0008 (0x0008 - 0x0000)
struct MusicTempometerComponent_GetMaterialParameterCollection final
{
public:
	class UMaterialParameterCollection*           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudioGraphics.MusicTempometerComponent.GetMeasureBeat
// 0x0004 (0x0004 - 0x0000)
struct MusicTempometerComponent_GetMeasureBeat final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudioGraphics.MusicTempometerComponent.GetMeasureLifetime
// 0x0004 (0x0004 - 0x0000)
struct MusicTempometerComponent_GetMeasureLifetime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudioGraphics.MusicTempometerComponent.GetMeasureTick
// 0x0004 (0x0004 - 0x0000)
struct MusicTempometerComponent_GetMeasureTick final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudioGraphics.MusicTempometerComponent.GetMusicBeat
// 0x0004 (0x0004 - 0x0000)
struct MusicTempometerComponent_GetMusicBeat final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudioGraphics.MusicTempometerComponent.GetMusicMeasure
// 0x0004 (0x0004 - 0x0000)
struct MusicTempometerComponent_GetMusicMeasure final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudioGraphics.MusicTempometerComponent.GetMusicSeconds
// 0x0004 (0x0004 - 0x0000)
struct MusicTempometerComponent_GetMusicSeconds final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudioGraphics.MusicTempometerComponent.GetMusicTick
// 0x0004 (0x0004 - 0x0000)
struct MusicTempometerComponent_GetMusicTick final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudioGraphics.MusicTempometerComponent.GetSongPos
// 0x004C (0x004C - 0x0000)
struct MusicTempometerComponent_GetSongPos final
{
public:
	struct FSongPos                               ReturnValue;                                       // 0x0000(0x004C)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HmxAudioGraphics.MusicTempometerComponent.GetSongPosInterface
// 0x0010 (0x0010 - 0x0000)
struct MusicTempometerComponent_GetSongPosInterface final
{
public:
	TScriptInterface<class ISongPosInterface>     ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudioGraphics.MusicTempometerComponent.GetSongPosInterfaceNoMutex
// 0x0010 (0x0010 - 0x0000)
struct MusicTempometerComponent_GetSongPosInterfaceNoMutex final
{
public:
	TScriptInterface<class ISongPosInterface>     ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudioGraphics.MusicTempometerComponent.GetTempo
// 0x0004 (0x0004 - 0x0000)
struct MusicTempometerComponent_GetTempo final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudioGraphics.MusicTempometerComponent.GetTickLifetime
// 0x0004 (0x0004 - 0x0000)
struct MusicTempometerComponent_GetTickLifetime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudioGraphics.MusicTempometerComponent.GetTimeSignatureDenominator
// 0x0004 (0x0004 - 0x0000)
struct MusicTempometerComponent_GetTimeSignatureDenominator final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HmxAudioGraphics.MusicTempometerComponent.GetTimeSignatureNumerator
// 0x0004 (0x0004 - 0x0000)
struct MusicTempometerComponent_GetTimeSignatureNumerator final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

