#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HmxGraphics

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum HmxGraphics.ETextureFilterMode
// NumValues: 0x0003
enum class ETextureFilterMode : uint32
{
	Point                                    = 0,
	Linear                                   = 1,
	MAX                                      = 2,
};

// Enum HmxGraphics.FInterpolationType
// NumValues: 0x0004
enum class EFInterpolationType : uint32
{
	sRGB                                     = 0,
	HSV                                      = 1,
	NumOf                                    = 2,
	FInterpolationType_MAX                   = 3,
};

// ScriptStruct HmxGraphics.ColorKey
// 0x0014 (0x0014 - 0x0000)
struct FColorKey final
{
public:
	float                                         Position;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Value;                                             // 0x0004(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct HmxGraphics.ColorCurve
// 0x0070 (0x0070 - 0x0000)
struct FColorCurve final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FColorKey>                      Keys;                                              // 0x0008(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_18[0x50];                                      // 0x0018(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	EFInterpolationType                           InterpolationType;                                 // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct HmxGraphics.GrayscaleGradient
// 0x0080 (0x0080 - 0x0000)
struct FGrayscaleGradient final
{
public:
	struct FRichCurve                             Curve;                                             // 0x0000(0x0080)(NativeAccessSpecifierPublic)
};

// ScriptStruct HmxGraphics.ColorGradient
// 0x00F0 (0x00F0 - 0x0000)
struct FColorGradient final
{
public:
	struct FColorCurve                            ColorCurve;                                        // 0x0000(0x0070)(Edit, NativeAccessSpecifierPublic)
	struct FRichCurve                             AlphaCurve;                                        // 0x0070(0x0080)(NativeAccessSpecifierPublic)
};

}

