#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HmxGraphics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "HmxGraphics_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class HmxGraphics.HmxTextureBase
// 0x0010 (0x0150 - 0x0140)
class UHmxTextureBase : public UTexture
{
public:
	int32                                         Width;                                             // 0x0140(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	ETextureFilterMode                            TextureFilterMode;                                 // 0x0148(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ETextureAddress                               TextureTilingMode;                                 // 0x014C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetCurrentTextureHeight() const;
	int32 GetCurrentTextureWidth() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HmxTextureBase">();
	}
	static class UHmxTextureBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHmxTextureBase>();
	}
};

// Class HmxGraphics.CurveTexture
// 0x0088 (0x01D8 - 0x0150)
class UCurveTexture final : public UHmxTextureBase
{
public:
	struct FRuntimeFloatCurve                     Curve;                                             // 0x0150(0x0088)(Edit, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CurveTexture">();
	}
	static class UCurveTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurveTexture>();
	}
};

// Class HmxGraphics.GradientTexture
// 0x02F8 (0x0448 - 0x0150)
class UGradientTexture final : public UHmxTextureBase
{
public:
	bool                                          SpecifyPerChannelGradients;                        // 0x0150(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColorGradient                         ColorGradient;                                     // 0x0158(0x00F0)(Edit, NativeAccessSpecifierPrivate)
	struct FGrayscaleGradient                     Red;                                               // 0x0248(0x0080)(Edit, NativeAccessSpecifierPrivate)
	struct FGrayscaleGradient                     Green;                                             // 0x02C8(0x0080)(Edit, NativeAccessSpecifierPrivate)
	struct FGrayscaleGradient                     Blue;                                              // 0x0348(0x0080)(Edit, NativeAccessSpecifierPrivate)
	struct FGrayscaleGradient                     Alpha;                                             // 0x03C8(0x0080)(Edit, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GradientTexture">();
	}
	static class UGradientTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGradientTexture>();
	}
};

// Class HmxGraphics.HysteresisTextureBase
// 0x0030 (0x0180 - 0x0150)
class UHysteresisTextureBase : public UHmxTextureBase
{
public:
	uint8                                         Pad_150[0x8];                                      // 0x0150(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TicksPerShift;                                     // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumHysteresisSamples;                              // 0x0160(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_164[0x1C];                                     // 0x0164(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HysteresisTextureBase">();
	}
	static class UHysteresisTextureBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHysteresisTextureBase>();
	}
};

// Class HmxGraphics.PropHysteresisTexture
// 0x0010 (0x0190 - 0x0180)
class UPropHysteresisTexture final : public UHysteresisTextureBase
{
public:
	TArray<float>                                 Data;                                              // 0x0180(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, DuplicateTransient, NonTransactional, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PropHysteresisTexture">();
	}
	static class UPropHysteresisTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropHysteresisTexture>();
	}
};

// Class HmxGraphics.TextureSampler
// 0x0030 (0x0058 - 0x0028)
class UTextureSampler final : public UObject
{
public:
	class UTexture2D*                             SourceTexture;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Width;                                             // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   _sampledImageCache;                                // 0x0038(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)
	struct FGuid                                  _sourceGuid;                                       // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	struct FLinearColor TextureReadPixel(int32 U, int32 V);
	struct FLinearColor TextureSample(const struct FVector2D& UV);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TextureSampler">();
	}
	static class UTextureSampler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTextureSampler>();
	}
};

}

