#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IKRig

#include "Basic.hpp"

#include "IKRig_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function IKRig.IKGoalCreatorInterface.AddIKGoals
// 0x0050 (0x0050 - 0x0000)
struct IKGoalCreatorInterface_AddIKGoals final
{
public:
	TMap<class FName, struct FIKRigGoal>          OutGoals;                                          // 0x0000(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function IKRig.IKRigComponent.SetIKRigGoal
// 0x0090 (0x0090 - 0x0000)
struct IKRigComponent_SetIKRigGoal final
{
public:
	struct FIKRigGoal                             Goal;                                              // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function IKRig.IKRigComponent.SetIKRigGoalPositionAndRotation
// 0x0050 (0x0050 - 0x0000)
struct IKRigComponent_SetIKRigGoalPositionAndRotation final
{
public:
	class FName                                   GoalName;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Position;                                          // 0x0008(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                  Rotation;                                          // 0x0020(0x0020)(ConstParm, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PositionAlpha;                                     // 0x0040(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationAlpha;                                     // 0x0044(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function IKRig.IKRigComponent.SetIKRigGoalTransform
// 0x0080 (0x0080 - 0x0000)
struct IKRigComponent_SetIKRigGoalTransform final
{
public:
	class FName                                   GoalName;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0060)(ConstParm, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PositionAlpha;                                     // 0x0070(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationAlpha;                                     // 0x0074(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function IKRig.IKRetargeter.GetChainSettingsFromRetargetAsset
// 0x00B8 (0x00B8 - 0x0000)
struct IKRetargeter_GetChainSettingsFromRetargetAsset final
{
public:
	const class UIKRetargeter*                    RetargetAsset;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetChainName;                                   // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OptionalProfileName;                               // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTargetChainSettings                   ReturnValue;                                       // 0x0010(0x00A8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function IKRig.IKRetargeter.GetChainSettingsFromRetargetProfile
// 0x01A8 (0x01A8 - 0x0000)
struct IKRetargeter_GetChainSettingsFromRetargetProfile final
{
public:
	struct FRetargetProfile                       RetargetProfile;                                   // 0x0000(0x00F8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   TargetChainName;                                   // 0x00F8(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTargetChainSettings                   ReturnValue;                                       // 0x0100(0x00A8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function IKRig.IKRetargeter.GetChainUsingGoalFromRetargetAsset
// 0x00B8 (0x00B8 - 0x0000)
struct IKRetargeter_GetChainUsingGoalFromRetargetAsset final
{
public:
	const class UIKRetargeter*                    RetargetAsset;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   IKGoalName;                                        // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTargetChainSettings                   ReturnValue;                                       // 0x0010(0x00A8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function IKRig.IKRetargeter.GetGlobalSettingsFromRetargetAsset
// 0x0028 (0x0028 - 0x0000)
struct IKRetargeter_GetGlobalSettingsFromRetargetAsset final
{
public:
	const class UIKRetargeter*                    RetargetAsset;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OptionalProfileName;                               // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRetargetGlobalSettings                OutSettings;                                       // 0x000C(0x001C)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function IKRig.IKRetargeter.GetGlobalSettingsFromRetargetProfile
// 0x0118 (0x0118 - 0x0000)
struct IKRetargeter_GetGlobalSettingsFromRetargetProfile final
{
public:
	struct FRetargetProfile                       RetargetProfile;                                   // 0x0000(0x00F8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRetargetGlobalSettings                ReturnValue;                                       // 0x00F8(0x001C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function IKRig.IKRetargeter.GetRootSettingsFromRetargetAsset
// 0x0078 (0x0078 - 0x0000)
struct IKRetargeter_GetRootSettingsFromRetargetAsset final
{
public:
	const class UIKRetargeter*                    RetargetAsset;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OptionalProfileName;                               // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTargetRootSettings                    OutSettings;                                       // 0x0010(0x0068)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function IKRig.IKRetargeter.GetRootSettingsFromRetargetProfile
// 0x0160 (0x0160 - 0x0000)
struct IKRetargeter_GetRootSettingsFromRetargetProfile final
{
public:
	struct FRetargetProfile                       RetargetProfile;                                   // 0x0000(0x00F8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTargetRootSettings                    ReturnValue;                                       // 0x00F8(0x0068)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function IKRig.IKRetargeter.SetChainFKSettingsInRetargetProfile
// 0x0118 (0x0118 - 0x0000)
struct IKRetargeter_SetChainFKSettingsInRetargetProfile final
{
public:
	struct FRetargetProfile                       RetargetProfile;                                   // 0x0000(0x00F8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTargetChainFKSettings                 FKSettings;                                        // 0x00F8(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   TargetChainName;                                   // 0x0110(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function IKRig.IKRetargeter.SetChainIKSettingsInRetargetProfile
// 0x0178 (0x0178 - 0x0000)
struct IKRetargeter_SetChainIKSettingsInRetargetProfile final
{
public:
	struct FRetargetProfile                       RetargetProfile;                                   // 0x0000(0x00F8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTargetChainIKSettings                 IKSettings;                                        // 0x00F8(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   TargetChainName;                                   // 0x0170(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function IKRig.IKRetargeter.SetChainSettingsInRetargetProfile
// 0x01A8 (0x01A8 - 0x0000)
struct IKRetargeter_SetChainSettingsInRetargetProfile final
{
public:
	struct FRetargetProfile                       RetargetProfile;                                   // 0x0000(0x00F8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTargetChainSettings                   ChainSettings_0;                                   // 0x00F8(0x00A8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   TargetChainName;                                   // 0x01A0(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function IKRig.IKRetargeter.SetChainSpeedPlantSettingsInRetargetProfile
// 0x0110 (0x0110 - 0x0000)
struct IKRetargeter_SetChainSpeedPlantSettingsInRetargetProfile final
{
public:
	struct FRetargetProfile                       RetargetProfile;                                   // 0x0000(0x00F8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTargetChainSpeedPlantSettings         SpeedPlantSettings;                                // 0x00F8(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   TargetChainName;                                   // 0x010C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function IKRig.IKRetargeter.SetGlobalSettingsInRetargetProfile
// 0x0118 (0x0118 - 0x0000)
struct IKRetargeter_SetGlobalSettingsInRetargetProfile final
{
public:
	struct FRetargetProfile                       RetargetProfile;                                   // 0x0000(0x00F8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRetargetGlobalSettings                GlobalSettings_0;                                  // 0x00F8(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function IKRig.IKRetargeter.SetRootSettingsInRetargetProfile
// 0x0160 (0x0160 - 0x0000)
struct IKRetargeter_SetRootSettingsInRetargetProfile final
{
public:
	struct FRetargetProfile                       RetargetProfile;                                   // 0x0000(0x00F8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTargetRootSettings                    RootSettings_0;                                    // 0x00F8(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

}

