#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InteriorAudioComponent

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function InteriorAudioComponent.InteriorAudioComponent_C.ExecuteUbergraph_InteriorAudioComponent
// 0x0020 (0x0020 - 0x0000)
struct InteriorAudioComponent_C_ExecuteUbergraph_InteriorAudioComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AB_InteriorAudioManager_C*              K2Node_DynamicCast_AsB_Interior_Audio_Manager;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function InteriorAudioComponent.InteriorAudioComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct InteriorAudioComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function InteriorAudioComponent.InteriorAudioComponent_C.Update
// 0x0078 (0x0078 - 0x0000)
struct InteriorAudioComponent_C_Update final
{
public:
	struct FInteriorAudioScanResults              ScanResults;                                       // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

}

