#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LagerRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "WorldConditions_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "AIModule_structs.hpp"
#include "FortniteVersion_structs.hpp"


namespace SDK
{

// Enum LagerRuntime.ELivingWorldPointProviderSpawnLimiterBehavior
// NumValues: 0x0003
enum class ELivingWorldPointProviderSpawnLimiterBehavior : uint8
{
	Lifetime                                 = 0,
	Concurrent                               = 1,
	ELivingWorldPointProviderSpawnLimiterBehavior_MAX = 2,
};

// Enum LagerRuntime.ELivingWorldCalendarEventConditionBehavior
// NumValues: 0x0003
enum class ELivingWorldCalendarEventConditionBehavior : uint8
{
	IsActive                                 = 0,
	Ratio                                    = 1,
	ELivingWorldCalendarEventConditionBehavior_MAX = 2,
};

// Enum LagerRuntime.ELivingWorldCalendarEventConditionRatioBehavior
// NumValues: 0x0006
enum class ELivingWorldCalendarEventConditionRatioBehavior : uint8
{
	Less                                     = 0,
	LessOrEqual                              = 1,
	Greater                                  = 2,
	GreaterOrEqual                           = 3,
	InBetween                                = 4,
	ELivingWorldCalendarEventConditionRatioBehavior_MAX = 5,
};

// Enum LagerRuntime.EFortAthenaLivingWorldEventRuntimeDeactivationReason
// NumValues: 0x0007
enum class EFortAthenaLivingWorldEventRuntimeDeactivationReason : uint8
{
	None                                     = 0,
	NoValidEventData                         = 1,
	RandomDeactivation                       = 2,
	CalendarEvent                            = 3,
	MatchedPrefabAndNormalActor              = 4,
	ActorDescDoesntMatchAnySpawnerData       = 5,
	EFortAthenaLivingWorldEventRuntimeDeactivationReason_MAX = 6,
};

// ScriptStruct LagerRuntime.FortLivingWorldConfigOverride
// 0x0078 (0x0078 - 0x0000)
struct FFortLivingWorldConfigOverride final
{
public:
	TSoftObjectPtr<class UWorld>                  SourceWorld;                                       // 0x0000(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistTag;                                       // 0x0028(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFortAthenaLivingWorldConfigData> LagerConfig;                              // 0x0048(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortReleaseVersion                    StartVersion;                                      // 0x0070(0x0004)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FFortReleaseVersion                    EndVersion;                                        // 0x0074(0x0004)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldEventTagDensityRegistration
// 0x0058 (0x0058 - 0x0000)
struct FFortAthenaLivingWorldEventTagDensityRegistration final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Range;                                             // 0x0008(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         DensityValue;                                      // 0x0030(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldActorSpawnDescription
// 0x0100 (0x0100 - 0x0000)
struct FFortAthenaLivingWorldActorSpawnDescription
{
public:
	TSoftClassPtr<class UClass>                   ActorClass;                                        // 0x0000(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   SpawnerData;                                       // 0x0028(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      SpawnerDataTagQuery;                               // 0x0050(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         ActorDensityValue;                                 // 0x0098(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         DensityComputationRangeOverride;                   // 0x00C0(0x0028)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FFortAthenaLivingWorldEventTagDensityRegistration> TagDensityRegistrations;        // 0x00E8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bPreloadOnClient;                                  // 0x00F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldPrefabActorSpawnerData
// 0x0110 (0x0110 - 0x0000)
struct FFortAthenaLivingWorldPrefabActorSpawnerData final
{
public:
	struct FGuid                                  ActorSpawnerGuid;                                  // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortAthenaLivingWorldActorSpawnDescription ActorDescription;                             // 0x0010(0x0100)(NativeAccessSpecifierPublic)
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldPlayerTracker
// 0x00B0 (0x00B0 - 0x0000)
struct FFortAthenaLivingWorldPlayerTracker final
{
public:
	TSet<class AFortAthenaAIBotController*>       TrackedBotControllers;                             // 0x0000(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class AFortPlayerPawn*>                TrackedPlayerPawns;                                // 0x0050(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class AController*>                    TrackedPlayerControllers;                          // 0x0060(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_70[0x40];                                      // 0x0070(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldPointProviderFilterRules
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FFortAthenaLivingWorldPointProviderFilterRules final
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldCondition_TrackedPlayerPresence
// 0x0058 (0x0068 - 0x0010)
struct FFortAthenaLivingWorldCondition_TrackedPlayerPresence final : public FWorldConditionCommonActorBase
{
public:
	struct FWorldConditionContextDataRef          ActorRef;                                          // 0x0010(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MinDistanceToPlayer;                               // 0x0018(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MaxDistanceToPlayer;                               // 0x0040(0x0028)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldCategoryTableData
// 0x0058 (0x0058 - 0x0000)
struct FFortAthenaLivingWorldCategoryTableData final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UDataTable>              CategoryTable;                                     // 0x0008(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         IsEnabled;                                         // 0x0030(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldConditionContainer
// 0x0018 (0x0018 - 0x0000)
struct FFortAthenaLivingWorldConditionContainer final
{
public:
	class UObject*                                Owner;                                             // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldPointProviderSpawnLimiter
// 0x0068 (0x0068 - 0x0000)
struct FFortAthenaLivingWorldPointProviderSpawnLimiter final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	ELivingWorldPointProviderSpawnLimiterBehavior Behavior;                                          // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MaxNumberOfSpawn;                                  // 0x0010(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxNumberOfEventInstance;                          // 0x0038(0x0028)(Edit, NativeAccessSpecifierPrivate)
	bool                                          bResetLimitWhenEnabling;                           // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldDensityCondition
// 0x0088 (0x0098 - 0x0010)
struct FFortAthenaLivingWorldDensityCondition final : public FWorldConditionCommonActorBase
{
public:
	struct FWorldConditionContextDataRef          ActorRef;                                          // 0x0010(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           tag;                                               // 0x0018(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Distance;                                          // 0x0020(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MaxDensity;                                        // 0x0048(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MinDensity;                                        // 0x0070(0x0028)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldDespawnCondition
// 0x0020 (0x0020 - 0x0000)
struct FFortAthenaLivingWorldDespawnCondition final
{
public:
	struct FWorldConditionQueryDefinition         DespawnWorldCondition;                             // 0x0000(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         TimeAsCandidateBeforeDespawn;                      // 0x0018(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeAsCandidateBeforeDespawnDeviation;             // 0x001C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct LagerRuntime.FortAthenaLinearEncounterPlayerParticipationData
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) FFortAthenaLinearEncounterPlayerParticipationData final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldActorUpdateHandler
// 0x00B0 (0x00B0 - 0x0000)
struct FFortAthenaLivingWorldActorUpdateHandler final
{
public:
	class UFortAthenaLivingWorldManager*          LivingWorldManager;                                // 0x0000(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8[0xA8];                                       // 0x0008(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LagerRuntime.FortLivingWorldEventTableVariation
// 0x0050 (0x0050 - 0x0000)
struct FFortLivingWorldEventTableVariation final
{
public:
	TSoftObjectPtr<class UDataTable>              EventTableVariation;                               // 0x0000(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         VariationWeight;                                   // 0x0028(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldCategory
// 0x00E8 (0x00F0 - 0x0008)
struct FFortAthenaLivingWorldCategory final : public FTableRowBase
{
public:
	TSoftObjectPtr<class UDataTable>              EventTable;                                        // 0x0008(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FFortLivingWorldEventTableVariation> EventTableVariations;                         // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	int32                                         MaxCount;                                          // 0x0040(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MaxSpawnedCount;                                   // 0x0044(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         EventInstanceMaxCount;                             // 0x0048(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         EventInstanceMaxSpawnedCount;                      // 0x004C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FWorldConditionQueryDefinition         CanSpawnCondition;                                 // 0x0050(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	float                                         Priority;                                          // 0x0068(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bExcludeFromGlobalAIBudget;                        // 0x006C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      RequirePlaylistTagQuery;                           // 0x0070(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<TSoftObjectPtr<class UFortAthenaLivingWorldEncounter>> Encounters;                        // 0x00B8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         IsEnabled;                                         // 0x00C8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldTagDensityGridData
// 0x0030 (0x0030 - 0x0000)
struct FFortAthenaLivingWorldTagDensityGridData final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         GridCellSize;                                      // 0x0008(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct LagerRuntime.FortAthenaActorDensityDebugInfo
// 0x0048 (0x0048 - 0x0000)
struct FFortAthenaActorDensityDebugInfo final
{
public:
	class FString                                 ActorName;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ActorPosition;                                     // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             MinCellIndex;                                      // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             MaxCellIndex;                                      // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DensityValue;                                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldDensityGrid
// 0x0098 (0x0158 - 0x00C0)
struct FFortAthenaLivingWorldDensityGrid final : public FFortSpatialGrid
{
public:
	uint8                                         Pad_C0[0x98];                                      // 0x00C0(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldEncounterStage
// 0x0078 (0x0078 - 0x0000)
struct FFortAthenaLivingWorldEncounterStage final
{
public:
	TSoftObjectPtr<class UDataTable>              EventTable;                                        // 0x0000(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaximumConcurrentNumberOfAI;                       // 0x0028(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxSpawnCountPerEventGeneration;                   // 0x0050(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldEventDespawnCondition
// 0x0018 (0x0018 - 0x0000)
struct FFortAthenaLivingWorldEventDespawnCondition final
{
public:
	bool                                          bCanBeDespawned;                                   // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinDistanceToPlayer;                               // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeAsCandidateBeforeDespawn;                      // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAthenaGamePhaseStep                          CanStartDespawningPhaseStep;                       // 0x000C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CanStartDespawningSafeZonePhase;                   // 0x0010(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanDespawnWhenInCombatWithPlayer;                 // 0x0014(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanDespawnInTheStorm;                             // 0x0015(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldEventTagDensityCondition
// 0x000C (0x000C - 0x0000)
struct FFortAthenaLivingWorldEventTagDensityCondition final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDensity;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldEventDataEntry
// 0x0050 (0x0050 - 0x0000)
struct FFortAthenaLivingWorldEventDataEntry final
{
public:
	TSoftObjectPtr<class UFortAthenaLivingWorldEventData> EventData;                                 // 0x0000(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         Weight;                                            // 0x0028(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct LagerRuntime.LivingWorldCalendarEventCondition
// 0x0010 (0x0010 - 0x0000)
struct FLivingWorldCalendarEventCondition final
{
public:
	class FName                                   CalendarEventName;                                 // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELivingWorldCalendarEventConditionBehavior    Behavior;                                          // 0x0004(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldEventBeActive;                               // 0x0005(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELivingWorldCalendarEventConditionRatioBehavior RatioBehavior;                                   // 0x0006(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RatioValue;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RatioMaxValue;                                     // 0x000C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct LagerRuntime.LivingWorldCalendarEventConditions
// 0x0018 (0x0018 - 0x0000)
struct FLivingWorldCalendarEventConditions final
{
public:
	TArray<struct FLivingWorldCalendarEventCondition> Conditions;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          IsActiveWithoutSeasonalManager;                    // 0x0010(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldEvent
// 0x0188 (0x0190 - 0x0008)
struct FFortAthenaLivingWorldEvent final : public FTableRowBase
{
public:
	TSoftObjectPtr<class UFortAthenaLivingWorldEventData> EventData;                                 // 0x0008(0x0028)(Deprecated, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FFortAthenaLivingWorldEventDataEntry> EventDatas;                                  // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         IsEnabled;                                         // 0x0040(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<float>                                 MaxCount;                                          // 0x0068(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<float>                                 MaxSpawnedCount;                                   // 0x0078(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<float>                                 EventInstanceMaxCount;                             // 0x0088(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<float>                                 EventInstanceMaxSpawnedCount;                      // 0x0098(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	float                                         Weight;                                            // 0x00A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 MinRespawnTime;                                    // 0x00B0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<float>                                 MaxRespawnTime;                                    // 0x00C0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                          bOnlyInSafeZone;                                   // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bOnlyInNextSafeZone;                               // 0x00D1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bOnlyInNextSafeZoneIfStormShrinking;               // 0x00D2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWorldConditionQueryDefinition         CanSpawnCondition;                                 // 0x00D8(0x0018)(Edit, NativeAccessSpecifierPrivate)
	EAthenaGamePhaseStep                          ActivationGamePhaseStep;                           // 0x00F0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ActivationSafezoneIndex;                           // 0x00F4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ActivationMinDelay;                                // 0x00F8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ActivationMaxDelay;                                // 0x00FC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DeactivationMinDelay;                              // 0x0100(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DeactivationMaxDelay;                              // 0x0104(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FFortAthenaLivingWorldEventTagDensityCondition> TagDensityConditions;              // 0x0108(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          bCheckForActorDensity;                             // 0x0118(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxActorDensityOverride;                           // 0x011C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinDistanceToPlayer;                               // 0x0120(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxDistanceToPlayer;                               // 0x0124(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCanSpawnWithoutMatchingPlayerDistance;            // 0x0128(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RandomActivationChance;                            // 0x012C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortAthenaLivingWorldEventDespawnCondition DespawnCondition;                             // 0x0130(0x0018)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TArray<struct FFortAthenaLivingWorldDespawnCondition> DespawnConditions;                         // 0x0148(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  RequirePlaylistTags;                               // 0x0158(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FLivingWorldCalendarEventConditions    CalendarEventConditions;                           // 0x0178(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
};

// ScriptStruct LagerRuntime.PointProviderFilterEntry
// 0x0088 (0x0088 - 0x0000)
struct FPointProviderFilterEntry final
{
public:
	struct FGameplayTagQuery                      ProviderFiltersTagQuery;                           // 0x0000(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FLivingWorldCalendarEventConditions    CalendarEventConditions;                           // 0x0048(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         Weight;                                            // 0x0060(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldEventDataActorSpawnDescription
// 0x0018 (0x0118 - 0x0100)
struct FFortAthenaLivingWorldEventDataActorSpawnDescription final : public FFortAthenaLivingWorldActorSpawnDescription
{
public:
	bool                                          bSpawnAroundDefaultPoint;                          // 0x0100(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateDefaultPosition;                            // 0x0101(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQuery*                              SpawnAroundEnvironmentQuery;                       // 0x0108(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEnvQueryRunMode                              SpawnAroundEnvironmentQueryRunMode;                // 0x0110(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldPreloader
// 0x00E0 (0x00E0 - 0x0000)
struct FFortAthenaLivingWorldPreloader final
{
public:
	class UFortAthenaLivingWorldManager*          LivingWorldManager;                                // 0x0000(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class UFortAthenaSpawnerDataBase>> LoadedSpawnerDataClass;                    // 0x0008(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class AActor>>             LoadedActorClasses;                                // 0x0018(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_28[0xB8];                                      // 0x0028(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldTaggedSpawnActionClass
// 0x0010 (0x0010 - 0x0000)
struct FFortAthenaLivingWorldTaggedSpawnActionClass final
{
public:
	struct FGameplayTag                           SpawnActionTag;                                    // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortAthenaLivingWorldSpawnAction> SpawnActionClass;                           // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldCategoryTableDataList
// 0x0010 (0x0010 - 0x0000)
struct FFortAthenaLivingWorldCategoryTableDataList final
{
public:
	TArray<struct FFortAthenaLivingWorldCategoryTableData> CategoryTableDatas;                       // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct LagerRuntime.LivingWorldSpawnAroundPlayerConfiguration
// 0x0040 (0x0040 - 0x0000)
struct FLivingWorldSpawnAroundPlayerConfiguration final
{
public:
	TSoftObjectPtr<class UFortAthenaLivingWorldEncounter> Encounter;                                 // 0x0000(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class AFortAthenaPointAroundPlayerProvider>> PointProviderClasses;            // 0x0028(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bRegisterReservoir;                                // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LagerRuntime.LivingWorldSpawnAroundPlayerRuntimeData
// 0x0018 (0x0018 - 0x0000)
struct FLivingWorldSpawnAroundPlayerRuntimeData final
{
public:
	TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> PointAroundPlayerProviders; // 0x0000(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	class UFortAthenaLivingWorldEncounterInstance* Encounter;                                        // 0x0010(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct LagerRuntime.FortAthenaLivingWorldTagQueryToSeatMapping
// 0x0050 (0x0050 - 0x0000)
struct FFortAthenaLivingWorldTagQueryToSeatMapping final
{
public:
	struct FGameplayTagQuery                      TagQuery;                                          // 0x0000(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         SeatIndex;                                         // 0x0048(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

