#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchmakingPortalUI

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function MatchmakingPortalUI.FortMatchmakingPortalModal.GetCodeTextFormat
// 0x0030 (0x0030 - 0x0000)
struct FortMatchmakingPortalModal_GetCodeTextFormat final
{
public:
	class FText                                   IslandCode;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalModal.GetCreatorTextFormat
// 0x0030 (0x0030 - 0x0000)
struct FortMatchmakingPortalModal_GetCreatorTextFormat final
{
public:
	class FText                                   CreatorName;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalModal.OnAdditionalContentUpdate
// 0x0020 (0x0020 - 0x0000)
struct FortMatchmakingPortalModal_OnAdditionalContentUpdate final
{
public:
	class FText                                   MatchmakingState;                                  // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Progress;                                          // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowProgressBar;                                  // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MatchmakingPortalUI.FortMatchmakingPortalModal.OnMatchmakingStarted
// 0x0018 (0x0018 - 0x0000)
struct FortMatchmakingPortalModal_OnMatchmakingStarted final
{
public:
	class FText                                   MatchmakingState;                                  // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalModal.SetMatchmakingStateText
// 0x0018 (0x0018 - 0x0000)
struct FortMatchmakingPortalModal_SetMatchmakingStateText final
{
public:
	class FText                                   MatchmakingStateText;                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalModal.GetContentWarningStrings
// 0x0010 (0x0010 - 0x0000)
struct FortMatchmakingPortalModal_GetContentWarningStrings final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalModal.GetInvalidActivityReason
// 0x0001 (0x0001 - 0x0000)
struct FortMatchmakingPortalModal_GetInvalidActivityReason final
{
public:
	EFortInvalidActivityReason                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalModal.IsDownloadRequired
// 0x0001 (0x0001 - 0x0000)
struct FortMatchmakingPortalModal_IsDownloadRequired final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalPopup.GetIslandData
// 0x0070 (0x0070 - 0x0000)
struct FortMatchmakingPortalPopup_GetIslandData final
{
public:
	struct FMatchmakingPortalPopupData            OutIslandData;                                     // 0x0000(0x0060)(Parm, OutParm, NativeAccessSpecifierPublic)
	class UHeaderDescriptionHUDComponent*         HUDComponent;                                      // 0x0060(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MatchmakingPortalUI.FortMatchmakingPortalPopup.HandleHUDShow
// 0x0002 (0x0002 - 0x0000)
struct FortMatchmakingPortalPopup_HandleHUDShow final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldAnimate;                                    // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalPopup.HandleLoadScreenChanged
// 0x0028 (0x0028 - 0x0000)
struct FortMatchmakingPortalPopup_HandleLoadScreenChanged final
{
public:
	class AFortPlayerControllerAthena*            PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoadScreenEnabled;                                // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   HUDReason;                                         // 0x0010(0x0018)(Parm, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalPopup.HandleOnPortalDetailsVisibilityCheck
// 0x0001 (0x0001 - 0x0000)
struct FortMatchmakingPortalPopup_HandleOnPortalDetailsVisibilityCheck final
{
public:
	bool                                          bShowWidget;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalPopup.HandleStartedRespawn
// 0x0008 (0x0008 - 0x0000)
struct FortMatchmakingPortalPopup_HandleStartedRespawn final
{
public:
	class AFortPlayerControllerZone*              PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalPopup.IsInteractingDeviceAMatchmakingPortal
// 0x0001 (0x0001 - 0x0000)
struct FortMatchmakingPortalPopup_IsInteractingDeviceAMatchmakingPortal final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalPopup.OnPlayerCanInteractChanged
// 0x0001 (0x0001 - 0x0000)
struct FortMatchmakingPortalPopup_OnPlayerCanInteractChanged final
{
public:
	bool                                          bPlayerCanInteract;                                // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalPopup.OnShowPortalPopup
// 0x0002 (0x0002 - 0x0000)
struct FortMatchmakingPortalPopup_OnShowPortalPopup final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnimate;                                          // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalPopup.UpdateVisuals
// 0x0008 (0x0008 - 0x0000)
struct FortMatchmakingPortalPopup_UpdateVisuals final
{
public:
	const class UHeaderDescriptionHUDComponent*   HUDComponent;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalPopup.GetMatchmakingFeedbackWidget
// 0x0010 (0x0010 - 0x0000)
struct FortMatchmakingPortalPopup_GetMatchmakingFeedbackWidget final
{
public:
	const class UCommonActivatableWidget*         MatchmakingFeedbackContainer;                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAthenaCreativeMatchmakingWidget*   ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortMatchmakingPortalPopup.HasActivityToShow
// 0x0001 (0x0001 - 0x0000)
struct FortMatchmakingPortalPopup_HasActivityToShow final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchmakingPortalUI.FortModalBackground.OnPreviewImageChanged
// 0x0010 (0x0010 - 0x0000)
struct FortModalBackground_OnPreviewImageChanged final
{
public:
	bool                                          bIsLoading;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTexture*                         InTexture;                                         // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

