#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshCosmeticsUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "MeshCosmeticsUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class MeshCosmeticsUI.FortVariantSprayCustomizerConfig
// 0x0050 (0x0080 - 0x0030)
class UFortVariantSprayCustomizerConfig final : public UDataAsset
{
public:
	TMap<struct FGameplayTag, struct FFortVariantSprayCustomizerCosmeticOptions> SprayCustomizerOptions; // 0x0030(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVariantSprayCustomizerConfig">();
	}
	static class UFortVariantSprayCustomizerConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVariantSprayCustomizerConfig>();
	}
};

// Class MeshCosmeticsUI.FortVariantRedirectorTile
// 0x00E0 (0x0450 - 0x0370)
class UFortVariantRedirectorTile final : public UFortVariantEditorWidgetBase
{
public:
	class UDynamicEntryBox*                       EntryBox_VariantOptions;                           // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_VariantName;                                  // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   SprayCustomizerClass;                              // 0x0380(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortVariantSprayCustomizerConfig*      SprayCustomizerConfig;                             // 0x03A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    ClearAllSlotsInputAction;                          // 0x03B0(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    RandomizeSpraysInputAction;                        // 0x03C0(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UAthenaCosmeticItemDefinition> ItemDefinition;                              // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FFortVariantRedirectorTileLoadedEmoteToRandomize> LoadedEmotesToRandomize;         // 0x03D8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E8[0x68];                                     // 0x03E8(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UWidget* HandleBoundaryNavigation(EUINavigation InNavigation);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVariantRedirectorTile">();
	}
	static class UFortVariantRedirectorTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVariantRedirectorTile>();
	}
};

// Class MeshCosmeticsUI.FortVariantRedirectorTileButton
// 0x0030 (0x1410 - 0x13E0)
class UFortVariantRedirectorTileButton final : public UCommonButtonBase
{
public:
	class UFortLazyImage*                         LazyImage_TileIcon;                                // 0x13E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_13E8[0x28];                                    // 0x13E8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVariantRedirectorTileButton">();
	}
	static class UFortVariantRedirectorTileButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVariantRedirectorTileButton>();
	}
};

// Class MeshCosmeticsUI.FortVariantSprayCustomizer
// 0x0160 (0x07D0 - 0x0670)
class UFortVariantSprayCustomizer final : public UFortItemPreviewScreen
{
public:
	class UCommonButtonBase*                      Button_Back;                                       // 0x0670(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Confirm;                                    // 0x0678(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_HideArchivedItems;                          // 0x0680(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_ShowArchivedItems;                          // 0x0688(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Widget_ArchivedItemsButtons;                       // 0x0690(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_SpraysTab;                                  // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_SettingsTab;                                // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_TouchClose;                                 // 0x06A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActionWidget*                    ActionWidget_TabLeft;                              // 0x06B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActionWidget*                    ActionWidget_TabRight;                             // 0x06B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActivatableWidgetSwitcher*       Switcher_Tabs;                                     // 0x06C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Widget_Sprays;                                     // 0x06C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Widget_Settings;                                   // 0x06D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortVariantItemTexturePicker*          TexturePicker_Sprays;                              // 0x06D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortVariantSprayCustomizerSetting*     Setting_Saturation;                                // 0x06E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortVariantSprayCustomizerSetting*     Setting_Wear;                                      // 0x06E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortVariantSprayCustomizerSetting*     Setting_Scale;                                     // 0x06F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    TabLeftAction;                                     // 0x06F8(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    TabRightAction;                                    // 0x0708(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           ItemShopPreviewSceneChangerTag;                    // 0x0718(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_71C[0x4];                                      // 0x071C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonGroupLegacy*               TabButtonGroup;                                    // 0x0720(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UAthenaCosmeticItemDefinition> ItemDefinition;                              // 0x0728(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCustomizableObjectSprayVariant*    SprayVariant;                                      // 0x0730(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_738[0x98];                                     // 0x0738(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_SetChannelSlotIcon(const TSoftObjectPtr<class UObject>& ChannelSlotIcon);
	void BP_SetVariantEditorMode(const bool bIsLockerMode);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVariantSprayCustomizer">();
	}
	static class UFortVariantSprayCustomizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVariantSprayCustomizer>();
	}
};

// Class MeshCosmeticsUI.FortVariantSprayCustomizerSetting
// 0x0040 (0x02A8 - 0x0268)
class UFortVariantSprayCustomizerSetting final : public UUserWidget
{
public:
	class UAnalogSlider*                          Slider_Value;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CommitDelay;                                       // 0x0270(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_274[0x34];                                     // 0x0274(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnChangeValue(const float Value, const float NormalizedValue);
	void BP_OnSetConstraints(const struct FFloatRange& Constraints);
	void HandleSliderValueChanged(float NormalizedValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVariantSprayCustomizerSetting">();
	}
	static class UFortVariantSprayCustomizerSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVariantSprayCustomizerSetting>();
	}
};

}

