#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MLDeformerRuntime

#include "Basic.hpp"

#include "MLDeformerFramework_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "GameFeatures_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MLDeformerRuntime.FortMLDeformerComponent
// 0x0020 (0x0100 - 0x00E0)
class UFortMLDeformerComponent final : public UMLDeformerComponent
{
public:
	class UMLDeformerAsset*                       RequestedMLDeformerAsset;                          // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMeshDeformer*                          RequestedMeshDeformerAsset;                        // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F0[0x10];                                      // 0x00F0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMLDeformerComponent">();
	}
	static class UFortMLDeformerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMLDeformerComponent>();
	}
};

// Class MLDeformerRuntime.MLDeformerGameFeatureData
// 0x0008 (0x0528 - 0x0520)
class UMLDeformerGameFeatureData final : public UFortGameFeatureData
{
public:
	bool                                          bDisableWhenOwnerIsNotViewTarget;                  // 0x0520(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldRampUpWeightWhenEnabled;                    // 0x0521(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_522[0x2];                                      // 0x0522(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WeightIncreasePerSecond;                           // 0x0524(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerGameFeatureData">();
	}
	static class UMLDeformerGameFeatureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerGameFeatureData>();
	}
};

// Class MLDeformerRuntime.GameFeatureAction_LoadPrimaryDataAssets
// 0x0010 (0x0038 - 0x0028)
class UGameFeatureAction_LoadPrimaryDataAssets final : public UGameFeatureAction
{
public:
	TArray<class FName>                           AdditionalPrimaryAssetTypesToLoad;                 // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_LoadPrimaryDataAssets">();
	}
	static class UGameFeatureAction_LoadPrimaryDataAssets* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_LoadPrimaryDataAssets>();
	}
};

// Class MLDeformerRuntime.MLDeformerAssetMapping
// 0x00F0 (0x0120 - 0x0030)
class UMLDeformerAssetMapping final : public UPrimaryDataAsset
{
public:
	TMap<TSoftObjectPtr<class UAthenaCharacterItemDefinition>, TSoftObjectPtr<class UMLDeformerAsset>> CharacterItemDefinitionToMLDeformerAssetMap; // 0x0030(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<TSoftObjectPtr<class UCustomCharacterPart>, TSoftObjectPtr<class UMLDeformerAsset>> CharacterPartToMLDeformerAssetMap; // 0x0080(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<TSoftObjectPtr<class UMLDeformerAsset>, TSoftObjectPtr<class UMeshDeformer>> MLDeformerToMeshDeformerAssetMap; // 0x00D0(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerAssetMapping">();
	}
	static class UMLDeformerAssetMapping* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerAssetMapping>();
	}
};

// Class MLDeformerRuntime.MLDeformerComponentManager
// 0x0028 (0x00C8 - 0x00A0)
class UMLDeformerComponentManager final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x28];                                      // 0x00A0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerComponentManager">();
	}
	static class UMLDeformerComponentManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerComponentManager>();
	}
};

}

