#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MLDeformerFramework

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "OptimusCore_classes.hpp"
#include "ComputeFramework_classes.hpp"
#include "MLDeformerFramework_structs.hpp"


namespace SDK
{

// Class MLDeformerFramework.MLDeformerAsset
// 0x0008 (0x0030 - 0x0028)
class UMLDeformerAsset final : public UObject
{
public:
	class UMLDeformerModel*                       Model;                                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerAsset">();
	}
	static class UMLDeformerAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerAsset>();
	}
};

// Class MLDeformerFramework.MLDeformerVizSettings
// 0x0000 (0x0028 - 0x0028)
class UMLDeformerVizSettings : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerVizSettings">();
	}
	static class UMLDeformerVizSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerVizSettings>();
	}
};

// Class MLDeformerFramework.MLDeformerGeomCacheVizSettings
// 0x0000 (0x0028 - 0x0028)
class UMLDeformerGeomCacheVizSettings : public UMLDeformerVizSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerGeomCacheVizSettings">();
	}
	static class UMLDeformerGeomCacheVizSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerGeomCacheVizSettings>();
	}
};

// Class MLDeformerFramework.MLDeformerMorphModelVizSettings
// 0x0000 (0x0028 - 0x0028)
class UMLDeformerMorphModelVizSettings : public UMLDeformerGeomCacheVizSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerMorphModelVizSettings">();
	}
	static class UMLDeformerMorphModelVizSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerMorphModelVizSettings>();
	}
};

// Class MLDeformerFramework.MLDeformerComponent
// 0x0040 (0x00E0 - 0x00A0)
class UMLDeformerComponent : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x28];                                      // 0x00A0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UMLDeformerAsset*                       DeformerAsset;                                     // 0x00C8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Weight;                                            // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMLDeformerModelInstance*               ModelInstance;                                     // 0x00D8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetDeformerAsset(class UMLDeformerAsset* InDeformerAsset);
	void SetWeight(float NormalizedWeightValue);
	void UpdateSkeletalMeshComponent();

	class USkeletalMeshComponent* FindSkeletalMeshComponent(const class UMLDeformerAsset* Asset) const;
	class UMLDeformerAsset* GetDeformerAsset() const;
	class USkeletalMeshComponent* GetSkeletalMeshComponent() const;
	float GetWeight() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerComponent">();
	}
	static class UMLDeformerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerComponent>();
	}
};

// Class MLDeformerFramework.MLDeformerComponentSource
// 0x0000 (0x0028 - 0x0028)
class UMLDeformerComponentSource final : public UOptimusComponentSource
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerComponentSource">();
	}
	static class UMLDeformerComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerComponentSource>();
	}
};

// Class MLDeformerFramework.MLDeformerModel
// 0x00B8 (0x00E0 - 0x0028)
class UMLDeformerModel : public UObject
{
public:
	uint8                                         Pad_28[0x88];                                      // 0x0028(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumBaseMeshVerts;                                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumTargetMeshVerts;                                // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMLDeformerInputInfo*                   InputInfo;                                         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<int32>                                 VertexMap;                                         // 0x00C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UNeuralNetwork*                         NeuralNetwork;                                     // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x00D8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerModel">();
	}
	static class UMLDeformerModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerModel>();
	}
};

// Class MLDeformerFramework.MLDeformerGeomCacheModel
// 0x0000 (0x00E0 - 0x00E0)
class UMLDeformerGeomCacheModel : public UMLDeformerModel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerGeomCacheModel">();
	}
	static class UMLDeformerGeomCacheModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerGeomCacheModel>();
	}
};

// Class MLDeformerFramework.MLDeformerGraphDataInterface
// 0x0000 (0x0028 - 0x0028)
class UMLDeformerGraphDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerGraphDataInterface">();
	}
	static class UMLDeformerGraphDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerGraphDataInterface>();
	}
};

// Class MLDeformerFramework.MLDeformerGraphDataProvider
// 0x0008 (0x0030 - 0x0028)
class UMLDeformerGraphDataProvider final : public UComputeDataProvider
{
public:
	class UMLDeformerComponent*                   DeformerComponent;                                 // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerGraphDataProvider">();
	}
	static class UMLDeformerGraphDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerGraphDataProvider>();
	}
};

// Class MLDeformerFramework.MLDeformerGraphDebugDataInterface
// 0x0000 (0x0028 - 0x0028)
class UMLDeformerGraphDebugDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerGraphDebugDataInterface">();
	}
	static class UMLDeformerGraphDebugDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerGraphDebugDataInterface>();
	}
};

// Class MLDeformerFramework.MLDeformerGraphDebugDataProvider
// 0x0010 (0x0038 - 0x0028)
class UMLDeformerGraphDebugDataProvider final : public UComputeDataProvider
{
public:
	class UMLDeformerComponent*                   DeformerComponent;                                 // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMLDeformerAsset*                       DeformerAsset;                                     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerGraphDebugDataProvider">();
	}
	static class UMLDeformerGraphDebugDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerGraphDebugDataProvider>();
	}
};

// Class MLDeformerFramework.MLDeformerInputInfo
// 0x0040 (0x0068 - 0x0028)
class UMLDeformerInputInfo : public UObject
{
public:
	struct FSoftObjectPath                        SkeletalMesh;                                      // 0x0028(0x0018)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                           BoneNames;                                         // 0x0040(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           CurveNames;                                        // 0x0050(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                         NumBaseMeshVertices;                               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumTargetMeshVertices;                             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerInputInfo">();
	}
	static class UMLDeformerInputInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerInputInfo>();
	}
};

// Class MLDeformerFramework.MLDeformerModelInstance
// 0x0068 (0x0090 - 0x0028)
class UMLDeformerModelInstance : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UMLDeformerModel*                       Model;                                             // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_40[0x50];                                      // 0x0040(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerModelInstance">();
	}
	static class UMLDeformerModelInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerModelInstance>();
	}
};

// Class MLDeformerFramework.MLDeformerMorphModel
// 0x0030 (0x0110 - 0x00E0)
class UMLDeformerMorphModel : public UMLDeformerGeomCacheModel
{
public:
	uint8                                         Pad_E0[0x20];                                      // 0x00E0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIncludeNormals;                                   // 0x0100(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MorphTargetDeltaThreshold;                         // 0x0104(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MorphTargetErrorTolerance;                         // 0x0108(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMLDeformerMaskChannel                        MaskChannel;                                       // 0x010C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bInvertMaskChannel;                                // 0x010D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetMorphTargetDeltaFloats(const TArray<float>& Deltas);
	void SetMorphTargetDeltas(const TArray<struct FVector3f>& Deltas);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerMorphModel">();
	}
	static class UMLDeformerMorphModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerMorphModel>();
	}
};

// Class MLDeformerFramework.MLDeformerMorphModelInstance
// 0x0008 (0x0098 - 0x0090)
class UMLDeformerMorphModelInstance : public UMLDeformerModelInstance
{
public:
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerMorphModelInstance">();
	}
	static class UMLDeformerMorphModelInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerMorphModelInstance>();
	}
};

// Class MLDeformerFramework.MLDeformerTestModel
// 0x0000 (0x00E0 - 0x00E0)
class UMLDeformerTestModel final : public UMLDeformerModel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerTestModel">();
	}
	static class UMLDeformerTestModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerTestModel>();
	}
};

// Class MLDeformerFramework.TestModelInstance
// 0x0000 (0x0090 - 0x0090)
class UTestModelInstance final : public UMLDeformerModelInstance
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TestModelInstance">();
	}
	static class UTestModelInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestModelInstance>();
	}
};

}

