#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModelProto

#include "Basic.hpp"


namespace SDK
{

// Enum ModelProto.EAttributeProtoAttributeType
// NumValues: 0x000E
enum class EAttributeProtoAttributeType : uint32
{
	UNDEFINED                                = 0,
	FLOAT                                    = 1,
	INT                                      = 2,
	STRING                                   = 3,
	TENSOR                                   = 4,
	GRAPH                                    = 5,
	SPARSE_TENSOR                            = 11,
	FLOATS                                   = 6,
	INTS                                     = 7,
	STRINGS                                  = 8,
	TENSORS                                  = 9,
	GRAPHS                                   = 10,
	SPARSE_TENSORS                           = 12,
	EAttributeProtoAttributeType_MAX         = 13,
};

// Enum ModelProto.ETensorProtoDataType
// NumValues: 0x0012
enum class ETensorProtoDataType : uint32
{
	UNDEFINED                                = 0,
	FLOAT                                    = 1,
	UINT8                                    = 2,
	INT8                                     = 3,
	UINT16                                   = 4,
	INT16                                    = 5,
	INT32                                    = 6,
	INT64                                    = 7,
	STRING                                   = 8,
	BOOL                                     = 9,
	FLOAT16                                  = 10,
	DOUBLE                                   = 11,
	UINT32                                   = 12,
	UINT64                                   = 13,
	COMPLEX64                                = 14,
	COMPLEX128                               = 15,
	BFLOAT16                                 = 16,
	ETensorProtoDataType_MAX                 = 17,
};

// Enum ModelProto.ETensorProtoDataLocation
// NumValues: 0x0003
enum class ETensorProtoDataLocation : uint32
{
	DEFAULT                                  = 0,
	EXTERNAL                                 = 1,
	ETensorProtoDataLocation_MAX             = 2,
};

// ScriptStruct ModelProto.TensorProtoSegment
// 0x0010 (0x0010 - 0x0000)
struct FTensorProtoSegment final
{
public:
	int64                                         Begin;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         End;                                               // 0x0008(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ModelProto.StringStringEntryProto
// 0x0020 (0x0020 - 0x0000)
struct FStringStringEntryProto final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ModelProto.TensorShapeProtoDimension
// 0x0028 (0x0028 - 0x0000)
struct FTensorShapeProtoDimension final
{
public:
	int64                                         DimValue;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DimParam;                                          // 0x0008(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Denotation;                                        // 0x0018(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ModelProto.TensorShapeProto
// 0x0010 (0x0010 - 0x0000)
struct FTensorShapeProto final
{
public:
	TArray<struct FTensorShapeProtoDimension>     Dim;                                               // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct ModelProto.TensorProto
// 0x00D0 (0x00D0 - 0x0000)
struct FTensorProto final
{
public:
	TArray<int64>                                 Dimensions;                                        // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	ETensorProtoDataType                          DataType;                                          // 0x0010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTensorProtoSegment                    Segment;                                           // 0x0018(0x0010)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	TArray<float>                                 FloatData;                                         // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 Int32Data;                                         // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         StringData;                                        // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int64>                                 Int64Data;                                         // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0068(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DocString;                                         // 0x0078(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 RawData;                                           // 0x0088(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FStringStringEntryProto>        ExternalData;                                      // 0x0098(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	ETensorProtoDataLocation                      DataLocation;                                      // 0x00A8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                DoubleData;                                        // 0x00B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint64>                                UInt64Data;                                        // 0x00C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct ModelProto.TypeProtoSequence
// 0x0001 (0x0001 - 0x0000)
struct FTypeProtoSequence final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ModelProto.TypeProtoTensor
// 0x0018 (0x0018 - 0x0000)
struct FTypeProtoTensor final
{
public:
	int32                                         ElemType;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTensorShapeProto                      Shape;                                             // 0x0008(0x0010)(Edit, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct ModelProto.TypeProtoMap
// 0x0004 (0x0004 - 0x0000)
struct FTypeProtoMap final
{
public:
	int32                                         KeyType;                                           // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ModelProto.SparseTensorProto
// 0x01B0 (0x01B0 - 0x0000)
struct FSparseTensorProto final
{
public:
	struct FTensorProto                           Values;                                            // 0x0000(0x00D0)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FTensorProto                           Indices;                                           // 0x00D0(0x00D0)(Edit, EditConst, NativeAccessSpecifierPublic)
	TArray<int64>                                 Dimensions;                                        // 0x01A0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct ModelProto.TypeProto
// 0x0028 (0x0028 - 0x0000)
struct FTypeProto final
{
public:
	struct FTypeProtoTensor                       TensorType;                                        // 0x0000(0x0018)(Edit, EditConst, NativeAccessSpecifierPublic)
	class FString                                 Denotation;                                        // 0x0018(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ModelProto.AttributeProto
// 0x0310 (0x0310 - 0x0000)
struct FAttributeProto final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DocString;                                         // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttributeProtoAttributeType                  Type;                                              // 0x0020(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         F;                                                 // 0x0024(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         I;                                                 // 0x0028(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 S;                                                 // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTensorProto                           T;                                                 // 0x0040(0x00D0)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FSparseTensorProto                     SparseTensor;                                      // 0x0110(0x01B0)(Edit, EditConst, NativeAccessSpecifierPublic)
	TArray<float>                                 Floats;                                            // 0x02C0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<int64>                                 Integers;                                          // 0x02D0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<class FString>                         Strings;                                           // 0x02E0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FTensorProto>                   Tensors;                                           // 0x02F0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FSparseTensorProto>             SparseTensors;                                     // 0x0300(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct ModelProto.ValueInfoProto
// 0x0048 (0x0048 - 0x0000)
struct FValueInfoProto final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTypeProto                             Type;                                              // 0x0010(0x0028)(Edit, EditConst, NativeAccessSpecifierPublic)
	class FString                                 DocString;                                         // 0x0038(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ModelProto.TensorAnnotation
// 0x0020 (0x0020 - 0x0000)
struct FTensorAnnotation final
{
public:
	class FString                                 TensorName;                                        // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FStringStringEntryProto>        QuantParameterTensorNames;                         // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct ModelProto.NodeProto
// 0x0070 (0x0070 - 0x0000)
struct FNodeProto final
{
public:
	TArray<class FString>                         Input;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<class FString>                         Output;                                            // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0020(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OperatorType;                                      // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Domain;                                            // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAttributeProto>                Attribute;                                         // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	class FString                                 DocString;                                         // 0x0060(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ModelProto.GraphProto
// 0x0098 (0x0098 - 0x0000)
struct FGraphProto final
{
public:
	bool                                          bIsLoaded;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNodeProto>                     Node;                                              // 0x0008(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0018(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTensorProto>                   Initializer;                                       // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FSparseTensorProto>             SparseInitializer;                                 // 0x0038(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	class FString                                 DocString;                                         // 0x0048(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FValueInfoProto>                Input;                                             // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FValueInfoProto>                Output;                                            // 0x0068(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FValueInfoProto>                ValueInfo;                                         // 0x0078(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x10];                                      // 0x0088(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ModelProto.TrainingInfoProto
// 0x0158 (0x0158 - 0x0000)
struct FTrainingInfoProto final
{
public:
	bool                                          bIsLoaded;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGraphProto                            Initialization;                                    // 0x0008(0x0098)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FGraphProto                            Algorithm;                                         // 0x00A0(0x0098)(Edit, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FStringStringEntryProto>        InitializationBinding;                             // 0x0138(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FStringStringEntryProto>        UpdateBinding;                                     // 0x0148(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct ModelProto.OperatorSetIdProto
// 0x0018 (0x0018 - 0x0000)
struct FOperatorSetIdProto final
{
public:
	class FString                                 Domain;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Version;                                           // 0x0010(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ModelProto.ModelProto
// 0x0120 (0x0120 - 0x0000)
struct FModelProto final
{
public:
	bool                                          bIsLoaded;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         IRVersion;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FOperatorSetIdProto>            OpsetImport;                                       // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	class FString                                 ProducerName;                                      // 0x0020(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProducerVersion;                                   // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Domain;                                            // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ModelVersion;                                      // 0x0050(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DocString;                                         // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGraphProto                            Graph;                                             // 0x0068(0x0098)(Edit, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FStringStringEntryProto>        MetadataProps;                                     // 0x0100(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FTrainingInfoProto>             TrainingInfo;                                      // 0x0110(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};

}

