#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NevadaUI

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "NevadaRuntime_structs.hpp"


namespace SDK
{

// Class NevadaUI.FortNevadaVehicleReticle
// 0x00A8 (0x04E0 - 0x0438)
class UFortNevadaVehicleReticle final : public UFortAthenaVehicleDashboardWidget
{
public:
	TSubclassOf<class UNevadaTargetIndicator>     NevadaTargetIndicatorClass;                        // 0x0438(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNevadaTargetIndicator*                 TargetIndicator;                                   // 0x0440(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortNevadaVehicle*                     OwningNevadaVehicle;                               // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_450[0x8];                                      // 0x0450(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserWidgetPool                        IndicatorPool;                                     // 0x0458(0x0088)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	void OnBatteryChanged(float BatteryLevel);
	void OnEnergyCannonEnabledChanged(const bool bEnabled);
	void OnEnergyCanonFired(const float Cooldown);
	void OnTractorBeamActivated();
	void OnTractorBeamAttached();
	void OnTractorBeamChargeStarted();
	void OnTractorBeamDeactivated(const float Cooldown);
	void OnTractorBeamDetached();
	void OnTractorBeamEnabledChanged(const bool bEnabled);
	void OnVehicleStateChanged(const ENevadaFlightStates VehicleState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortNevadaVehicleReticle">();
	}
	static class UFortNevadaVehicleReticle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortNevadaVehicleReticle>();
	}
};

// Class NevadaUI.NevadaTargetIndicator
// 0x0000 (0x0378 - 0x0378)
class UNevadaTargetIndicator final : public UFortActorIndicatorWidget
{
public:
	void OnTractorBeamActivated(const bool bActivated);
	void OnTractorBeamAttached(const bool bAttached);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NevadaTargetIndicator">();
	}
	static class UNevadaTargetIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNevadaTargetIndicator>();
	}
};

}

