#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NevadaRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum NevadaRuntime.ETractorBeamState
// NumValues: 0x0004
enum class ETractorBeamState : uint8
{
	TBS_Inactive                             = 0,
	TBS_Charging                             = 1,
	TBS_Active                               = 2,
	TBS_MAX                                  = 3,
};

// Enum NevadaRuntime.ENevadaFlightStates
// NumValues: 0x0009
enum class ENevadaFlightStates : uint8
{
	FLIGHT                                   = 0,
	CRASHING                                 = 1,
	CRASHED                                  = 2,
	REBOOTING                                = 3,
	LANDING                                  = 4,
	LANDED                                   = 5,
	IDLE                                     = 6,
	NONE                                     = 7,
	ENevadaFlightStates_MAX                  = 8,
};

// ScriptStruct NevadaRuntime.NevadaAudioUpdateContext
// 0x0001 (0x0001 - 0x0000)
struct FNevadaAudioUpdateContext final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct NevadaRuntime.NevadaOutContinuous
// 0x0008 (0x0040 - 0x0038)
struct FNevadaOutContinuous final : public FFortVehicleOutContinuous
{
public:
	float                                         AltimeterTraceHitDistance;                         // 0x0038(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TractorBeamAppliedForceMagnitude;                  // 0x003C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct NevadaRuntime.NevadaOutPersistent
// 0x0428 (0x0450 - 0x0028)
struct FNevadaOutPersistent final : public FFortVehicleOutPersistent
{
public:
	uint8                                         Pad_28[0x428];                                     // 0x0028(0x0428)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct NevadaRuntime.NevadaState
// 0x0014 (0x0014 - 0x0000)
struct FNevadaState final
{
public:
	ENevadaFlightStates                           CurrentStatus;                                     // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LivesRemaining;                                    // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHijackingActive;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPilotBubbleCollisionEnabled;                      // 0x0009(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentBatteryCharge;                              // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCannonEnabled;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTractorBeamEnabled;                               // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct NevadaRuntime.NevadaMoveModeConfig
// 0x0014 (0x0014 - 0x0000)
struct FNevadaMoveModeConfig final
{
public:
	float                                         ThrustForce;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LiftForce;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxHorizontalSpeed;                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxVerticalSpeed;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DragForceMultiplier;                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct NevadaRuntime.DampedSpringConfig
// 0x000C (0x000C - 0x0000)
struct FDampedSpringConfig final
{
public:
	float                                         Stiffness;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damping;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxAccel;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct NevadaRuntime.NevadaInPersistent
// 0x0110 (0x0298 - 0x0188)
struct FNevadaInPersistent final : public FFortVehicleInPersistent
{
public:
	class UFortNevadaVehicleConfigs*              FortNevadaVehicleConfigs;                          // 0x0188(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBoostThrust;                                      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBoostDrag;                                        // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_192[0x2];                                      // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TractorBeamExtraLengthForExtents;                  // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseTractorBeamUprightForce;                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CrashingDesiredUp;                                 // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENevadaFlightStates                           CurrentVehicleState;                               // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B9[0xDF];                                     // 0x01B9(0x00DF)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

