#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerAugmentsUI

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// Class PlayerAugmentsUI.FortPlayerAugmentInventoryInfoWidget
// 0x0060 (0x0408 - 0x03A8)
class UFortPlayerAugmentInventoryInfoWidget final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   RarityTextFormat;                                  // 0x03B0(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemName;                                     // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemRarity;                                   // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemCategory;                                 // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemCategoryIndicator*             ItemCategoryIndicator;                             // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemDescription;                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSocialAvatarIcon*                  Icon_LenderAvatarIcon;                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         Image_LenderSquadColor;                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_BorrowingText;                                // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnItemNewOrBorrowedSet(const bool bIsNew, const bool bIsBorrowed);
	void OnItemRaritySet(const EFortRarity Rarity, const struct FFortRarityItemData& RarityItemData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentInventoryInfoWidget">();
	}
	static class UFortPlayerAugmentInventoryInfoWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentInventoryInfoWidget>();
	}
};

// Class PlayerAugmentsUI.FortMobileButtonBehaviorComponent_AugmentsListIconPicker
// 0x0008 (0x0050 - 0x0048)
class UFortMobileButtonBehaviorComponent_AugmentsListIconPicker final : public UFortMobileButtonBehaviorComponent_IconPicker
{
public:
	class UPaperSprite*                           ListViewSprite;                                    // 0x0048(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnAugmentToolViewSwap(const bool bIsInInventoryView);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileButtonBehaviorComponent_AugmentsListIconPicker">();
	}
	static class UFortMobileButtonBehaviorComponent_AugmentsListIconPicker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileButtonBehaviorComponent_AugmentsListIconPicker>();
	}
};

// Class PlayerAugmentsUI.FortMobileButtonBehaviorComponent_AugmentsListVisibility
// 0x0008 (0x0050 - 0x0048)
class UFortMobileButtonBehaviorComponent_AugmentsListVisibility final : public UFortMobileButtonBehaviorComponent_Visibility
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleAugmentToolOpenedStatusChanged(const bool bIsOpened, const bool bInIsInventoryView);
	void HandleAugmentToolViewSwap(const bool bInIsInventoryView);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileButtonBehaviorComponent_AugmentsListVisibility">();
	}
	static class UFortMobileButtonBehaviorComponent_AugmentsListVisibility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileButtonBehaviorComponent_AugmentsListVisibility>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentCollectionScreen
// 0x0080 (0x06A8 - 0x0628)
class UFortPlayerAugmentCollectionScreen : public UAthenaCollectionScreenBase
{
public:
	struct FScalableFloat                         AugmentsEnabledViaHotfix;                          // 0x0628(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, TSoftObjectPtr<class UObject>> TagToImageMap;                          // 0x0650(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_CategoryTitle;                                // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentCollectionScreen">();
	}
	static class UFortPlayerAugmentCollectionScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentCollectionScreen>();
	}
};

// Class PlayerAugmentsUI.FortMobileActionBBE_AugmentShoot
// 0x0010 (0x0080 - 0x0070)
class UFortMobileActionBBE_AugmentShoot : public UFortMobileActionButtonBehaviorExtension
{
public:
	class UPaperSprite*                           IconOverrideSprite;                                // 0x0070(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           IconOverrideTag;                                   // 0x0078(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileActionBBE_AugmentShoot">();
	}
	static class UFortMobileActionBBE_AugmentShoot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileActionBBE_AugmentShoot>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentCollectionListEntry
// 0x0010 (0x14D0 - 0x14C0)
class UFortPlayerAugmentCollectionListEntry : public UAthenaCollectionListEntry
{
public:
	class UImage*                                 Image_Background;                                  // 0x14C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ParamName_ItemIcon;                                // 0x14C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ParamName_IsDiscovered;                            // 0x14CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentCollectionListEntry">();
	}
	static class UFortPlayerAugmentCollectionListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentCollectionListEntry>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentSpecialAcquiredNotificationWidget
// 0x0090 (0x0360 - 0x02D0)
class alignas(0x10) UFortPlayerAugmentSpecialAcquiredNotificationWidget final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_2D0[0x60];                                     // 0x02D0(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortPrioritizedWidgetData             PrioritizationData;                                // 0x0330(0x0002)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_332[0x6];                                      // 0x0332(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TargetGameplayTags;                                // 0x0338(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CloseWidget();
	void OnEventAdded();
	void OnStompedByOtherWidget();
	void OpenWidget(const class UFortPlayerAugmentItemDefinition* ItemDef);

	class FText ConstructEventDescription(const class UFortPlayerAugmentItemDefinition* ItemDef) const;
	bool HasMoreAugmentEvents() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentSpecialAcquiredNotificationWidget">();
	}
	static class UFortPlayerAugmentSpecialAcquiredNotificationWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentSpecialAcquiredNotificationWidget>();
	}
};

// Class PlayerAugmentsUI.FortMobileActionButtonBehavior_RerollAugments
// 0x0008 (0x0118 - 0x0110)
class UFortMobileActionButtonBehavior_RerollAugments : public UFortMobileActionButtonBehavior
{
public:
	class UFortItemDefinition*                    RerollCurrency;                                    // 0x0110(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileActionButtonBehavior_RerollAugments">();
	}
	static class UFortMobileActionButtonBehavior_RerollAugments* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileActionButtonBehavior_RerollAugments>();
	}
};

// Class PlayerAugmentsUI.FortMobilePlayerAugmentTimer
// 0x0010 (0x0308 - 0x02F8)
class UFortMobilePlayerAugmentTimer : public UFortMobileHUDElement
{
public:
	TWeakObjectPtr<class UFortControllerComponent_AugmentGrantingSystem> AugmentControllerComponent; // 0x02F8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_PlayerAugmentTimer;                         // 0x0300(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleAugmentSelectionMenuOpenedStatusChanged(const bool bIsOpened, const bool bInIsInventoryView);
	void HandlePlayerLandedAfterSkydive(class AFortPlayerControllerZone* FortPCZone);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobilePlayerAugmentTimer">();
	}
	static class UFortMobilePlayerAugmentTimer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobilePlayerAugmentTimer>();
	}
};

// Class PlayerAugmentsUI.FortPickupInteractOverrideComponent_Augments
// 0x0000 (0x00C0 - 0x00C0)
class UFortPickupInteractOverrideComponent_Augments : public UFortPickupInteractOverrideComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPickupInteractOverrideComponent_Augments">();
	}
	static class UFortPickupInteractOverrideComponent_Augments* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPickupInteractOverrideComponent_Augments>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentCollectionScreenContainer
// 0x0000 (0x0500 - 0x0500)
class UFortPlayerAugmentCollectionScreenContainer : public UAthenaCollectionScreenContainer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentCollectionScreenContainer">();
	}
	static class UFortPlayerAugmentCollectionScreenContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentCollectionScreenContainer>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentCollectionScreenInfoOverlay
// 0x0020 (0x0490 - 0x0470)
class UFortPlayerAugmentCollectionScreenInfoOverlay : public UAthenaCollectionScreenInfoOverlay
{
public:
	class FName                                   ParamName_Progress;                                // 0x0470(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_474[0x4];                                      // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_ItemCategory;                                 // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemCategoryIndicator*             ItemCategoryIndicator;                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_UndiscoveredText;                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentCollectionScreenInfoOverlay">();
	}
	static class UFortPlayerAugmentCollectionScreenInfoOverlay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentCollectionScreenInfoOverlay>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentGranterWidget
// 0x0018 (0x02E8 - 0x02D0)
class UFortPlayerAugmentGranterWidget final : public UFortHUDElementWidget
{
public:
	TArray<class UFortPlayerAugmentItemDefinition*> AvailableAugmentItemDefinitions;                 // 0x02D0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UWidget*                                Overlay_Reroll;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleAugmentHighlighted(int32 HighlightedAugmentIndex);
	void HandleAugmentSelectionStarted(const int32 SelectedAugmentIndex);
	void HandleAugmentSelectorOpenedStatusChanged(const bool bIsOpened, const bool bViewingAugmentInventory);
	void HandleAugmentSelectorToolViewSwapped(const bool bViewingAugmentsInventory);
	void HandleAvailableAugmentsForGrantingUpdated(class UFortControllerComponent_AugmentGrantingSystem* GrantingComponent);
	void HandleCanSelectAugmentChanged(bool bCanSelectAugment);
	void HandleRerollAugments();
	void HandleSelectedAugmentForGrant(class UFortPlayerAugmentItemDefinition* SelectedAugment);
	void HandleTimerUpdated(float TimeRemaining, float TimePercentage);
	void OnAugmentHighlighted(int32 HighlightedAugmentIndex);
	void OnAugmentScrollDownEvent();
	void OnAugmentScrollUpEvent();
	void OnAugmentSelectionStarted(const int32 SelectedAugmentIndex);
	void OnAugmentSelectorOpenedStatusChanged(const bool bIsOpened, const bool bViewingAugmentInventory);
	void OnAugmentSelectorToolViewSwapped(const bool bViewingAugmentInventory);
	void OnCanSelectAugmentChanged(bool bCanSelectAugment);
	void OnInputTypeChanged(const ECommonInputType NewInputType);
	void OnPopulateAvailableAugmentsHUD(const TArray<class UFortPlayerAugmentItemDefinition*>& AugmentItemDefinition);
	void OnRerollAugments();
	void OnSelectedAugmentForGrant(class UFortPlayerAugmentItemDefinition* HighlightedAugment);
	void OnTimerUpdated(float TimeRemaining, float TimePercentage);

	int32 GetPendingAugmentsToGrant() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentGranterWidget">();
	}
	static class UFortPlayerAugmentGranterWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentGranterWidget>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentHUDQuickbarWidget
// 0x0048 (0x02D8 - 0x0290)
class UFortPlayerAugmentHUDQuickbarWidget final : public UCommonUserWidget
{
public:
	struct FGameplayTagContainer                  HiddenAugmentGameplayTags;                         // 0x0290(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         NumAugmentGrantRoundsForPlaylist;                  // 0x02B0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void OnAugmentsUpdated(const TArray<class UFortPlayerAugmentItemDefinition*>& ActiveAugments);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentHUDQuickbarWidget">();
	}
	static class UFortPlayerAugmentHUDQuickbarWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentHUDQuickbarWidget>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentHUDRerollWidget
// 0x0030 (0x02C0 - 0x0290)
class UFortPlayerAugmentHUDRerollWidget final : public UCommonUserWidget
{
public:
	class UCommonLazyImage*                       Image_CurrencyIcon;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemDefinition*                    RerollCurrency;                                    // 0x0298(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CachedNumFreeRerolls;                              // 0x02A0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   RerollHoldMaterialParamName;                       // 0x02A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 Image_ProgressBar;                                 // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EndRerollHoldProgress();
	void HandleFreeRerollsUpdated(const int32 NewNumFreeRerolls);
	void HandleRerollAugments();
	void OnFreeRerollsUpdated(const int32 NewNumFreeRerolls);
	void OnRerollAugments();
	void OnUpdateCurrency(const int32 OwnedCurrency, const int32 RerollCost);
	void StartRerollHoldProgress(const float Duration);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentHUDRerollWidget">();
	}
	static class UFortPlayerAugmentHUDRerollWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentHUDRerollWidget>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentHUDTimerWidget
// 0x0000 (0x02D0 - 0x02D0)
class UFortPlayerAugmentHUDTimerWidget : public UFortHUDElementWidget
{
public:
	void HandleAugmentGrantingTimersFinishedForMatch();
	void HandleAugmentGrantingTimersResetForMatch();
	void HandleAugmentSelectorOpenedStatusChanged(const bool bIsOpened, const bool bViewingAugmentInventory);
	void HandleCanSelectAugmentChanged(bool bCanSelectAugment);
	void HandleHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenElementTagContainer);
	void HandleMovementModeChanged(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void HandleNumPendingAugmentsToGrantUpdated(int8 NumPendingAugmentsToGrant);
	void HandleSelectedAugmentForGrant(class UFortPlayerAugmentItemDefinition* SelectedAugment);
	void HandleTimerUpdated(float TimeRemaining, float TimePercentage);
	void OnAugmentGrantingTimersFinishedForMatch();
	void OnAugmentGrantingTimersResetForMatch();
	void OnAugmentSelectorOpenedStatusChanged(const bool bIsOpened);
	void OnCanSelectAugmentChanged(bool bCanSelectAugment);
	void OnHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenElementTagContainer);
	void OnMovementModeChanged();
	void OnNumPendingAugmentsToGrantUpdated(int32 NumPendingAugmentsToGrant);
	void OnSelectedAugmentForGrant(class UFortPlayerAugmentItemDefinition* HighlightedAugment);
	void OnTimerUpdated(float TimeRemaining, float TimePercentage);

	bool CanEquipSelectionTool() const;
	bool CanSelectAugment() const;
	int32 GetPendingAugmentsToGrant() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentHUDTimerWidget">();
	}
	static class UFortPlayerAugmentHUDTimerWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentHUDTimerWidget>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentInfoEntryWidget
// 0x0068 (0x02F8 - 0x0290)
class UFortPlayerAugmentInfoEntryWidget : public UCommonUserWidget
{
public:
	class FText                                   RarityTextFormat;                                  // 0x0290(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_AugmentName;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_AugmentRarity;                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_AugmentCategory;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemCategoryIndicator*             ItemCategoryIndicator;                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         Image_CategoryAsImage;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_AugmentDescription;                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSocialAvatarIcon*                  Icon_LenderAvatarIcon;                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Overlay_LenderAvatarIcon;                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         Image_LenderSquadColor;                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_BorrowingText;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnItemNewOrBorrowedSet(const bool bIsNew, const bool bIsBorrowed);
	void OnItemPinColorSet(const struct FLinearColor& PinColor);
	void OnItemRaritySet(const EFortRarity Rarity, const struct FFortRarityItemData& RarityItemData);
	void UpdateAugment(const class UFortPlayerAugmentItemDefinition* AugmentItemDefinition);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentInfoEntryWidget">();
	}
	static class UFortPlayerAugmentInfoEntryWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentInfoEntryWidget>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentInGameCarriedWidget
// 0x0000 (0x02D0 - 0x02D0)
class UFortPlayerAugmentInGameCarriedWidget final : public UFortHUDElementWidget
{
public:
	void HandleExitBus(class AFortPlayerControllerZone* FortPCZone);
	void OnShowInitialAugment(const class UFortPlayerAugmentItemDefinition* PlayerAugmentItemDefinition);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentInGameCarriedWidget">();
	}
	static class UFortPlayerAugmentInGameCarriedWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentInGameCarriedWidget>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentInventoryExtensionRow
// 0x0000 (0x02A8 - 0x02A8)
class UFortPlayerAugmentInventoryExtensionRow final : public UAthenaInventoryExtensionRowBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentInventoryExtensionRow">();
	}
	static class UFortPlayerAugmentInventoryExtensionRow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentInventoryExtensionRow>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentInventoryListEntry
// 0x0010 (0x13F0 - 0x13E0)
class UFortPlayerAugmentInventoryListEntry final : public UCommonButtonBase
{
public:
	uint8                                         Pad_13E0[0x10];                                    // 0x13E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAugmentListItemSet(const class UFortItemDefinition* ItemDefinition);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentInventoryListEntry">();
	}
	static class UFortPlayerAugmentInventoryListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentInventoryListEntry>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentInventoryTab
// 0x0158 (0x0500 - 0x03A8)
class UFortPlayerAugmentInventoryTab final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         AugmentsEnabledViaHotfix;                          // 0x03B0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  HiddenAugmentGameplayTags;                         // 0x03D8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FName                                   TabNameID;                                         // 0x03F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x0400(0x00F0)(Edit, NativeAccessSpecifierPrivate)
	class UFortPlayerAugmentInventoryInfoWidget*  AugmentInfo;                                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonListView*                        ListView_Augments;                                 // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleAugmentGrantingTimersFinishedForMatch();
	void HandleAugmentGrantingTimersResetForMatch();
	void HandleNumPendingAugmentsToGrantUpdated(int8 NumPendingAugmentsToGrant);
	void HandleTimerUpdated(float TimeRemaining, float TimePercentage);
	void OnAugmentGrantingTimersFinishedForMatch();
	void OnAugmentGrantingTimersResetForMatch();
	void OnAugmentListUpdated(const int32 NumAugments);
	void OnNumPendingAugmentsToGrantUpdated(int32 NumPendingAugmentsToGrant);
	void OnTimerUpdated(float TimeRemaining, float TimePercentage);
	void RequestOpenSelector();

	int32 GetPendingAugmentsToGrant() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentInventoryTab">();
	}
	static class UFortPlayerAugmentInventoryTab* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentInventoryTab>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentLobbyWidget
// 0x0000 (0x0290 - 0x0290)
class UFortPlayerAugmentLobbyWidget final : public UCommonUserWidget
{
public:
	void OnShowInitialAugment(const class UFortPlayerAugmentItemDefinition* CarriedAugment);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentLobbyWidget">();
	}
	static class UFortPlayerAugmentLobbyWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentLobbyWidget>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentPostMatchUnlocksWidget
// 0x0028 (0x02F8 - 0x02D0)
class UFortPlayerAugmentPostMatchUnlocksWidget final : public UFortHUDElementWidget
{
public:
	struct FScalableFloat                         AugmentsEnabledViaHotfix;                          // 0x02D0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void OnShowUnlockedAugments(const TArray<class UFortPlayerAugmentItemDefinition*>& UnlockedAugments);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentPostMatchUnlocksWidget">();
	}
	static class UFortPlayerAugmentPostMatchUnlocksWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentPostMatchUnlocksWidget>();
	}
};

}

