#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProxyTable

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "StructUtils_structs.hpp"
#include "ProxyTable_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ProxyTable.ChooserParameterProxyTable
// 0x0000 (0x0000 - 0x0000)
class IChooserParameterProxyTable final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserParameterProxyTable">();
	}
	static class IChooserParameterProxyTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChooserParameterProxyTable>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class ProxyTable.ProxyAsset
// 0x0028 (0x0050 - 0x0028)
class UProxyAsset final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    Type;                                              // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    ContextClass;                                      // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       ProxyTable;                                        // 0x0040(0x0010)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProxyAsset">();
	}
	static class UProxyAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProxyAsset>();
	}
};

// Class ProxyTable.ProxyTable
// 0x0020 (0x0048 - 0x0028)
class UProxyTable final : public UObject
{
public:
	TArray<struct FProxyEntry>                    Entries;                                           // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UProxyTable*>                    InheritEntriesFrom;                                // 0x0038(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProxyTable">();
	}
	static class UProxyTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProxyTable>();
	}
};

// Class ProxyTable.ProxyTableFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UProxyTableFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UObject* EvaluateProxyAsset(const class UObject* ContextObject, const class UProxyAsset* Proxy, TSubclassOf<class UObject> ObjectClass);
	static class UObject* EvaluateProxyTable(const class UObject* ContextObject, const class UProxyTable* ProxyTable, class FName Key);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProxyTableFunctionLibrary">();
	}
	static class UProxyTableFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProxyTableFunctionLibrary>();
	}
};

}

