#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ResolveTurretRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class ResolveTurretRuntime.FortPlayerAnimInstance_AntiVehMountedTurret
// 0x0040 (0x15E0 - 0x15A0)
class UFortPlayerAnimInstance_AntiVehMountedTurret final : public UFortPlayerAnimInstanceProxy
{
public:
	struct FVector                                HandAttachL;                                       // 0x15A0(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HandAttachR;                                       // 0x15B8(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   HandAttachBoneNameL;                               // 0x15D0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   HandAttachBoneNameR;                               // 0x15D4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15D8[0x8];                                     // 0x15D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAnimInstance_AntiVehMountedTurret">();
	}
	static class UFortPlayerAnimInstance_AntiVehMountedTurret* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAnimInstance_AntiVehMountedTurret>();
	}
};

// Class ResolveTurretRuntime.FortVehicleAnimInstance_AntiVehMountedTurret
// 0x0010 (0x0620 - 0x0610)
class UFortVehicleAnimInstance_AntiVehMountedTurret final : public UFortMountedTurretAnimInstance
{
public:
	float                                         YawDeltaSmoothed;                                  // 0x0610(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_614[0xC];                                      // 0x0614(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleAnimInstance_AntiVehMountedTurret">();
	}
	static class UFortVehicleAnimInstance_AntiVehMountedTurret* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleAnimInstance_AntiVehMountedTurret>();
	}
};

// Class ResolveTurretRuntime.FortVehicleAnimInstance_SevenMountedTurret
// 0x0010 (0x0620 - 0x0610)
class UFortVehicleAnimInstance_SevenMountedTurret final : public UFortMountedTurretAnimInstance
{
public:
	float                                         YawDeltaSmoothed;                                  // 0x0610(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_614[0xC];                                      // 0x0614(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleAnimInstance_SevenMountedTurret">();
	}
	static class UFortVehicleAnimInstance_SevenMountedTurret* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleAnimInstance_SevenMountedTurret>();
	}
};

}

