#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SBMusicalTargets

#include "Basic.hpp"

#include "SBMusicalTargets_structs.hpp"


namespace SDK::Params
{

// Function SBMusicalTargets.SBMusicalTargetsInterface.AddInteractionPointerIndex
// 0x0004 (0x0004 - 0x0000)
struct SBMusicalTargetsInterface_AddInteractionPointerIndex final
{
public:
	int32                                         PointerIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SBMusicalTargets.SBMusicalTargetsInterface.GetHighlightedCueID
// 0x0018 (0x0018 - 0x0000)
struct SBMusicalTargetsInterface_GetHighlightedCueID final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSBMusicalTargetsCueId                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function SBMusicalTargets.SBMusicalTargetsInterface.IsValidPointerIndex
// 0x0008 (0x0008 - 0x0000)
struct SBMusicalTargetsInterface_IsValidPointerIndex final
{
public:
	int32                                         PointerIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SBMusicalTargets.SBMusicalTargetsInterface.PlayCue
// 0x0018 (0x0018 - 0x0000)
struct SBMusicalTargetsInterface_PlayCue final
{
public:
	struct FSBMusicalTargetsCueId                 CueId;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UUserWidget*                            ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SBMusicalTargets.SBMusicalTargetsInterface.RemoveInteractionPointerIndex
// 0x0004 (0x0004 - 0x0000)
struct SBMusicalTargetsInterface_RemoveInteractionPointerIndex final
{
public:
	int32                                         PointerIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SBMusicalTargets.SBMusicalTargetsInterface.UpdateProgress
// 0x0004 (0x0004 - 0x0000)
struct SBMusicalTargetsInterface_UpdateProgress final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SBMusicalTargets.SBMusicalTargetsInterface.WasTargetHit
// 0x0001 (0x0001 - 0x0000)
struct SBMusicalTargetsInterface_WasTargetHit final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SBMusicalTargets.SBMusicalTargetsTimerComponent.AssignTargetBeat
// 0x0018 (0x0018 - 0x0000)
struct SBMusicalTargetsTimerComponent_AssignTargetBeat final
{
public:
	class UUserWidget*                            TargetWidget;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSBMusicalTargetsCueId                 CueId;                                             // 0x0008(0x0010)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function SBMusicalTargets.SBMusicalTargetsTimerComponent.SetDoubleTimeTempoThreshold
// 0x0004 (0x0004 - 0x0000)
struct SBMusicalTargetsTimerComponent_SetDoubleTimeTempoThreshold final
{
public:
	int32                                         Threshold;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SBMusicalTargets.SBMusicalTargetsTimerComponent.SetHalfTimeTempoThreshold
// 0x0004 (0x0004 - 0x0000)
struct SBMusicalTargetsTimerComponent_SetHalfTimeTempoThreshold final
{
public:
	int32                                         Threshold;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SBMusicalTargets.SBMusicalTargetsTimerComponent.SetMusicClockRef
// 0x0008 (0x0008 - 0x0000)
struct SBMusicalTargetsTimerComponent_SetMusicClockRef final
{
public:
	class UOldMusicClockComponent*                MusicClockRef;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SBMusicalTargets.SBMusicalTargetsTimerComponent.SetTimerEnabled
// 0x0001 (0x0001 - 0x0000)
struct SBMusicalTargetsTimerComponent_SetTimerEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

