#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sidebar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Sidebar.Sidebar_C
// 0x0080 (0x0658 - 0x05D8)
class USidebar_C final : public UFortSocialPanelView_Sidebar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USidebarProfile_C*                      Panel_Profile;                                     // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              Safezone_OnboardingTooltip;                        // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_SideBar;                                  // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text_PartyUp;                                      // 0x05F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_FindFriends;                                  // 0x0610(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_VoiceChat;                                    // 0x0628(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_UserSettings;                                 // 0x0640(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BP_OnActivated();
	void ExecuteUbergraph_Sidebar(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Sidebar_C">();
	}
	static class USidebar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebar_C>();
	}
};

}

