#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SmartObjectsModule

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WorldConditions_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "StructUtils_structs.hpp"
#include "MassEntity_structs.hpp"


namespace SDK
{

// Enum SmartObjectsModule.ESmartObjectChangeReason
// NumValues: 0x000C
enum class ESmartObjectChangeReason : uint8
{
	None                                     = 0,
	OnEvent                                  = 1,
	OnTagAdded                               = 2,
	OnTagRemoved                             = 3,
	OnClaimed                                = 4,
	OnOccupied                               = 5,
	OnReleased                               = 6,
	OnSlotEnabled                            = 7,
	OnSlotDisabled                           = 8,
	OnObjectEnabled                          = 9,
	OnObjectDisabled                         = 10,
	ESmartObjectChangeReason_MAX             = 11,
};

// Enum SmartObjectsModule.ESmartObjectSlotShape
// NumValues: 0x0003
enum class ESmartObjectSlotShape : uint8
{
	Circle                                   = 0,
	Rectangle                                = 1,
	ESmartObjectSlotShape_MAX                = 2,
};

// Enum SmartObjectsModule.ESmartObjectSlotState
// NumValues: 0x0006
enum class ESmartObjectSlotState : uint8
{
	Invalid                                  = 0,
	Free                                     = 1,
	Claimed                                  = 2,
	Occupied                                 = 3,
	Disabled                                 = 4,
	ESmartObjectSlotState_MAX                = 5,
};

// Enum SmartObjectsModule.FSmartObjectSlotEntrySelectionMethod
// NumValues: 0x0003
enum class EFSmartObjectSlotEntrySelectionMethod : uint8
{
	First                                    = 0,
	NearestToSearchLocation                  = 1,
	FSmartObjectSlotEntrySelectionMethod_MAX = 2,
};

// Enum SmartObjectsModule.ESmartObjectCollectionRegistrationResult
// NumValues: 0x0005
enum class ESmartObjectCollectionRegistrationResult : uint8
{
	Failed_InvalidCollection                 = 0,
	Failed_AlreadyRegistered                 = 1,
	Failed_NotFromPersistentLevel            = 2,
	Succeeded                                = 3,
	ESmartObjectCollectionRegistrationResult_MAX = 4,
};

// Enum SmartObjectsModule.ESmartObjectUnregistrationMode
// NumValues: 0x0003
enum class ESmartObjectUnregistrationMode : uint8
{
	KeepRuntimeInstanceActiveIfPartOfCollection = 0,
	DestroyRuntimeInstance                   = 1,
	ESmartObjectUnregistrationMode_MAX       = 2,
};

// Enum SmartObjectsModule.ESmartObjectTagMergingPolicy
// NumValues: 0x0003
enum class ESmartObjectTagMergingPolicy : uint8
{
	Combine                                  = 0,
	Override                                 = 1,
	ESmartObjectTagMergingPolicy_MAX         = 2,
};

// Enum SmartObjectsModule.ESmartObjectTagFilteringPolicy
// NumValues: 0x0004
enum class ESmartObjectTagFilteringPolicy : uint8
{
	NoFilter                                 = 0,
	Combine                                  = 1,
	Override                                 = 2,
	ESmartObjectTagFilteringPolicy_MAX       = 3,
};

// ScriptStruct SmartObjectsModule.SmartObjectSlotDefinitionData
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FSmartObjectSlotDefinitionData
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SmartObjectsModule.SmartObjectSlotAnnotation
// 0x0000 (0x0008 - 0x0008)
struct FSmartObjectSlotAnnotation : public FSmartObjectSlotDefinitionData
{
};

// ScriptStruct SmartObjectsModule.SmartObjectSlotEntryAnnotation
// 0x0020 (0x0028 - 0x0008)
struct FSmartObjectSlotEntryAnnotation final : public FSmartObjectSlotAnnotation
{
public:
	struct FVector3f                              Offset;                                            // 0x0008(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator3f                             Rotation;                                          // 0x0014(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           tag;                                               // 0x0020(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsEntry : 1;                                      // 0x0024(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsExit : 1;                                       // 0x0024(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SmartObjectsModule.SmartObjectRuntime
// 0x0120 (0x0120 - 0x0000)
struct alignas(0x10) FSmartObjectRuntime final
{
public:
	struct FWorldConditionQueryState              PreconditionState;                                 // 0x0000(0x0030)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class USmartObjectDefinition*                 Definition;                                        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class USmartObjectComponent>   OwnerComponent;                                    // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0xB0];                                      // 0x0050(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       SpatialEntryData;                                  // 0x0100(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_110[0x10];                                     // 0x0110(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SmartObjectsModule.SmartObjectHandle
// 0x0004 (0x0004 - 0x0000)
struct FSmartObjectHandle final
{
public:
	uint32                                        ID;                                                // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct SmartObjectsModule.SmartObjectSlotHandle
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FSmartObjectSlotHandle final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SmartObjectsModule.SmartObjectEventData
// 0x0028 (0x0028 - 0x0000)
struct FSmartObjectEventData final
{
public:
	struct FSmartObjectHandle                     SmartObjectHandle;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSmartObjectSlotHandle                 SlotHandle;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESmartObjectChangeReason                      Reason;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           tag;                                               // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x10];                                      // 0x0018(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SmartObjectsModule.SmartObjectUserHandle
// 0x0004 (0x0004 - 0x0000)
struct FSmartObjectUserHandle final
{
public:
	uint32                                        ID;                                                // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct SmartObjectsModule.SmartObjectWorldConditionBase
// 0x0000 (0x0010 - 0x0010)
struct FSmartObjectWorldConditionBase : public FWorldConditionBase
{
};

// ScriptStruct SmartObjectsModule.SmartObjectSlotReference
// 0x0001 (0x0001 - 0x0000)
struct FSmartObjectSlotReference final
{
public:
	uint8                                         Index;                                             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct SmartObjectsModule.SmartObjectSlotLinkAnnotation
// 0x0008 (0x0010 - 0x0008)
struct FSmartObjectSlotLinkAnnotation final : public FSmartObjectSlotAnnotation
{
public:
	struct FGameplayTag                           tag;                                               // 0x0008(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSmartObjectSlotReference              LinkedSlot;                                        // 0x000C(0x0001)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SmartObjectsModule.SmartObjectComponentInstanceData
// 0x0008 (0x0070 - 0x0068)
struct FSmartObjectComponentInstanceData final : public FActorComponentInstanceData
{
public:
	class USmartObjectDefinition*                 DefinitionAsset;                                   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct SmartObjectsModule.SmartObjectSlotDefinition
// 0x00F8 (0x00F8 - 0x0000)
struct FSmartObjectSlotDefinition final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RuntimeTags;                                       // 0x0008(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      UserTagFilter;                                     // 0x0028(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ActivityTags;                                      // 0x0070(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FWorldConditionQueryDefinition         SelectionPreconditions;                            // 0x0090(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FVector                                Offset;                                            // 0x00A8(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x00C0(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               Data;                                              // 0x00D8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class USmartObjectBehaviorDefinition*> BehaviorDefinitions;                               // 0x00E8(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct SmartObjectsModule.SmartObjectSlotDefinitionFragment
// 0x0010 (0x0010 - 0x0000)
struct FSmartObjectSlotDefinitionFragment final : public FMassSharedFragment
{
public:
	class USmartObjectDefinition*                 SmartObjectDefinition;                             // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SmartObjectsModule.SmartObjectSpatialEntryData
// 0x0001 (0x0001 - 0x0000)
struct FSmartObjectSpatialEntryData
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SmartObjectsModule.SmartObjectHashGridEntryData
// 0x000B (0x000C - 0x0001)
struct alignas(0x04) FSmartObjectHashGridEntryData final : public FSmartObjectSpatialEntryData
{
public:
	uint8                                         Pad_1[0xB];                                        // 0x0001(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SmartObjectsModule.SmartObjectOctreeEntryData
// 0x000F (0x0010 - 0x0001)
struct alignas(0x08) FSmartObjectOctreeEntryData final : public FSmartObjectSpatialEntryData
{
public:
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SmartObjectsModule.SmartObjectCollectionEntry
// 0x00E0 (0x00E0 - 0x0000)
struct FSmartObjectCollectionEntry final
{
public:
	struct FGameplayTagContainer                  Tags;                                              // 0x0000(0x0020)(Edit, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FSoftObjectPath                        Path;                                              // 0x0020(0x0018)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0040(0x0060)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FBox                                   Bounds;                                            // 0x00A0(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FSmartObjectHandle                     Handle;                                            // 0x00D8(0x0004)(Edit, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint32                                        DefinitionIdx;                                     // 0x00DC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct SmartObjectsModule.SmartObjectContainer
// 0x00B0 (0x00B0 - 0x0000)
struct FSmartObjectContainer final
{
public:
	struct FBox                                   Bounds;                                            // 0x0000(0x0038)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FSmartObjectCollectionEntry>    CollectionEntries;                                 // 0x0038(0x0010)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TMap<struct FSmartObjectHandle, struct FSoftObjectPath> RegisteredIdToObjectMap;                 // 0x0048(0x0050)(Protected, NativeAccessSpecifierProtected)
	TArray<class USmartObjectDefinition*>         Definitions;                                       // 0x0098(0x0010)(Edit, ZeroConstructor, EditConst, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UObject*                                Owner;                                             // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct SmartObjectsModule.SmartObjectClaimHandle
// 0x0018 (0x0018 - 0x0000)
struct FSmartObjectClaimHandle final
{
public:
	struct FSmartObjectHandle                     SmartObjectHandle;                                 // 0x0000(0x0004)(Edit, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSmartObjectSlotHandle                 SlotHandle;                                        // 0x0008(0x0008)(Edit, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSmartObjectUserHandle                 UserHandle;                                        // 0x0010(0x0004)(Edit, Transient, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SmartObjectsModule.SmartObjectSlotStateData
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FSmartObjectSlotStateData : public FMassFragment
{
};
#pragma pack(pop)

// ScriptStruct SmartObjectsModule.SmartObjectSlotTransform
// 0x0060 (0x0060 - 0x0000)
struct FSmartObjectSlotTransform final : public FSmartObjectSlotStateData
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct SmartObjectsModule.SmartObjectRuntimeSlot
// 0x0088 (0x0088 - 0x0000)
struct FSmartObjectRuntimeSlot final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWorldConditionQueryState              PreconditionState;                                 // 0x0050(0x0030)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SmartObjectsModule.SmartObjectSlotView
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FSmartObjectSlotView final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SmartObjectsModule.SmartObjectRequestFilter
// 0x00F0 (0x00F0 - 0x0000)
struct alignas(0x10) FSmartObjectRequestFilter final
{
public:
	class AActor*                                 UserActor;                                         // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  UserTags;                                          // 0x0008(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      ActivityRequirements;                              // 0x0028(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSubclassOf<class USmartObjectBehaviorDefinition> BehaviorDefinitionClass;                       // 0x0070(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class USmartObjectBehaviorDefinition>> BehaviorDefinitionClasses;             // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x68];                                      // 0x0088(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SmartObjectsModule.SmartObjectRequest
// 0x0130 (0x0130 - 0x0000)
struct FSmartObjectRequest final
{
public:
	struct FBox                                   QueryBox;                                          // 0x0000(0x0038)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSmartObjectRequestFilter              Filter;                                            // 0x0040(0x00F0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct SmartObjectsModule.SmartObjectRequestResult
// 0x0010 (0x0010 - 0x0000)
struct FSmartObjectRequestResult final
{
public:
	struct FSmartObjectHandle                     SmartObjectHandle;                                 // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSmartObjectSlotHandle                 SlotHandle;                                        // 0x0008(0x0008)(Edit, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SmartObjectsModule.SmartObjectSlotEntryRequest
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FSmartObjectSlotEntryRequest final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SmartObjectsModule.SmartObjectSlotEntryLocationResult
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) FSmartObjectSlotEntryLocationResult final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SmartObjectsModule.SmartObjectSlotIndex
// 0x0004 (0x0004 - 0x0000)
struct FSmartObjectSlotIndex final
{
public:
	int32                                         Index;                                             // 0x0000(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct SmartObjectsModule.SmartObjectActorUserData
// 0x0008 (0x0008 - 0x0000)
struct FSmartObjectActorUserData final
{
public:
	TWeakObjectPtr<class AActor>                  UserActor;                                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SmartObjectsModule.SmartObjectWorldConditionObjectTagQueryState
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FSmartObjectWorldConditionObjectTagQueryState final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SmartObjectsModule.SmartObjectWorldConditionObjectTagQuery
// 0x0058 (0x0068 - 0x0010)
struct FSmartObjectWorldConditionObjectTagQuery final : public FSmartObjectWorldConditionBase
{
public:
	uint8                                         Pad_10[0x10];                                      // 0x0010(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      TagQuery;                                          // 0x0020(0x0048)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct SmartObjectsModule.SmartObjectWorldConditionSlotTagQueryState
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FSmartObjectWorldConditionSlotTagQueryState final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SmartObjectsModule.SmartObjectWorldConditionSlotTagQuery
// 0x0058 (0x0068 - 0x0010)
struct FSmartObjectWorldConditionSlotTagQuery final : public FSmartObjectWorldConditionBase
{
public:
	uint8                                         Pad_10[0x10];                                      // 0x0010(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      TagQuery;                                          // 0x0020(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)
};

// ScriptStruct SmartObjectsModule.WorldCondition_SmartObjectActorTagQueryState
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FWorldCondition_SmartObjectActorTagQueryState final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SmartObjectsModule.WorldCondition_SmartObjectActorTagQuery
// 0x0050 (0x0060 - 0x0010)
struct FWorldCondition_SmartObjectActorTagQuery final : public FSmartObjectWorldConditionBase
{
public:
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      TagQuery;                                          // 0x0018(0x0048)(Edit, NativeAccessSpecifierPublic)
};

}

