#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreSelectionUI

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "CommonUILegacy_classes.hpp"
#include "StoreSelectionUI_structs.hpp"


namespace SDK
{

// Class StoreSelectionUI.FortStoreSelectionData
// 0x0058 (0x0578 - 0x0520)
class UFortStoreSelectionData final : public UFortGameFeatureData
{
public:
	TSoftClassPtr<class UClass>                   StoreSelectionScreenClass;                         // 0x0520(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   RegularStoreSelectedText;                          // 0x0548(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   NonRegularStoreSelectedText;                       // 0x0560(0x0018)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortStoreSelectionData">();
	}
	static class UFortStoreSelectionData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortStoreSelectionData>();
	}
};

// Class StoreSelectionUI.FortStoreSelectionOptionEntry
// 0x0020 (0x1450 - 0x1430)
class UFortStoreSelectionOptionEntry final : public UCommonButtonLegacy
{
public:
	class UFortLazyImage*                         Image_Icon;                                        // 0x1430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Description;                                  // 0x1438(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Price;                                        // 0x1440(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_Label;                                    // 0x1448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortStoreSelectionOptionEntry">();
	}
	static class UFortStoreSelectionOptionEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortStoreSelectionOptionEntry>();
	}
};

// Class StoreSelectionUI.FortStoreSelectionScreen
// 0x0420 (0x0900 - 0x04E0)
class UFortStoreSelectionScreen final : public UCommonActivatablePanelLegacy
{
public:
	uint8                                         Pad_4E0[0x8];                                      // 0x04E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonGroupLegacy*               EntryBoxButtonGroup;                               // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortRealMoneyOffer*                    StoreOffer;                                        // 0x04F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonLoadGuard*                       StoreOfferLoadGuard;                               // 0x04F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Header;                                       // 0x0500(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       DynamicEntryBox_Options;                           // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Continue;                                   // 0x0510(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Cancel;                                     // 0x0518(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_InitiallySelectedHint;                    // 0x0520(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TScriptInterface<class IPurchaseChoiceRequesterInterface> PurchaseChoiceOwner;                   // 0x0528(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FItemData>                      StoreOptions;                                      // 0x0538(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UFortMtxOfferData>       SoftDisplayAsset;                                  // 0x0548(0x0028)(Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FItemData                              ItemData[0xC];                                     // 0x0570(0x0048)(Edit, NativeAccessSpecifierPrivate)
	class FText                                   OptionalLabels[0x2];                               // 0x08D0(0x0018)(Edit, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortStoreSelectionScreen">();
	}
	static class UFortStoreSelectionScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortStoreSelectionScreen>();
	}
};

}

