#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnrealEngineExperimental

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum UnrealEngineExperimental.EScriptDiagnosticMessageType
// NumValues: 0x0006
enum class EScriptDiagnosticMessageType : uint8
{
	Debug                                    = 0,
	Verbose                                  = 1,
	Normal                                   = 2,
	Warning                                  = 3,
	Error                                    = 4,
	EScriptDiagnosticMessageType_MAX         = 5,
};

// ScriptStruct UnrealEngineExperimental.ScriptDiagnosticSourceLocation
// 0x0020 (0x0020 - 0x0000)
struct FScriptDiagnosticSourceLocation final
{
public:
	class FString                                 FilePath;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              RowSpan;                                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              ColSpan;                                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UnrealEngineExperimental.ScriptDiagnosticMessage
// 0x0058 (0x0058 - 0x0000)
struct FScriptDiagnosticMessage
{
public:
	EScriptDiagnosticMessageType                  MessageType;                                       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              Timestamp;                                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Channel;                                           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   MessageStr;                                        // 0x0020(0x0018)(NativeAccessSpecifierPublic)
	struct FScriptDiagnosticSourceLocation        SourceLocation;                                    // 0x0038(0x0020)(NativeAccessSpecifierPublic)
};

// ScriptStruct UnrealEngineExperimental.ScriptScreenLogMessage
// 0x0008 (0x0060 - 0x0058)
struct FScriptScreenLogMessage final : public FScriptDiagnosticMessage
{
public:
	struct FColor                                 ScreenColor;                                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DisplayDuration;                                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

