#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VaultingCodeRuntime

#include "Basic.hpp"

#include "VaultingCodeRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function VaultingCodeRuntime.HurdleComponent.BP_CanStartHurdle
// 0x0001 (0x0001 - 0x0000)
struct HurdleComponent_BP_CanStartHurdle final
{
public:
	bool                                          OutCanStartHurdle;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.BP_HandleHurdleStarted
// 0x0034 (0x0034 - 0x0000)
struct HurdleComponent_BP_HandleHurdleStarted final
{
public:
	EHurdleType                                   HurdleType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSynchedActionInfo                     SynchedActionInfo;                                 // 0x0004(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.HandleOwnerJumpInput
// 0x0001 (0x0001 - 0x0000)
struct HurdleComponent_HandleOwnerJumpInput final
{
public:
	bool                                          bPressed;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.HandleOwnerMovementModeChanged
// 0x0010 (0x0010 - 0x0000)
struct HurdleComponent_HandleOwnerMovementModeChanged final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovementMode                                 PreviousMovementMode;                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         PreviousCustomMode;                                // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VaultingCodeRuntime.HurdleComponent.HandleOwnerTeleported
// 0x0008 (0x0008 - 0x0000)
struct HurdleComponent_HandleOwnerTeleported final
{
public:
	class AFortPawn*                              TeleportedOwner;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.HandleTargetingDataValid
// 0x0130 (0x0130 - 0x0000)
struct HurdleComponent_HandleTargetingDataValid final
{
public:
	struct FHurdleTargetingData                   TargetingData;                                     // 0x0000(0x0130)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.OnPlayerStatePawnSet
// 0x0018 (0x0018 - 0x0000)
struct HurdleComponent_OnPlayerStatePawnSet final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  OldPawn;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.RegisterMutatorUpdatedDelegate
// 0x0008 (0x0008 - 0x0000)
struct HurdleComponent_RegisterMutatorUpdatedDelegate final
{
public:
	class APawn*                                  AffectedPawn;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.ServerStartHurdle
// 0x0078 (0x0078 - 0x0000)
struct HurdleComponent_ServerStartHurdle final
{
public:
	struct FReplicatedHurdleTargetingData         InReplicatedTargetingData;                         // 0x0000(0x0070)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	double                                        ClientLastTeleportTime;                            // 0x0070(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.ShouldShowHurdleIndicator
// 0x0001 (0x0001 - 0x0000)
struct HurdleComponent_ShouldShowHurdleIndicator final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleLibrary.PerformHurdleTargeting
// 0x05A8 (0x05A8 - 0x0000)
struct HurdleLibrary_PerformHurdleTargeting final
{
public:
	const class ACharacter*                       Character;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHurdleInputConfig                     HurdleInputConfig;                                 // 0x0008(0x0468)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FHurdleTargetingData                   OutTargetingData;                                  // 0x0470(0x0130)(Parm, OutParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bIsAutoHurdle;                                     // 0x05A0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x05A1(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A2[0x6];                                      // 0x05A2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

