#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortnite

#include "Basic.hpp"


namespace SDK::Params
{

// Function VerseFortnite.VerseFortniteMinigameTeamCollection.OnMinigameDestroyed
// 0x0008 (0x0008 - 0x0000)
struct VerseFortniteMinigameTeamCollection_OnMinigameDestroyed final
{
public:
	class AActor*                                 DestroyedMinigame;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.VerseFortniteMinigameTeamCollection.OnMinigameSetUp
// 0x0008 (0x0008 - 0x0000)
struct VerseFortniteMinigameTeamCollection_OnMinigameSetUp final
{
public:
	class AFortMinigame*                          InMinigame;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.VerseFortniteActorWrapper.OnActorDestroyed
// 0x0008 (0x0008 - 0x0000)
struct VerseFortniteActorWrapper_OnActorDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.VerseFortniteCharacter.HandlePawnEliminated
// 0x0008 (0x0008 - 0x0000)
struct VerseFortniteCharacter_HandlePawnEliminated final
{
public:
	class AFortPlayerPawnAthena*                  EliminatedPawn;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortnite.VerseFortniteCharacter.HandlePosessedPawnChanged
// 0x0010 (0x0010 - 0x0000)
struct VerseFortniteCharacter_HandlePosessedPawnChanged final
{
public:
	class APawn*                                  OldPawn;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

