#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseExperimental

#include "Basic.hpp"

#include "VerseExperimental_structs.hpp"


namespace SDK::Params
{

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RCreateDateTime_L_Nint_M_Nint_M_Nint_M_Nint_M_Nint_M_Nint_M_Nint_R
// 0x0048 (0x0048 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RCreateDateTime_L_Nint_M_Nint_M_Nint_M_Nint_M_Nint_M_Nint_M_Nint_R final
{
public:
	struct Ftuple_Lint_Mint_Mint_Mint_Mint_Mint_Mint_R __verse_0xB2CDDD72_Argument;                  // 0x0000(0x0038)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0038(0x0009)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RCreateTimeSpan_L_Nint_M_Nint_M_Nint_M_Nint_M_Nint_R
// 0x0038 (0x0038 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RCreateTimeSpan_L_Nint_M_Nint_M_Nint_M_Nint_M_Nint_R final
{
public:
	struct Ftuple_Lint_Mint_Mint_Mint_Mint_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0028)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span           RetVal;                                            // 0x0028(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RDateTimeMax
// 0x0010 (0x0010 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RDateTimeMax final
{
public:
	struct VerseExperimental::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseExperimental_date_time           RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RDateTimeMin
// 0x0010 (0x0010 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RDateTimeMin final
{
public:
	struct VerseExperimental::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseExperimental_date_time           RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RDaysInMonth_L_Nint_M_Nint_R
// 0x0018 (0x0018 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RDaysInMonth_L_Nint_M_Nint_R final
{
public:
	struct VerseExperimental::Ftuple_Lint_Mint_R  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RDaysInYear_L_Nint_R
// 0x0010 (0x0010 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RDaysInYear_L_Nint_R final
{
public:
	int64                                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetDate_L_Ndate__time_R
// 0x0020 (0x0020 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetDate_L_Ndate__time_R final
{
public:
	struct FVerseExperimental_date_time           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVerseExperimental_date_parts          RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetDay_L_Ndate__time_R
// 0x0010 (0x0010 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetDay_L_Ndate__time_R final
{
public:
	struct FVerseExperimental_date_time           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetDayOfWeek_L_Ndate__time_R
// 0x0010 (0x0010 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetDayOfWeek_L_Ndate__time_R final
{
public:
	struct FVerseExperimental_date_time           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EVerseExperimental_day_of_week                RetVal;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetDays_L_Ntime__span_R
// 0x0018 (0x0018 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetDays_L_Ntime__span_R final
{
public:
	struct FVerseExperimental_time_span           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, NoDestructor)
	int64                                         RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetHours_L_Ndate__time_R
// 0x0010 (0x0010 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetHours_L_Ndate__time_R final
{
public:
	struct FVerseExperimental_date_time           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetHours_L_Ntime__span_R
// 0x0018 (0x0018 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetHours_L_Ntime__span_R final
{
public:
	struct FVerseExperimental_time_span           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, NoDestructor)
	int64                                         RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetMicroseconds_L_Ndate__time_R
// 0x0010 (0x0010 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetMicroseconds_L_Ndate__time_R final
{
public:
	struct FVerseExperimental_date_time           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetMicroseconds_L_Ntime__span_R
// 0x0018 (0x0018 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetMicroseconds_L_Ntime__span_R final
{
public:
	struct FVerseExperimental_time_span           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, NoDestructor)
	int64                                         RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetMilliseconds_L_Ndate__time_R
// 0x0010 (0x0010 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetMilliseconds_L_Ndate__time_R final
{
public:
	struct FVerseExperimental_date_time           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetMilliseconds_L_Ntime__span_R
// 0x0018 (0x0018 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetMilliseconds_L_Ntime__span_R final
{
public:
	struct FVerseExperimental_time_span           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, NoDestructor)
	int64                                         RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetMinutes_L_Ndate__time_R
// 0x0010 (0x0010 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetMinutes_L_Ndate__time_R final
{
public:
	struct FVerseExperimental_date_time           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetMinutes_L_Ntime__span_R
// 0x0018 (0x0018 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetMinutes_L_Ntime__span_R final
{
public:
	struct FVerseExperimental_time_span           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, NoDestructor)
	int64                                         RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetMonth_L_Ndate__time_R
// 0x0010 (0x0010 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetMonth_L_Ndate__time_R final
{
public:
	struct FVerseExperimental_date_time           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetMonthOfYear_L_Ndate__time_R
// 0x0010 (0x0010 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetMonthOfYear_L_Ndate__time_R final
{
public:
	struct FVerseExperimental_date_time           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EVerseExperimental_month_of_year              RetVal;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetNanoseconds_L_Ndate__time_R
// 0x0010 (0x0010 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetNanoseconds_L_Ndate__time_R final
{
public:
	struct FVerseExperimental_date_time           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetNanoseconds_L_Ntime__span_R
// 0x0018 (0x0018 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetNanoseconds_L_Ntime__span_R final
{
public:
	struct FVerseExperimental_time_span           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, NoDestructor)
	int64                                         RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetSeconds_L_Ndate__time_R
// 0x0010 (0x0010 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetSeconds_L_Ndate__time_R final
{
public:
	struct FVerseExperimental_date_time           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetSeconds_L_Ntime__span_R
// 0x0018 (0x0018 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetSeconds_L_Ntime__span_R final
{
public:
	struct FVerseExperimental_time_span           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, NoDestructor)
	int64                                         RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetTimeOfDay_L_Ndate__time_R
// 0x0038 (0x0038 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetTimeOfDay_L_Ndate__time_R final
{
public:
	struct FVerseExperimental_date_time           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVerseExperimental_time_of_day_parts   RetVal;                                            // 0x0008(0x0030)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalDays_L_Ntime__span_R
// 0x0018 (0x0018 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalDays_L_Ntime__span_R final
{
public:
	struct FVerseExperimental_time_span           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, NoDestructor)
	int64                                         RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalHours_L_Ntime__span_R
// 0x0018 (0x0018 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalHours_L_Ntime__span_R final
{
public:
	struct FVerseExperimental_time_span           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, NoDestructor)
	int64                                         RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalMicroseconds_L_Ntime__span_R
// 0x0018 (0x0018 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalMicroseconds_L_Ntime__span_R final
{
public:
	struct FVerseExperimental_time_span           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, NoDestructor)
	int64                                         RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalMilliseconds_L_Ntime__span_R
// 0x0018 (0x0018 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalMilliseconds_L_Ntime__span_R final
{
public:
	struct FVerseExperimental_time_span           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, NoDestructor)
	int64                                         RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalMinutes_L_Ntime__span_R
// 0x0018 (0x0018 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalMinutes_L_Ntime__span_R final
{
public:
	struct FVerseExperimental_time_span           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, NoDestructor)
	int64                                         RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalSeconds_L_Ntime__span_R
// 0x0018 (0x0018 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetTotalSeconds_L_Ntime__span_R final
{
public:
	struct FVerseExperimental_time_span           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, NoDestructor)
	int64                                         RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGetYear_L_Ndate__time_R
// 0x0010 (0x0010 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGetYear_L_Ndate__time_R final
{
public:
	struct FVerseExperimental_date_time           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGreater_L_Ndate__time_M_Ndate__time_R
// 0x0038 (0x0038 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGreater_L_Ndate__time_M_Ndate__time_R final
{
public:
	struct Ftuple_Ldate__time_Mdate__time_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0009)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseExperimental_date_time           _ExprResult_0;                                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResultStack_1;                                // 0x0028(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGreater_L_Ntime__span_M_Ntime__span_R
// 0x0058 (0x0058 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGreater_L_Ntime__span_M_Ntime__span_R final
{
public:
	struct Ftuple_Ltime__span_Mtime__span_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0020(0x0011)(Parm, OutParm, ReturnParm, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseExperimental_time_span           _ExprResult_0;                                     // 0x0038(0x0010)(NoDestructor)
	FOptionProperty_                              _ExprResultStack_1;                                // 0x0048(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGreaterEqual_L_Ndate__time_M_Ndate__time_R
// 0x0038 (0x0038 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGreaterEqual_L_Ndate__time_M_Ndate__time_R final
{
public:
	struct Ftuple_Ldate__time_Mdate__time_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0009)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseExperimental_date_time           _ExprResult_0;                                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResultStack_1;                                // 0x0028(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RGreaterEqual_L_Ntime__span_M_Ntime__span_R
// 0x0058 (0x0058 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RGreaterEqual_L_Ntime__span_M_Ntime__span_R final
{
public:
	struct Ftuple_Ltime__span_Mtime__span_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0020(0x0011)(Parm, OutParm, ReturnParm, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseExperimental_time_span           _ExprResult_0;                                     // 0x0038(0x0010)(NoDestructor)
	FOptionProperty_                              _ExprResultStack_1;                                // 0x0048(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RLess_L_Ndate__time_M_Ndate__time_R
// 0x0038 (0x0038 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RLess_L_Ndate__time_M_Ndate__time_R final
{
public:
	struct Ftuple_Ldate__time_Mdate__time_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0009)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseExperimental_date_time           _ExprResult_0;                                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResultStack_1;                                // 0x0028(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RLess_L_Ntime__span_M_Ntime__span_R
// 0x0058 (0x0058 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RLess_L_Ntime__span_M_Ntime__span_R final
{
public:
	struct Ftuple_Ltime__span_Mtime__span_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0020(0x0011)(Parm, OutParm, ReturnParm, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseExperimental_time_span           _ExprResult_0;                                     // 0x0038(0x0010)(NoDestructor)
	FOptionProperty_                              _ExprResultStack_1;                                // 0x0048(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RLessEqual_L_Ndate__time_M_Ndate__time_R
// 0x0038 (0x0038 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RLessEqual_L_Ndate__time_M_Ndate__time_R final
{
public:
	struct Ftuple_Ldate__time_Mdate__time_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0009)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseExperimental_date_time           _ExprResult_0;                                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResultStack_1;                                // 0x0028(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RLessEqual_L_Ntime__span_M_Ntime__span_R
// 0x0058 (0x0058 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RLessEqual_L_Ntime__span_M_Ntime__span_R final
{
public:
	struct Ftuple_Ltime__span_Mtime__span_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0020(0x0011)(Parm, OutParm, ReturnParm, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseExperimental_time_span           _ExprResult_0;                                     // 0x0038(0x0010)(NoDestructor)
	FOptionProperty_                              _ExprResultStack_1;                                // 0x0048(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2a_U_L_Nfloat_M_Ntime__span_R
// 0x0050 (0x0050 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2a_U_L_Nfloat_M_Ntime__span_R final
{
public:
	struct Ftuple_Lfloat_Mtime__span_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span           RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0028(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Ltime__span_Mfloat_R            _ExprResult_1;                                     // 0x0038(0x0018)(HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2a_U_L_Ntime__span_M_Nfloat_R
// 0x0050 (0x0050 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2a_U_L_Ntime__span_M_Nfloat_R final
{
public:
	struct Ftuple_Ltime__span_Mfloat_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span           RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0028(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Ltime__span_Mfloat_R            _ExprResult_1;                                     // 0x0038(0x0018)(HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2b_U_L_Ndate__time_M_Ntime__span_R
// 0x0048 (0x0048 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2b_U_L_Ndate__time_M_Ntime__span_R final
{
public:
	struct Ftuple_Ldate__time_Mtime__span_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_date_time           RetVal;                                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Ldate__time_Mtime__span_R       _ExprResult_1;                                     // 0x0030(0x0018)(HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2b_U_L_Ntime__span_M_Ntime__span_R
// 0x0060 (0x0060 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2b_U_L_Ntime__span_M_Ntime__span_R final
{
public:
	struct Ftuple_Ltime__span_Mtime__span_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span           RetVal;                                            // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0030(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Ltime__span_Mtime__span_R       _ExprResult_1;                                     // 0x0040(0x0020)(HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ndate__time_M_Ndate__time_R
// 0x0040 (0x0040 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ndate__time_M_Ndate__time_R final
{
public:
	struct Ftuple_Ldate__time_Mdate__time_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span           RetVal;                                            // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Ldate__time_Mdate__time_R       _ExprResult_1;                                     // 0x0030(0x0010)(HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ndate__time_M_Ntime__span_R
// 0x0048 (0x0048 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ndate__time_M_Ntime__span_R final
{
public:
	struct Ftuple_Ldate__time_Mtime__span_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_date_time           RetVal;                                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Ldate__time_Mtime__span_R       _ExprResult_1;                                     // 0x0030(0x0018)(HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ntime__span_M_Ntime__span_R
// 0x0060 (0x0060 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ntime__span_M_Ntime__span_R final
{
public:
	struct Ftuple_Ltime__span_Mtime__span_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span           RetVal;                                            // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0030(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Ltime__span_Mtime__span_R       _ExprResult_1;                                     // 0x0040(0x0020)(HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ntime__span_R
// 0x0020 (0x0020 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2d_U_L_Ntime__span_R final
{
public:
	struct FVerseExperimental_time_span           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, NoDestructor)
	struct FVerseExperimental_time_span           RetVal;                                            // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2f_U_L_Ntime__span_M_Nfloat_R
// 0x0050 (0x0050 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_Roperator_U_2f_U_L_Ntime__span_M_Nfloat_R final
{
public:
	struct Ftuple_Ltime__span_Mfloat_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span           RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0028(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Ltime__span_Mfloat_R            _ExprResult_1;                                     // 0x0038(0x0018)(HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeAdd_L_Ndate__time_M_Ntime__span_R
// 0x0020 (0x0020 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeAdd_L_Ndate__time_M_Ntime__span_R final
{
public:
	struct Ftuple_Ldate__time_Mtime__span_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_date_time           RetVal;                                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeAdd_L_Ntime__span_M_Ntime__span_R
// 0x0030 (0x0030 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeAdd_L_Ntime__span_M_Ntime__span_R final
{
public:
	struct Ftuple_Ltime__span_Mtime__span_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span           RetVal;                                            // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeDivide_L_Ntime__span_M_Nfloat_R
// 0x0028 (0x0028 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeDivide_L_Ntime__span_M_Nfloat_R final
{
public:
	struct Ftuple_Ltime__span_Mfloat_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span           RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeMultiply_L_Ntime__span_M_Nfloat_R
// 0x0028 (0x0028 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeMultiply_L_Ntime__span_M_Nfloat_R final
{
public:
	struct Ftuple_Ltime__span_Mfloat_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span           RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeNegate_L_Ntime__span_R
// 0x0020 (0x0020 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeNegate_L_Ntime__span_R final
{
public:
	struct FVerseExperimental_time_span           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, NoDestructor)
	struct FVerseExperimental_time_span           RetVal;                                            // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeSubtract_L_Ndate__time_M_Ndate__time_R
// 0x0020 (0x0020 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeSubtract_L_Ndate__time_M_Ndate__time_R final
{
public:
	struct Ftuple_Ldate__time_Mdate__time_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span           RetVal;                                            // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeSubtract_L_Ndate__time_M_Ntime__span_R
// 0x0020 (0x0020 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeSubtract_L_Ndate__time_M_Ntime__span_R final
{
public:
	struct Ftuple_Ldate__time_Mtime__span_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_date_time           RetVal;                                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeSubtract_L_Ntime__span_M_Ntime__span_R
// 0x0030 (0x0030 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RPerformNativeSubtract_L_Ntime__span_M_Ntime__span_R final
{
public:
	struct Ftuple_Ltime__span_Mtime__span_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	struct FVerseExperimental_time_span           RetVal;                                            // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RToString_L_Ndate__time_R
// 0x0018 (0x0018 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RToString_L_Ndate__time_R final
{
public:
	struct FVerseExperimental_date_time           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RToString_L_Ntime__span_R
// 0x0020 (0x0020 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RToString_L_Ntime__span_R final
{
public:
	struct FVerseExperimental_time_span           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, NoDestructor)
	FVerseStringProperty_                         RetVal;                                            // 0x0010(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RUtcNow
// 0x0010 (0x0010 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RUtcNow final
{
public:
	struct VerseExperimental::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseExperimental_date_time           RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RValidate_L_Ndate__time_R
// 0x00B0 (0x00B0 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RValidate_L_Ndate__time_R final
{
public:
	struct FVerseExperimental_date_time           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_0 : 1;                                 // 0x000A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              _ExprResultStack_1;                                // 0x0010(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Ldate__time_Mdate__time_R       _ExprResult_3;                                     // 0x0030(0x0010)(HasGetValueTypeHash)
	struct FVerseExperimental_date_time           _ExprResultStack_4;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0048(0x0010)(HasGetValueTypeHash)
	struct VerseExperimental::Ftuple_L_R          _ExprResult_6;                                     // 0x0058(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              _ExprResultStack_7;                                // 0x0060(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x0070(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Ldate__time_Mdate__time_R       _ExprResult_9;                                     // 0x0080(0x0010)(HasGetValueTypeHash)
	struct FVerseExperimental_date_time           _ExprResultStack_10;                               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x0098(0x0010)(HasGetValueTypeHash)
	struct VerseExperimental::Ftuple_L_R          _ExprResult_12;                                    // 0x00A8(0x0001)(HasGetValueTypeHash)
};

// Function VerseExperimental.VerseExperimental._L_2fVerse_2eorg_2fVerseExperimental_N_RValidateDateTime_L_Nint_M_Nint_M_Nint_M_Nint_M_Nint_M_Nint_M_Nint_R
// 0x0040 (0x0040 - 0x0000)
struct VerseExperimental__L_2fVerse_2eorg_2fVerseExperimental_N_RValidateDateTime_L_Nint_M_Nint_M_Nint_M_Nint_M_Nint_M_Nint_M_Nint_R final
{
public:
	struct Ftuple_Lint_Mint_Mint_Mint_Mint_Mint_Mint_R __verse_0xB2CDDD72_Argument;                  // 0x0000(0x0038)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseExperimental.VerseExperimental.VerseExperimental_date_parts$Factory
// 0x0018 (0x0018 - 0x0000)
struct VerseExperimental_VerseExperimental_date_parts_Factory final
{
public:
	struct FVerseExperimental_date_parts          RetVal;                                            // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseExperimental.VerseExperimental.VerseExperimental_date_time$Factory
// 0x0008 (0x0008 - 0x0000)
struct VerseExperimental_VerseExperimental_date_time_Factory final
{
public:
	struct FVerseExperimental_date_time           RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseExperimental.VerseExperimental.VerseExperimental_time_of_day_parts$Factory
// 0x0030 (0x0030 - 0x0000)
struct VerseExperimental_VerseExperimental_time_of_day_parts_Factory final
{
public:
	struct FVerseExperimental_time_of_day_parts   RetVal;                                            // 0x0000(0x0030)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseExperimental.VerseExperimental.VerseExperimental_time_span$Factory
// 0x0010 (0x0010 - 0x0000)
struct VerseExperimental_VerseExperimental_time_span_Factory final
{
public:
	struct FVerseExperimental_time_span           RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
};

}

