#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseDevices_0

#include "Basic.hpp"

#include "VerseDevices_0_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseNative_structs.hpp"
#include "Verse_structs.hpp"


namespace SDK::Params
{

// Function VerseDevices.Devices_device_function_get_vector3._L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__vector3_N_RInvoke
// 0x0020 (0x0020 - 0x0000)
struct Devices_device_function_get_vector3__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__vector3_N_RInvoke final
{
public:
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseDevices.Devices_device_event_agent_int._L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R
// 0x0018 (0x0018 - 0x0000)
struct Devices_device_event_agent_int__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R final
{
public:
	FVerseFunctionProperty_                       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UObject*                                RetVal;                                            // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_device_event_agent_int.Await
// 0x0028 (0x0028 - 0x0000)
struct Devices_device_event_agent_int_Await final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_creative_object._L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform
// 0x0070 (0x0070 - 0x0000)
struct Devices_creative_object__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform final
{
public:
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 RetVal;                                            // 0x0010(0x0060)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseDevices.Devices_creative_prop._L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RTeleportTo_L_Nvector3_M_Nrotation_R
// 0x0430 (0x0430 - 0x0000)
struct Devices_creative_prop__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RTeleportTo_L_Nvector3_M_Nrotation_R final
{
public:
	struct VerseDevices_0::Ftuple_Lvector3_Mrotation_R __verse_0xB2CDDD72_Argument;                  // 0x0000(0x0040)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0040(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_0 : 1;                                 // 0x0042(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	EDevices_teleport_to_result                   __verse_0x95D09D0E_Result_2;                       // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0048(0x0010)(HasGetValueTypeHash)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct VerseDevices_0::Ftuple_Lvector3_Mrotation_R _ExprResult_2;                                // 0x0060(0x0040)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_3;                               // 0x00A0(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_4;                                // 0x00B0(0x0011)(HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_5;                                     // 0x00C8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_6;                                     // 0x00D8(0x0010)(HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x63A8D5FA_DebugLog_3;                     // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_7;                                // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x8BA81554_LogString_3;                    // 0x00F8(0x0010)(HasGetValueTypeHash)
	EDevices_teleport_to_result                   __verse_0x00000000__4;                             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        InvokeResultDummy_8;                               // 0x0110(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_9;                                // 0x0120(0x0011)(HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_10;                                    // 0x0138(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_11;                                    // 0x0148(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_12;                              // 0x0158(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_13;                               // 0x0168(0x0011)(HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_14;                                    // 0x0180(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_15;                                    // 0x0190(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_16;                              // 0x01A0(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_17;                               // 0x01B0(0x0011)(HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_18;                                    // 0x01C8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_19;                                    // 0x01D8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_20;                              // 0x01E8(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_21;                               // 0x01F8(0x0011)(HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_22;                                    // 0x0210(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_23;                                    // 0x0220(0x0010)(HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x00000000__10;                            // 0x0230(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_24;                         // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_25;                                        // 0x0240(0x0010)(HasGetValueTypeHash)
	struct Ftuple_L_Kchar_M_QLevel_Nlog__level_R  _ExprResult_26;                                    // 0x0250(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_27;                                    // 0x0268(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                __verse_0xFFC68BC5_Array_11;                       // 0x0278(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_28;                                        // 0x0288(0x0010)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>        _ExprResult_29;                                    // 0x0298(0x0010)(ContainsInstancedReference)
	TArray<FVerseStringProperty_>                 __verse_0xFFC68BC5_Array_12;                       // 0x02A8(0x0010)(ContainsInstancedReference)
	struct VerseDevices_0::Ftuple_L_Kchar_M_Kchar_R __verse_0x00000000__13;                          // 0x02B8(0x0020)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_30;                                    // 0x02D8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_31;                               // 0x02E8(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_32;                                        // 0x02F8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_33;                               // 0x0308(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_34;                               // 0x0318(0x0010)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>        _ForResult_35;                                     // 0x0328(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_36;                                      // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_37;                                     // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xFB88B569_Item_15;                        // 0x0348(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                _ExprResult_38;                                    // 0x0358(0x0010)(ContainsInstancedReference)
	FVerseStringProperty_                         __verse_0xFFC68BC5_Array_16;                       // 0x0368(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                _ForResult_39;                                     // 0x0378(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_40;                                      // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_41;                                     // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0xFB88B569_Item_18;                        // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_42;                                    // 0x03A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ForResult_43;                                     // 0x03B0(0x0010)(HasGetValueTypeHash)
	int64                                         _ForIndex_44;                                      // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_45;                                     // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        __verse_0xFB88B569_Item_20;                        // 0x03D0(0x0010)(HasGetValueTypeHash)
	uint8                                         _ExprResult_46;                                    // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              _ExprResult_47;                                    // 0x03E1(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E3[0x5];                                      // 0x03E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        InvokeResultDummy_48;                              // 0x03E8(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_49;                               // 0x03F8(0x0011)(HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_50;                                    // 0x0410(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_51;                                    // 0x0420(0x0010)(HasGetValueTypeHash)
};

// Function VerseDevices.Devices_creative_prop._L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RTeleportToInternal_L_Nvector3_M_Nrotation_R
// 0x0050 (0x0050 - 0x0000)
struct Devices_creative_prop__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RTeleportToInternal_L_Nvector3_M_Nrotation_R final
{
public:
	struct VerseDevices_0::Ftuple_Lvector3_Mrotation_R __verse_0xB2CDDD72_Argument;                  // 0x0000(0x0040)(Parm, HasGetValueTypeHash)
	EDevices_teleport_to_result                   RetVal;                                            // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_creative_prop._L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose
// 0x0001 (0x0001 - 0x0000)
struct Devices_creative_prop__L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose final
{
public:
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_creative_prop._L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid
// 0x0003 (0x0003 - 0x0000)
struct Devices_creative_prop__L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid final
{
public:
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_creative_prop.MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R
// 0x0080 (0x0080 - 0x0000)
struct Devices_creative_prop_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct Ftuple_Lvector3_Mrotation_Mfloat_R     __verse_0xB2CDDD72_Argument;                       // 0x0020(0x0050)(Parm, HasGetValueTypeHash)
	class UConcurrency_task*                      RetVal;                                            // 0x0070(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_creative_prop.MoveToInternal_L_Nvector3_M_Nrotation_M_Nfloat_R
// 0x0080 (0x0080 - 0x0000)
struct Devices_creative_prop_MoveToInternal_L_Nvector3_M_Nrotation_M_Nfloat_R final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct Ftuple_Lvector3_Mrotation_Mfloat_R     __verse_0xB2CDDD72_Argument;                       // 0x0020(0x0050)(Parm, HasGetValueTypeHash)
	class UConcurrency_task*                      RetVal;                                            // 0x0070(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_Rdevice__event
// 0x0020 (0x0020 - 0x0000)
struct Devices__L_2fFortnite_2ecom_2fDevices_N_Rdevice__event final
{
public:
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0010(0x0010)(HasGetValueTypeHash)
};

// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_Rdevice__event_L_Nany_R
// 0x0010 (0x0010 - 0x0000)
struct Devices__L_2fFortnite_2ecom_2fDevices_N_Rdevice__event_L_Nany_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_RGetCreativeObjectsWithTag_L_Ntag_R
// 0x0018 (0x0018 - 0x0000)
struct Devices__L_2fFortnite_2ecom_2fDevices_N_RGetCreativeObjectsWithTag_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UObject*>                        RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_RGetCreativeObjectsWithTags_L_Ntag__search__criteria_R
// 0x0018 (0x0018 - 0x0000)
struct Devices__L_2fFortnite_2ecom_2fDevices_N_RGetCreativeObjectsWithTags_L_Ntag__search__criteria_R final
{
public:
	class UTags_tag_search_criteria*              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UObject*>                        RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetPlayspace_U_L_Ncreative__object__interface_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct Devices__L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetPlayspace_U_L_Ncreative__object__interface_M_Ntuple_L_R_R final
{
public:
	struct Ftuple_Lcreative__object__interface_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;  // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UObject*                                RetVal;                                            // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetTags_U_L_Ncreative__object__interface_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct Devices__L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetTags_U_L_Ncreative__object__interface_M_Ntuple_L_R_R final
{
public:
	struct Ftuple_Lcreative__object__interface_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;  // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UObject*                                RetVal;                                            // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_RSpawnProp_L_Ncreative__prop__asset_M_Nvector3_M_Nrotation_R
// 0x0050 (0x0050 - 0x0000)
struct Devices__L_2fFortnite_2ecom_2fDevices_N_RSpawnProp_L_Ncreative__prop__asset_M_Nvector3_M_Nrotation_R final
{
public:
	struct Ftuple_Lcreative__prop__asset_Mvector3_Mrotation_R __verse_0xB2CDDD72_Argument;           // 0x0000(0x0040)(Parm, HasGetValueTypeHash)
	struct Ftuple_L_Qcreative__prop_Mspawn__prop__result_R RetVal;                                   // 0x0040(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function VerseDevices.Devices._L_2fFortnite_2ecom_2fDevices_N_RToString_L_Nmove__to__internal__result_R
// 0x01D0 (0x01D0 - 0x0000)
struct alignas(0x08) Devices__L_2fFortnite_2ecom_2fDevices_N_RToString_L_Nmove__to__internal__result_R final
{
public:
	EDevices_move_to_internal_result              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	EDevices_move_to_internal_result              __verse_0x00000000__1;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        InvokeResultDummy_0;                               // 0x0020(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_1;                                // 0x0030(0x0011)(HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_2;                                     // 0x0048(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_3;                                     // 0x0058(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_4;                               // 0x0068(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_5;                                // 0x0078(0x0011)(HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_6;                                     // 0x0090(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_7;                                     // 0x00A0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_8;                               // 0x00B0(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_9;                                // 0x00C0(0x0011)(HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_10;                                    // 0x00D8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_11;                                    // 0x00E8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_12;                              // 0x00F8(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_13;                               // 0x0108(0x0011)(HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_14;                                    // 0x0120(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_15;                                    // 0x0130(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_16;                              // 0x0140(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_17;                               // 0x0150(0x0011)(HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_18;                                    // 0x0168(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_19;                                    // 0x0178(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_20;                              // 0x0188(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_21;                               // 0x0198(0x0011)(HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_22;                                    // 0x01B0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_23;                                    // 0x01C0(0x0010)(HasGetValueTypeHash)
};

// Function VerseDevices.Devices.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct Devices__InitCDO final
{
public:
	class UDevices_creative_prop_asset*           _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_device_function_set_string._L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__string_N_RInvoke_L_N_Kchar_R
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) Devices_device_function_set_string__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__string_N_RInvoke_L_N_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_creative_device._L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnBegin__Internal
// 0x0030 (0x0030 - 0x0000)
struct Devices_creative_device__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnBegin__Internal final
{
public:
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_0;                                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_1;                                 // 0x0010(0x0010)(HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_2;                                     // 0x0020(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_3;                                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_creative_device._L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnEnd
// 0x0001 (0x0001 - 0x0000)
struct Devices_creative_device__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnEnd final
{
public:
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_creative_device._L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform
// 0x0070 (0x0070 - 0x0000)
struct Devices_creative_device__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform final
{
public:
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 RetVal;                                            // 0x0010(0x0060)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseDevices.Devices_creative_device.OnBegin
// 0x0028 (0x0028 - 0x0000)
struct Devices_creative_device_OnBegin final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_device_event_void._L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R
// 0x0018 (0x0018 - 0x0000)
struct Devices_device_event_void__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R final
{
public:
	FVerseFunctionProperty_                       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UObject*                                RetVal;                                            // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_device_event_void.Await
// 0x0028 (0x0028 - 0x0000)
struct Devices_device_event_void_Await final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_device_event_optional_agent._L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R
// 0x0018 (0x0018 - 0x0000)
struct Devices_device_event_optional_agent__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R final
{
public:
	FVerseFunctionProperty_                       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UObject*                                RetVal;                                            // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_device_event_optional_agent.Await
// 0x0028 (0x0028 - 0x0000)
struct Devices_device_event_optional_agent_Await final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_CreativeAnimation._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_N_RGetAnimationController_L_Ncreative__prop_R
// 0x0018 (0x0018 - 0x0000)
struct Devices_CreativeAnimation__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_N_RGetAnimationController_L_Ncreative__prop_R final
{
public:
	class UDevices_creative_prop*                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct Ftuple_L_Qanimation__controller_Mget__animation__controller__result_R RetVal;             // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_CreativeAnimation._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_N_Roperator_U_2eGetAnimationController_U_L_Ncreative__prop_M_Ntuple_L_R_R
// 0x0188 (0x0188 - 0x0000)
struct Devices_CreativeAnimation__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_N_Roperator_U_2eGetAnimationController_U_L_Ncreative__prop_M_Ntuple_L_R_R final
{
public:
	struct Ftuple_Lcreative__prop_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;               // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	EVerseFalse                                   _ExprResult_0;                                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct Ftuple_L_Qanimation__controller_Mget__animation__controller__result_R __verse_0x95D09D0E_Result_1; // 0x0020(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0030(0x0010)(HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x63A8D5FA_DebugLog_1;                     // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_2;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_3;                               // 0x0050(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_4;                                // 0x0060(0x0011)(HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_5;                                     // 0x0078(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_6;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x00000000__3;                             // 0x0098(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_7;                          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x00A8(0x0010)(HasGetValueTypeHash)
	struct Ftuple_L_Kchar_M_QLevel_Nlog__level_R  _ExprResult_9;                                     // 0x00B8(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_10;                                    // 0x00D0(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResult_11;                                    // 0x00E0(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        InvokeResultDummy_12;                              // 0x00E8(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_13;                               // 0x00F8(0x0011)(HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_14;                                    // 0x0110(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_15;                                    // 0x0120(0x0010)(HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x00000000__5;                             // 0x0130(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_16;                         // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_17;                                        // 0x0140(0x0010)(HasGetValueTypeHash)
	struct Ftuple_L_Kchar_M_QLevel_Nlog__level_R  _ExprResult_18;                                    // 0x0150(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_19;                                    // 0x0168(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResult_20;                                    // 0x0178(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              _ExprResultStack_21;                               // 0x0180(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_CreativeAnimation.Devices_CreativeAnimation_cubic_bezier_parameters$Factory
// 0x0020 (0x0020 - 0x0000)
struct Devices_CreativeAnimation_Devices_CreativeAnimation_cubic_bezier_parameters_Factory final
{
public:
	struct FDevices_CreativeAnimation_cubic_bezier_parameters RetVal;                                // 0x0000(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseDevices.Devices_CreativeAnimation.Devices_CreativeAnimation_keyframe_delta$Factory
// 0x0070 (0x0070 - 0x0000)
struct Devices_CreativeAnimation_Devices_CreativeAnimation_keyframe_delta_Factory final
{
public:
	struct FDevices_CreativeAnimation_keyframe_delta RetVal;                                         // 0x0000(0x0070)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseDevices.Devices_device_function_set_int._L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__int_N_RInvoke_L_Nint_R
// 0x0008 (0x0008 - 0x0000)
struct Devices_device_function_set_int__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__int_N_RInvoke_L_Nint_R final
{
public:
	int64                                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_device_function._L_2fFortnite_2ecom_2fDevices_2fdevice__function_N_RInvoke
// 0x0001 (0x0001 - 0x0000)
struct Devices_device_function__L_2fFortnite_2ecom_2fDevices_2fdevice__function_N_RInvoke final
{
public:
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_device_function._L_2fFortnite_2ecom_2fDevices_2fdevice__function_N_RInvoke_L_Nagent_R
// 0x0008 (0x0008 - 0x0000)
struct Devices_device_function__L_2fFortnite_2ecom_2fDevices_2fdevice__function_N_RInvoke_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_CreativeAnimation_animation_controller.$InitCDO
// 0x0040 (0x0040 - 0x0000)
struct Devices_CreativeAnimation_animation_controller__InitCDO final
{
public:
	class UDiagnostics_log*                       _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_multicast_delegate*        _ExprResult_2;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_3;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_multicast_delegate*        _ExprResult_4;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_multicast_delegate*        _ExprResult_6;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_7;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RGetState
// 0x0002 (0x0002 - 0x0000)
struct Devices_CreativeAnimation_animation_controller__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RGetState final
{
public:
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EDevices_CreativeAnimation_animation_controller_state RetVal;                                    // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RIsValid
// 0x0003 (0x0003 - 0x0000)
struct Devices_CreativeAnimation_animation_controller__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RIsValid final
{
public:
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseDevices.Devices_CreativeAnimation_animation_controller._L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RLogPlayStopPauseResultIfError_L_N_Kchar_M_Nplaystoppause__result_R
// 0x0418 (0x0418 - 0x0000)
struct Devices_CreativeAnimation_animation_controller__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RLogPlayStopPauseResultIfError_L_N_Kchar_M_Nplaystoppause__result_R final
{
public:
	struct Ftuple_L_Kchar_Mplaystoppause__result_R __verse_0xB2CDDD72_Argument;                      // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_0;                               // 0x0018(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_1;                                // 0x0028(0x0011)(HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_2;                                     // 0x0040(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_3;                                     // 0x0050(0x0010)(HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x00000000__2;                             // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_4;                          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0070(0x0010)(HasGetValueTypeHash)
	struct Ftuple_L_Kchar_M_QLevel_Nlog__level_R  _ExprResult_6;                                     // 0x0080(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0098(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                __verse_0xFFC68BC5_Array_3;                        // 0x00A8(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x00B8(0x0010)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>        _ExprResult_9;                                     // 0x00C8(0x0010)(ContainsInstancedReference)
	TArray<FVerseStringProperty_>                 __verse_0xFFC68BC5_Array_4;                        // 0x00D8(0x0010)(ContainsInstancedReference)
	struct VerseDevices_0::Ftuple_L_Kchar_M_Kchar_R __verse_0x00000000__5;                           // 0x00E8(0x0020)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_10;                               // 0x0108(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x0118(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_12;                                    // 0x0128(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_13;                               // 0x0138(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_14;                               // 0x0148(0x0010)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>        _ForResult_15;                                     // 0x0158(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_16;                                      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_17;                                     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xFB88B569_Item_7;                         // 0x0178(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                _ExprResult_18;                                    // 0x0188(0x0010)(ContainsInstancedReference)
	FVerseStringProperty_                         __verse_0xFFC68BC5_Array_8;                        // 0x0198(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                _ForResult_19;                                     // 0x01A8(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_20;                                      // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_21;                                     // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0xFB88B569_Item_10;                        // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_22;                                    // 0x01D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ForResult_23;                                     // 0x01E0(0x0010)(HasGetValueTypeHash)
	int64                                         _ForIndex_24;                                      // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_25;                                     // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        __verse_0xFB88B569_Item_12;                        // 0x0200(0x0010)(HasGetValueTypeHash)
	uint8                                         _ExprResult_26;                                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              _ExprResult_27;                                    // 0x0211(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_213[0x5];                                      // 0x0213(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        InvokeResultDummy_28;                              // 0x0218(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_29;                               // 0x0228(0x0011)(HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_30;                                    // 0x0240(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_31;                                    // 0x0250(0x0010)(HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x00000000__14;                            // 0x0260(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_32;                         // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_33;                                        // 0x0270(0x0010)(HasGetValueTypeHash)
	struct Ftuple_L_Kchar_M_QLevel_Nlog__level_R  _ExprResult_34;                                    // 0x0280(0x0018)(HasGetValueTypeHash)
