#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Verse

#include "Basic.hpp"

#include "Verse_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function Verse.Verse_cancelable._L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel
// 0x0001 (0x0001 - 0x0000)
struct Verse_cancelable__L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel final
{
public:
	struct Verse::Ftuple_L_R                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function Verse.Verse_localizable_string._L_2fVerse_2eorg_2fVerse_2flocalizable__value_N_RLocalizeValue_L_Nlocale_R
// 0x0048 (0x0048 - 0x0000)
struct Verse_localizable_string__L_2fVerse_2eorg_2fVerse_2flocalizable__value_N_RLocalizeValue_L_Nlocale_R final
{
public:
	struct FVerse_locale                          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0018(0x0010)(HasGetValueTypeHash)
	struct Ftuple_L_Kchar_M_QWhere_Nlocale_R      _ExprResult_1;                                     // 0x0028(0x0018)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResult_2;                                     // 0x0040(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_RMakeColorFromHex_L_N_Kchar_R
// 0x0028 (0x0028 - 0x0000)
struct Colors__L_2fVerse_2eorg_2fColors_N_RMakeColorFromHex_L_N_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	struct FColors_color                          RetVal;                                            // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_RMakeColorFromHSV_L_Nfloat_M_Nfloat_M_Nfloat_R
// 0x0030 (0x0030 - 0x0000)
struct Colors__L_2fVerse_2eorg_2fColors_N_RMakeColorFromHSV_L_Nfloat_M_Nfloat_M_Nfloat_R final
{
public:
	struct Verse::Ftuple_Lfloat_Mfloat_Mfloat_R   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	struct FColors_color                          RetVal;                                            // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_RMakeColorFromSRGB_L_Nfloat_M_Nfloat_M_Nfloat_R
// 0x0030 (0x0030 - 0x0000)
struct Colors__L_2fVerse_2eorg_2fColors_N_RMakeColorFromSRGB_L_Nfloat_M_Nfloat_M_Nfloat_R final
{
public:
	struct Verse::Ftuple_Lfloat_Mfloat_Mfloat_R   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	struct FColors_color                          RetVal;                                            // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_RMakeColorFromSRGBValues_L_Nint_M_Nint_M_Nint_R
// 0x0030 (0x0030 - 0x0000)
struct Colors__L_2fVerse_2eorg_2fColors_N_RMakeColorFromSRGBValues_L_Nint_M_Nint_M_Nint_R final
{
public:
	struct Ftuple_Lint_Mint_Mint_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	struct FColors_color                          RetVal;                                            // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_RMakeColorFromTemperature_L_Nfloat_R
// 0x0020 (0x0020 - 0x0000)
struct Colors__L_2fVerse_2eorg_2fColors_N_RMakeColorFromTemperature_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColors_color                          RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_RMakeHSVFromColor_L_Ncolor_R
// 0x0030 (0x0030 - 0x0000)
struct Colors__L_2fVerse_2eorg_2fColors_N_RMakeHSVFromColor_L_Ncolor_R final
{
public:
	struct FColors_color                          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct Verse::Ftuple_Lfloat_Mfloat_Mfloat_R   RetVal;                                            // 0x0018(0x0018)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_RMakeSRGBFromColor_L_Ncolor_R
// 0x0030 (0x0030 - 0x0000)
struct Colors__L_2fVerse_2eorg_2fColors_N_RMakeSRGBFromColor_L_Ncolor_R final
{
public:
	struct FColors_color                          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct Verse::Ftuple_Lfloat_Mfloat_Mfloat_R   RetVal;                                            // 0x0018(0x0018)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Ncolor_R
// 0x0048 (0x0048 - 0x0000)
struct Colors__L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Ncolor_R final
{
public:
	struct Ftuple_Lcolor_Mcolor_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	struct FColors_color                          RetVal;                                            // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Nfloat_R
// 0x0038 (0x0038 - 0x0000)
struct Colors__L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Nfloat_R final
{
public:
	struct Ftuple_Lcolor_Mfloat_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	struct FColors_color                          RetVal;                                            // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Nint_R
// 0x0038 (0x0038 - 0x0000)
struct Colors__L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Ncolor_M_Nint_R final
{
public:
	struct Ftuple_Lcolor_Mint_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	struct FColors_color                          RetVal;                                            // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Nfloat_M_Ncolor_R
// 0x0038 (0x0038 - 0x0000)
struct Colors__L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Nfloat_M_Ncolor_R final
{
public:
	struct Ftuple_Lfloat_Mcolor_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	struct FColors_color                          RetVal;                                            // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Nint_M_Ncolor_R
// 0x0038 (0x0038 - 0x0000)
struct Colors__L_2fVerse_2eorg_2fColors_N_Roperator_U_2a_U_L_Nint_M_Ncolor_R final
{
public:
	struct Ftuple_Lint_Mcolor_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	struct FColors_color                          RetVal;                                            // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2b_U_L_Ncolor_M_Ncolor_R
// 0x0048 (0x0048 - 0x0000)
struct Colors__L_2fVerse_2eorg_2fColors_N_Roperator_U_2b_U_L_Ncolor_M_Ncolor_R final
{
public:
	struct Ftuple_Lcolor_Mcolor_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	struct FColors_color                          RetVal;                                            // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2d_U_L_Ncolor_M_Ncolor_R
// 0x0048 (0x0048 - 0x0000)
struct Colors__L_2fVerse_2eorg_2fColors_N_Roperator_U_2d_U_L_Ncolor_M_Ncolor_R final
{
public:
	struct Ftuple_Lcolor_Mcolor_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	struct FColors_color                          RetVal;                                            // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2f_U_L_Ncolor_M_Nfloat_R
// 0x0040 (0x0040 - 0x0000)
struct Colors__L_2fVerse_2eorg_2fColors_N_Roperator_U_2f_U_L_Ncolor_M_Nfloat_R final
{
public:
	struct Ftuple_Lcolor_Mfloat_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0020(0x0019)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Verse.Colors._L_2fVerse_2eorg_2fColors_N_Roperator_U_2f_U_L_Ncolor_M_Nint_R
// 0x0040 (0x0040 - 0x0000)
struct Colors__L_2fVerse_2eorg_2fColors_N_Roperator_U_2f_U_L_Ncolor_M_Nint_R final
{
public:
	struct Ftuple_Lcolor_Mint_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0020(0x0019)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Verse.Colors.Colors_color$Factory
// 0x0018 (0x0018 - 0x0000)
struct Colors_Colors_color_Factory final
{
public:
	struct FColors_color                          RetVal;                                            // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Verse.Colors_NamedColors.$InitCDO
// 0x2028 (0x2028 - 0x0000)
struct Colors_NamedColors__InitCDO final
{
public:
	struct FColors_color                          _ExprResultStack_0;                                // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0028(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_3;                                // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0050(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0060(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_6;                                // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0088(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_8;                                     // 0x0098(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_9;                                // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_10;                                        // 0x00C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_11;                                    // 0x00D0(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_12;                               // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_13;                                        // 0x00F8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_14;                                    // 0x0108(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_15;                               // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_16;                                        // 0x0130(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_17;                                    // 0x0140(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_18;                               // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_19;                                        // 0x0168(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_20;                                    // 0x0178(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_21;                               // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_22;                                        // 0x01A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_23;                                    // 0x01B0(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_24;                               // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_25;                                        // 0x01D8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_26;                                    // 0x01E8(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_27;                               // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_28;                                        // 0x0210(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_29;                                    // 0x0220(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_30;                               // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_31;                                        // 0x0248(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_32;                                    // 0x0258(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_33;                               // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_34;                                        // 0x0280(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_35;                                    // 0x0290(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_36;                               // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_37;                                        // 0x02B8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_38;                                    // 0x02C8(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_39;                               // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_40;                                        // 0x02F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_41;                                    // 0x0300(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_42;                               // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_43;                                        // 0x0328(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_44;                                    // 0x0338(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_45;                               // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_46;                                        // 0x0360(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_47;                                    // 0x0370(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_48;                               // 0x0380(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_49;                                        // 0x0398(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_50;                                    // 0x03A8(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_51;                               // 0x03B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_52;                                        // 0x03D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_53;                                    // 0x03E0(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_54;                               // 0x03F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_55;                                        // 0x0408(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_56;                                    // 0x0418(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_57;                               // 0x0428(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_58;                                        // 0x0440(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_59;                                    // 0x0450(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_60;                               // 0x0460(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_61;                                        // 0x0478(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_62;                                    // 0x0488(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_63;                               // 0x0498(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_64;                                        // 0x04B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_65;                                    // 0x04C0(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_66;                               // 0x04D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_67;                                        // 0x04E8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_68;                                    // 0x04F8(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_69;                               // 0x0508(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_70;                                        // 0x0520(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_71;                                    // 0x0530(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_72;                               // 0x0540(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_73;                                        // 0x0558(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_74;                                    // 0x0568(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_75;                               // 0x0578(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_76;                                        // 0x0590(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_77;                                    // 0x05A0(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_78;                               // 0x05B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_79;                                        // 0x05C8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_80;                                    // 0x05D8(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_81;                               // 0x05E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_82;                                        // 0x0600(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_83;                                    // 0x0610(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_84;                               // 0x0620(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_85;                                        // 0x0638(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_86;                                    // 0x0648(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_87;                               // 0x0658(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_88;                                        // 0x0670(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_89;                                    // 0x0680(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_90;                               // 0x0690(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_91;                                        // 0x06A8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_92;                                    // 0x06B8(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_93;                               // 0x06C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_94;                                        // 0x06E0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_95;                                    // 0x06F0(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_96;                               // 0x0700(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_97;                                        // 0x0718(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_98;                                    // 0x0728(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_99;                               // 0x0738(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_100;                                       // 0x0750(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_101;                                   // 0x0760(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_102;                              // 0x0770(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_103;                                       // 0x0788(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_104;                                   // 0x0798(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_105;                              // 0x07A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_106;                                       // 0x07C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_107;                                   // 0x07D0(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_108;                              // 0x07E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_109;                                       // 0x07F8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_110;                                   // 0x0808(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_111;                              // 0x0818(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_112;                                       // 0x0830(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_113;                                   // 0x0840(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_114;                              // 0x0850(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_115;                                       // 0x0868(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_116;                                   // 0x0878(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_117;                              // 0x0888(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_118;                                       // 0x08A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_119;                                   // 0x08B0(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_120;                              // 0x08C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_121;                                       // 0x08D8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_122;                                   // 0x08E8(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_123;                              // 0x08F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_124;                                       // 0x0910(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_125;                                   // 0x0920(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_126;                              // 0x0930(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_127;                                       // 0x0948(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_128;                                   // 0x0958(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_129;                              // 0x0968(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_130;                                       // 0x0980(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_131;                                   // 0x0990(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_132;                              // 0x09A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_133;                                       // 0x09B8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_134;                                   // 0x09C8(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_135;                              // 0x09D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_136;                                       // 0x09F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_137;                                   // 0x0A00(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_138;                              // 0x0A10(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_139;                                       // 0x0A28(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_140;                                   // 0x0A38(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_141;                              // 0x0A48(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_142;                                       // 0x0A60(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_143;                                   // 0x0A70(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_144;                              // 0x0A80(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_145;                                       // 0x0A98(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_146;                                   // 0x0AA8(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_147;                              // 0x0AB8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_148;                                       // 0x0AD0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_149;                                   // 0x0AE0(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_150;                              // 0x0AF0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_151;                                       // 0x0B08(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_152;                                   // 0x0B18(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_153;                              // 0x0B28(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_154;                                       // 0x0B40(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_155;                                   // 0x0B50(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_156;                              // 0x0B60(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_157;                                       // 0x0B78(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_158;                                   // 0x0B88(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_159;                              // 0x0B98(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_160;                                       // 0x0BB0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_161;                                   // 0x0BC0(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_162;                              // 0x0BD0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_163;                                       // 0x0BE8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_164;                                   // 0x0BF8(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_165;                              // 0x0C08(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_166;                                       // 0x0C20(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_167;                                   // 0x0C30(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_168;                              // 0x0C40(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_169;                                       // 0x0C58(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_170;                                   // 0x0C68(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_171;                              // 0x0C78(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_172;                                       // 0x0C90(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_173;                                   // 0x0CA0(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_174;                              // 0x0CB0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_175;                                       // 0x0CC8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_176;                                   // 0x0CD8(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_177;                              // 0x0CE8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_178;                                       // 0x0D00(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_179;                                   // 0x0D10(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_180;                              // 0x0D20(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_181;                                       // 0x0D38(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_182;                                   // 0x0D48(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_183;                              // 0x0D58(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_184;                                       // 0x0D70(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_185;                                   // 0x0D80(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_186;                              // 0x0D90(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_187;                                       // 0x0DA8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_188;                                   // 0x0DB8(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_189;                              // 0x0DC8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_190;                                       // 0x0DE0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_191;                                   // 0x0DF0(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_192;                              // 0x0E00(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_193;                                       // 0x0E18(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_194;                                   // 0x0E28(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_195;                              // 0x0E38(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_196;                                       // 0x0E50(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_197;                                   // 0x0E60(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_198;                              // 0x0E70(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_199;                                       // 0x0E88(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_200;                                   // 0x0E98(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_201;                              // 0x0EA8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_202;                                       // 0x0EC0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_203;                                   // 0x0ED0(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_204;                              // 0x0EE0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_205;                                       // 0x0EF8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_206;                                   // 0x0F08(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_207;                              // 0x0F18(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_208;                                       // 0x0F30(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_209;                                   // 0x0F40(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_210;                              // 0x0F50(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_211;                                       // 0x0F68(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_212;                                   // 0x0F78(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_213;                              // 0x0F88(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_214;                                       // 0x0FA0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_215;                                   // 0x0FB0(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_216;                              // 0x0FC0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_217;                                       // 0x0FD8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_218;                                   // 0x0FE8(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_219;                              // 0x0FF8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_220;                                       // 0x1010(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_221;                                   // 0x1020(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_222;                              // 0x1030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_223;                                       // 0x1048(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_224;                                   // 0x1058(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_225;                              // 0x1068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_226;                                       // 0x1080(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_227;                                   // 0x1090(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_228;                              // 0x10A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_229;                                       // 0x10B8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_230;                                   // 0x10C8(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_231;                              // 0x10D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_232;                                       // 0x10F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_233;                                   // 0x1100(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_234;                              // 0x1110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_235;                                       // 0x1128(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_236;                                   // 0x1138(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_237;                              // 0x1148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_238;                                       // 0x1160(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_239;                                   // 0x1170(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_240;                              // 0x1180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_241;                                       // 0x1198(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_242;                                   // 0x11A8(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_243;                              // 0x11B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_244;                                       // 0x11D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_245;                                   // 0x11E0(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_246;                              // 0x11F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_247;                                       // 0x1208(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_248;                                   // 0x1218(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_249;                              // 0x1228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_250;                                       // 0x1240(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_251;                                   // 0x1250(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_252;                              // 0x1260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_253;                                       // 0x1278(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_254;                                   // 0x1288(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_255;                              // 0x1298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_256;                                       // 0x12B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_257;                                   // 0x12C0(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_258;                              // 0x12D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_259;                                       // 0x12E8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_260;                                   // 0x12F8(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_261;                              // 0x1308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_262;                                       // 0x1320(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_263;                                   // 0x1330(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_264;                              // 0x1340(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_265;                                       // 0x1358(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_266;                                   // 0x1368(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_267;                              // 0x1378(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_268;                                       // 0x1390(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_269;                                   // 0x13A0(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_270;                              // 0x13B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_271;                                       // 0x13C8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_272;                                   // 0x13D8(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_273;                              // 0x13E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_274;                                       // 0x1400(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_275;                                   // 0x1410(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_276;                              // 0x1420(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_277;                                       // 0x1438(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_278;                                   // 0x1448(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_279;                              // 0x1458(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_280;                                       // 0x1470(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_281;                                   // 0x1480(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_282;                              // 0x1490(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_283;                                       // 0x14A8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_284;                                   // 0x14B8(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_285;                              // 0x14C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_286;                                       // 0x14E0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_287;                                   // 0x14F0(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_288;                              // 0x1500(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_289;                                       // 0x1518(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_290;                                   // 0x1528(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_291;                              // 0x1538(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_292;                                       // 0x1550(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_293;                                   // 0x1560(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_294;                              // 0x1570(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_295;                                       // 0x1588(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_296;                                   // 0x1598(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_297;                              // 0x15A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_298;                                       // 0x15C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_299;                                   // 0x15D0(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_300;                              // 0x15E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_301;                                       // 0x15F8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_302;                                   // 0x1608(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_303;                              // 0x1618(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_304;                                       // 0x1630(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_305;                                   // 0x1640(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_306;                              // 0x1650(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_307;                                       // 0x1668(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_308;                                   // 0x1678(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_309;                              // 0x1688(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_310;                                       // 0x16A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_311;                                   // 0x16B0(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_312;                              // 0x16C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_313;                                       // 0x16D8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_314;                                   // 0x16E8(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_315;                              // 0x16F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_316;                                       // 0x1710(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_317;                                   // 0x1720(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_318;                              // 0x1730(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_319;                                       // 0x1748(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_320;                                   // 0x1758(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_321;                              // 0x1768(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_322;                                       // 0x1780(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_323;                                   // 0x1790(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_324;                              // 0x17A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_325;                                       // 0x17B8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_326;                                   // 0x17C8(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_327;                              // 0x17D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_328;                                       // 0x17F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_329;                                   // 0x1800(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_330;                              // 0x1810(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_331;                                       // 0x1828(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_332;                                   // 0x1838(0x0010)(HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_333;                              // 0x1848(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_334;                                       // 0x1860(0x0010)(HasGetValueTypeHash)
