#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseUI

#include "Basic.hpp"

#include "VerseUI_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseNative_structs.hpp"
#include "Verse_structs.hpp"


namespace SDK::Params
{

// Function VerseUI.UI._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_N_RGetPlayerUI_L_Nplayer_R
// 0x0010 (0x0010 - 0x0000)
struct UI__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_N_RGetPlayerUI_L_Nplayer_R final
{
public:
	class USimulation_player*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseUI.UI._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_N_RMakeCanvasSlot_L_Nwidget_M_Nvector2_M_Nvector2_M_Ntype_7b__X_Nint_20where_200_20_3c_3d_20__X_M_20__X_20_3c_3d_202147483647_7d_M_Nvector2_R
// 0x00C0 (0x00C0 - 0x0000)
struct UI__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_N_RMakeCanvasSlot_L_Nwidget_M_Nvector2_M_Nvector2_M_Ntype_7b__X_Nint_20where_200_20_3c_3d_20__X_M_20__X_20_3c_3d_202147483647_7d_M_Nvector2_R final
{
public:
	struct Ftuple_Lwidget_Mvector2_M_QSize_Nvector2_20_3d_20_2e_2e_2e_M_QZOrder_Ntype_7b__X_Nint_20where_200_20_3c_3d_20__X_M_20__X_20_3c_3d_202147483647_7d_20_3d_20_2e_2e_2e_M_QAlignment_Nvector2_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0058)(Parm, HasGetValueTypeHash)
	struct FUI_canvas_slot                        RetVal;                                            // 0x0058(0x0068)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseUI.UI.UI_anchors$Factory
// 0x0040 (0x0040 - 0x0000)
struct UI_UI_anchors_Factory final
{
public:
	struct FUI_anchors                            RetVal;                                            // 0x0000(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector2                   _ExprResult_0;                                     // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector2                   _ExprResult_1;                                     // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI.UI_button_slot$Factory
// 0x0050 (0x0050 - 0x0000)
struct UI_UI_button_slot_Factory final
{
public:
	struct FUI_button_slot                        RetVal;                                            // 0x0000(0x0030)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FUI_margin                             _ExprResult_0;                                     // 0x0030(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI.UI_canvas_slot$Factory
// 0x00B8 (0x00B8 - 0x0000)
struct UI_UI_canvas_slot_Factory final
{
public:
	struct FUI_canvas_slot                        RetVal;                                            // 0x0000(0x0068)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FUI_anchors                            _ExprResult_0;                                     // 0x0068(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FUI_margin                             _ExprResult_1;                                     // 0x0088(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector2                   _ExprResult_2;                                     // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI.UI_margin$Factory
// 0x0020 (0x0020 - 0x0000)
struct UI_UI_margin_Factory final
{
public:
	struct FUI_margin                             RetVal;                                            // 0x0000(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI.UI_overlay_slot$Factory
// 0x0050 (0x0050 - 0x0000)
struct UI_UI_overlay_slot_Factory final
{
public:
	struct FUI_overlay_slot                       RetVal;                                            // 0x0000(0x0030)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FUI_margin                             _ExprResult_0;                                     // 0x0030(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI.UI_player_ui_slot$Factory
// 0x0010 (0x0010 - 0x0000)
struct UI_UI_player_ui_slot_Factory final
{
public:
	struct FUI_player_ui_slot                     RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI.UI_stack_box_slot$Factory
// 0x0070 (0x0070 - 0x0000)
struct UI_UI_stack_box_slot_Factory final
{
public:
	struct FUI_stack_box_slot                     RetVal;                                            // 0x0000(0x0040)(Parm, OutParm, ReturnParm)
	struct FUI_margin                             _ExprResult_0;                                     // 0x0040(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResult_1;                                     // 0x0060(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__1;                             // 0x0069(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_2 : 1;                                 // 0x006B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_3;                                // 0x006C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseUI.UI.UI_user_widget_slot$Factory
// 0x0018 (0x0018 - 0x0000)
struct UI_UI_user_widget_slot_Factory final
{
public:
	struct FUI_user_widget_slot                   RetVal;                                            // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};

// Function VerseUI.UI.UI_widget_message$Factory
// 0x0010 (0x0010 - 0x0000)
struct UI_UI_widget_message_Factory final
{
public:
	struct FUI_widget_message                     RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseUI.UI_player_ui._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RAddWidget_L_Nwidget_M_Nplayer__ui__slot_R
// 0x0018 (0x0018 - 0x0000)
struct UI_player_ui__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RAddWidget_L_Nwidget_M_Nplayer__ui__slot_R final
{
public:
	struct Ftuple_Lwidget_Mplayer__ui__slot_R     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
};

// Function VerseUI.UI_player_ui._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RAddWidget_L_Nwidget_R
// 0x0008 (0x0008 - 0x0000)
struct UI_player_ui__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RAddWidget_L_Nwidget_R final
{
public:
	class UUI_widget*                             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseUI.UI_player_ui._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RRemoveWidget_L_Nwidget_R
// 0x0008 (0x0008 - 0x0000)
struct UI_player_ui__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fplayer__ui_N_RRemoveWidget_L_Nwidget_R final
{
public:
	class UUI_widget*                             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseUI.UI_widget._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetParentWidget
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) UI_widget__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetParentWidget final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseUI.UI_widget._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetRootWidget
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) UI_widget__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetRootWidget final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseUI.UI_widget._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetVisibility
// 0x0002 (0x0002 - 0x0000)
struct UI_widget__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RGetVisibility final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EUI_widget_visibility                         RetVal;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseUI.UI_widget._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RIsEnabled
// 0x0002 (0x0002 - 0x0000)
struct UI_widget__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RIsEnabled final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseUI.UI_widget._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RSetEnabled_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct UI_widget__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RSetEnabled_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseUI.UI_widget._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RSetVisibility_L_Nwidget__visibility_R
// 0x0001 (0x0001 - 0x0000)
struct UI_widget__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fwidget_N_RSetVisibility_L_Nwidget__visibility_R final
{
public:
	EUI_widget_visibility                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseUI.UI_material_block.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct UI_material_block__InitCDO final
{
public:
	struct FSpatialMath_vector2                   _ExprResult_0;                                     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI_material_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetDesiredSize
// 0x0018 (0x0018 - 0x0000)
struct UI_material_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetDesiredSize final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector2                   RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI_material_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetImage
// 0x0010 (0x0010 - 0x0000)
struct UI_material_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetImage final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAssets_material*                       RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseUI.UI_material_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetTint
// 0x0020 (0x0020 - 0x0000)
struct UI_material_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RGetTint final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColors_color                          RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI_material_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetDesiredSize_L_Nvector2_R
// 0x0010 (0x0010 - 0x0000)
struct UI_material_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetDesiredSize_L_Nvector2_R final
{
public:
	struct FSpatialMath_vector2                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI_material_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetImage_L_Nmaterial_R
// 0x0008 (0x0008 - 0x0000)
struct UI_material_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetImage_L_Nmaterial_R final
{
public:
	class UAssets_material*                       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseUI.UI_material_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetTint_L_Ncolor_R
// 0x0018 (0x0018 - 0x0000)
struct UI_material_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fmaterial__block_N_RSetTint_L_Ncolor_R final
{
public:
	struct FColors_color                          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI_canvas.$InitCDO
// 0x0048 (0x0048 - 0x0000)
struct UI_canvas__InitCDO final
{
public:
	TArray<struct FUI_canvas_slot>                _ExprResult_0;                                     // 0x0000(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_1;                        // 0x0010(0x0010)(ContainsInstancedReference)
	TArray<struct FUI_canvas_slot>                _ForResult_1;                                      // 0x0020(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_2;                                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_3;                                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_3;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0041(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function VerseUI.UI_canvas._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcanvas_N_RAddWidget_L_Ncanvas__slot_R
// 0x0068 (0x0068 - 0x0000)
struct UI_canvas__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcanvas_N_RAddWidget_L_Ncanvas__slot_R final
{
public:
	struct FUI_canvas_slot                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0068)(Parm, NoDestructor)
};

// Function VerseUI.UI_canvas._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcanvas_N_RRemoveWidget_L_Nwidget_R
// 0x0008 (0x0008 - 0x0000)
struct UI_canvas__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcanvas_N_RRemoveWidget_L_Nwidget_R final
{
public:
	class UUI_widget*                             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseUI.UI_text_base.$InitCDO
// 0x01A8 (0x01A8 - 0x0000)
struct UI_text_base__InitCDO final
{
public:
	class UVerse_message*                         _ExprResultStack_0;                                // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0010)(HasGetValueTypeHash)
	struct VerseUI::Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R _ExprResult_2;          // 0x0018(0x0070)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x0098(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UObject*>   _ExprResult_5;                                     // 0x00A8(0x0050)(ContainsInstancedReference)
	TMap<EVerseFalse, EVerseFalse>                __verse_0xC87067A2_Map_1;                          // 0x00F8(0x0050)(ContainsInstancedReference)
	TMap<FVerseStringProperty_, class UObject*>   _ForResult_6;                                      // 0x0148(0x0050)(ContainsInstancedReference)
	int64                                         _ForIndex_7;                                       // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x589418B4_Key_3;                          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x31A8F10C_Value_3;                        // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_8 : 1;                                 // 0x01A2(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_1A2_1 : 7;                                  // 0x01A2(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_9 : 1;                                 // 0x01A3(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function VerseUI.UI_text_base._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetJustification
// 0x0002 (0x0002 - 0x0000)
struct UI_text_base__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetJustification final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EUI_text_justification                        RetVal;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseUI.UI_text_base._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetOverflowPolicy
// 0x0002 (0x0002 - 0x0000)
struct UI_text_base__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetOverflowPolicy final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EUI_text_overflow_policy                      RetVal;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseUI.UI_text_base._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetText
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) UI_text_base__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetText final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function VerseUI.UI_text_base._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetTextColor
// 0x0020 (0x0020 - 0x0000)
struct UI_text_base__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetTextColor final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColors_color                          RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI_text_base._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetTextOpacity
// 0x0010 (0x0010 - 0x0000)
struct UI_text_base__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RGetTextOpacity final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseUI.UI_text_base._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetJustification_L_Ntext__justification_R
// 0x0001 (0x0001 - 0x0000)
struct UI_text_base__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetJustification_L_Ntext__justification_R final
{
public:
	EUI_text_justification                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseUI.UI_text_base._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetOverflowPolicy_L_Ntext__overflow__policy_R
// 0x0001 (0x0001 - 0x0000)
struct UI_text_base__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetOverflowPolicy_L_Ntext__overflow__policy_R final
{
public:
	EUI_text_overflow_policy                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseUI.UI_text_base._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetText_L_Nmessage_R
// 0x0008 (0x0008 - 0x0000)
struct UI_text_base__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetText_L_Nmessage_R final
{
public:
	class UVerse_message*                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseUI.UI_text_base._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetTextColor_L_Ncolor_R
// 0x0018 (0x0018 - 0x0000)
struct UI_text_base__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetTextColor_L_Ncolor_R final
{
public:
	struct FColors_color                          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI_text_base._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetTextOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R
// 0x0008 (0x0008 - 0x0000)
struct UI_text_base__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftext__base_N_RSetTextOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseUI.UI_button.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct UI_button__InitCDO final
{
public:
	class UVerseEngine_subscribable_event*        _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseUI.UI_button._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fbutton_N_ROnClick
// 0x0010 (0x0010 - 0x0000)
struct UI_button__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fbutton_N_ROnClick final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseUI.UI_button._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fbutton_N_RSetWidget_L_Nbutton__slot_R
// 0x0030 (0x0030 - 0x0000)
struct UI_button__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fbutton_N_RSetWidget_L_Nbutton__slot_R final
{
public:
	struct FUI_button_slot                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, NoDestructor)
};

// Function VerseUI.UI_color_block.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct UI_color_block__InitCDO final
{
public:
	struct FSpatialMath_vector2                   _ExprResult_0;                                     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI_color_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RGetColor
// 0x0020 (0x0020 - 0x0000)
struct UI_color_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RGetColor final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColors_color                          RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI_color_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RGetDesiredSize
// 0x0018 (0x0018 - 0x0000)
struct UI_color_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RGetDesiredSize final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector2                   RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI_color_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RGetOpacity
// 0x0010 (0x0010 - 0x0000)
struct UI_color_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RGetOpacity final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseUI.UI_color_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RSetColor_L_Ncolor_R
// 0x0018 (0x0018 - 0x0000)
struct UI_color_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RSetColor_L_Ncolor_R final
{
public:
	struct FColors_color                          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI_color_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RSetDesiredSize_L_Nvector2_R
// 0x0010 (0x0010 - 0x0000)
struct UI_color_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RSetDesiredSize_L_Nvector2_R final
{
public:
	struct FSpatialMath_vector2                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI_color_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RSetOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R
// 0x0008 (0x0008 - 0x0000)
struct UI_color_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fcolor__block_N_RSetOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseUI.UI_overlay.$InitCDO
// 0x0048 (0x0048 - 0x0000)
struct UI_overlay__InitCDO final
{
public:
	TArray<struct FUI_overlay_slot>               _ExprResult_0;                                     // 0x0000(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_1;                        // 0x0010(0x0010)(ContainsInstancedReference)
	TArray<struct FUI_overlay_slot>               _ForResult_1;                                      // 0x0020(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_2;                                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_3;                                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_3;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0041(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function VerseUI.UI_overlay._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2foverlay_N_RAddWidget_L_Noverlay__slot_R
// 0x0030 (0x0030 - 0x0000)
struct UI_overlay__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2foverlay_N_RAddWidget_L_Noverlay__slot_R final
{
public:
	struct FUI_overlay_slot                       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, NoDestructor)
};

// Function VerseUI.UI_overlay._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2foverlay_N_RRemoveWidget_L_Nwidget_R
// 0x0008 (0x0008 - 0x0000)
struct UI_overlay__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2foverlay_N_RRemoveWidget_L_Nwidget_R final
{
public:
	class UUI_widget*                             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseUI.UI_simple_button_internal.$InitCDO
// 0x01B8 (0x01B8 - 0x0000)
struct UI_simple_button_internal__InitCDO final
{
public:
	class UVerse_message*                         _ExprResultStack_0;                                // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0010)(HasGetValueTypeHash)
	struct VerseUI::Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R _ExprResult_2;          // 0x0018(0x0070)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x0098(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UObject*>   _ExprResult_5;                                     // 0x00A8(0x0050)(ContainsInstancedReference)
	TMap<EVerseFalse, EVerseFalse>                __verse_0xC87067A2_Map_1;                          // 0x00F8(0x0050)(ContainsInstancedReference)
	TMap<FVerseStringProperty_, class UObject*>   _ForResult_6;                                      // 0x0148(0x0050)(ContainsInstancedReference)
	int64                                         _ForIndex_7;                                       // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x589418B4_Key_3;                          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x31A8F10C_Value_3;                        // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_8 : 1;                                 // 0x01A2(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_1A2_1 : 7;                                  // 0x01A2(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_9 : 1;                                 // 0x01A3(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerseEngine_subscribable_event*        _ExprResult_10;                                    // 0x01A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_11;                               // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseUI.UI_simple_button_internal._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fsimple__button__internal_N_ROnClick
// 0x0010 (0x0010 - 0x0000)
struct UI_simple_button_internal__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fsimple__button__internal_N_ROnClick final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseUI.UI_simple_button_internal._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fsimple__button__internal_N_RSetText_L_Nmessage_R
// 0x0008 (0x0008 - 0x0000)
struct UI_simple_button_internal__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fsimple__button__internal_N_RSetText_L_Nmessage_R final
{
public:
	class UVerse_message*                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseUI.UI_stack_box.$InitCDO
// 0x0048 (0x0048 - 0x0000)
struct UI_stack_box__InitCDO final
{
public:
	TArray<struct FUI_stack_box_slot>             _ExprResult_0;                                     // 0x0000(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_1;                        // 0x0010(0x0010)(ContainsInstancedReference)
	TArray<struct FUI_stack_box_slot>             _ForResult_1;                                      // 0x0020(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_2;                                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_3;                                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_3;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0041(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function VerseUI.UI_stack_box._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fstack__box_N_RAddWidget_L_Nstack__box__slot_R
// 0x0040 (0x0040 - 0x0000)
struct UI_stack_box__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fstack__box_N_RAddWidget_L_Nstack__box__slot_R final
{
public:
	struct FUI_stack_box_slot                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0040)(Parm)
};

// Function VerseUI.UI_stack_box._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fstack__box_N_RRemoveWidget_L_Nwidget_R
// 0x0008 (0x0008 - 0x0000)
struct UI_stack_box__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fstack__box_N_RRemoveWidget_L_Nwidget_R final
{
public:
	class UUI_widget*                             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseUI.UI_texture_block.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct UI_texture_block__InitCDO final
{
public:
	struct FSpatialMath_vector2                   _ExprResult_0;                                     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI_texture_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetDesiredSize
// 0x0018 (0x0018 - 0x0000)
struct UI_texture_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetDesiredSize final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector2                   RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI_texture_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetImage
// 0x0010 (0x0010 - 0x0000)
struct UI_texture_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetImage final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAssets_texture_2d*                     RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseUI.UI_texture_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetTiling
// 0x0002 (0x0002 - 0x0000)
struct UI_texture_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetTiling final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EUI_image_tile                                RetVal;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseUI.UI_texture_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetTint
// 0x0020 (0x0020 - 0x0000)
struct UI_texture_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RGetTint final
{
public:
	struct VerseUI::Ftuple_L_R                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColors_color                          RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI_texture_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetDesiredSize_L_Nvector2_R
// 0x0010 (0x0010 - 0x0000)
struct UI_texture_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetDesiredSize_L_Nvector2_R final
{
public:
	struct FSpatialMath_vector2                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI_texture_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetImage_L_Ntexture__2d_R
// 0x0008 (0x0008 - 0x0000)
struct UI_texture_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetImage_L_Ntexture__2d_R final
{
public:
	class UAssets_texture_2d*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseUI.UI_texture_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetTiling_L_Nimage__tile_R
// 0x0001 (0x0001 - 0x0000)
struct UI_texture_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetTiling_L_Nimage__tile_R final
{
public:
	EUI_image_tile                                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseUI.UI_texture_block._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetTint_L_Ncolor_R
// 0x0018 (0x0018 - 0x0000)
struct UI_texture_block__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2ftexture__block_N_RSetTint_L_Ncolor_R final
{
public:
	struct FColors_color                          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseUI.UI_user_widget.$InitCDO
// 0x0048 (0x0048 - 0x0000)
struct UI_user_widget__InitCDO final
{
public:
	TArray<struct FUI_user_widget_slot>           _ExprResult_0;                                     // 0x0000(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_1;                        // 0x0010(0x0010)(ContainsInstancedReference)
	TArray<struct FUI_user_widget_slot>           _ForResult_1;                                      // 0x0020(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_2;                                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_3;                                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_3;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0041(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function VerseUI.UI_user_widget._L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fuser__widget_N_RSetWidget_L_Nuser__widget__slot_R
// 0x0018 (0x0018 - 0x0000)
struct UI_user_widget__L_2fUnrealEngine_2ecom_2fTemporary_2fUI_2fuser__widget_N_RSetWidget_L_Nuser__widget__slot_R final
{
public:
	struct FUI_user_widget_slot                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm)
};

}

