#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortniteInternal_0

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseFortniteInternal_0_structs.hpp"
#include "Verse_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function VerseFortniteInternal.Game_fort_playspace_component.__WaitForPlayerEliminated
// 0x0028 (0x0028 - 0x0000)
struct Game_fort_playspace_component___WaitForPlayerEliminated final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_VerseFortniteHacks._L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RgetAllComponentsOfType_L_Ncomponent_M_Ntype_Lany_M_20component_R_R
// 0x0020 (0x0020 - 0x0000)
struct Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RgetAllComponentsOfType_L_Ncomponent_M_Ntype_Lany_M_20component_R_R final
{
public:
	struct Ftuple_Lcomponent_Mcomponent_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TArray<class UEntityComponent*>               RetVal;                                            // 0x0010(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseFortniteInternal.Game_VerseFortniteHacks._L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RGetPawnCollisionEntityID_L_Nplayer__component_R
// 0x0010 (0x0010 - 0x0000)
struct Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RGetPawnCollisionEntityID_L_Nplayer__component_R final
{
public:
	class USimulation_player_component*           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_VerseFortniteHacks._L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RrespawnPlayer_L_Nplayer__component_M_Nplayer__start__component_R
// 0x0010 (0x0010 - 0x0000)
struct Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RrespawnPlayer_L_Nplayer__component_M_Nplayer__start__component_R final
{
public:
	struct Ftuple_Lplayer__component_Mplayer__start__component_R __verse_0xB2CDDD72_Argument;        // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_VerseFortniteHacks._L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RsetAutoRespawnEnabled_L_Ncomponent_M_Nlogic_R
// 0x0010 (0x0010 - 0x0000)
struct Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RsetAutoRespawnEnabled_L_Ncomponent_M_Nlogic_R final
{
public:
	struct Ftuple_Lcomponent_Mlogic_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player_PlayerTravel._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTravel_N_RSendToLobby_L_Nplayer_R
// 0x0008 (0x0008 - 0x0000)
struct Game_Player_PlayerTravel__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTravel_N_RSendToLobby_L_Nplayer_R final
{
public:
	class USimulation_player*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Abilities_ability_component._L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RApplyGameplayEffectToSelf_L_Ngameplay__effect__asset_M_Nfloat_R
// 0x0010 (0x0010 - 0x0000)
struct Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RApplyGameplayEffectToSelf_L_Ngameplay__effect__asset_M_Nfloat_R final
{
public:
	struct Ftuple_Lgameplay__effect__asset_Mfloat_R __verse_0xB2CDDD72_Argument;                     // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Abilities_ability_component._L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RClearAbility_L_Nany_R
// 0x0008 (0x0008 - 0x0000)
struct Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RClearAbility_L_Nany_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Abilities_ability_component._L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbility_L_Nany_R
// 0x0008 (0x0008 - 0x0000)
struct Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbility_L_Nany_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Abilities_ability_component._L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbilityAndActivateOnce_L_Nany_R
// 0x0008 (0x0008 - 0x0000)
struct Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbilityAndActivateOnce_L_Nany_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Abilities_ability_component._L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbilityAndActivateOnceWithTarget_L_Nany_M_Nability__component_R
// 0x0010 (0x0010 - 0x0000)
struct Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbilityAndActivateOnceWithTarget_L_Nany_M_Nability__component_R final
{
public:
	struct VerseFortniteInternal_0::Ftuple_Lany_Mability__component_R __verse_0xB2CDDD72_Argument;   // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Abilities_ability_component._L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RTryActivateAbility_L_Nany_R
// 0x0010 (0x0010 - 0x0000)
struct Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RTryActivateAbility_L_Nany_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_Abilities_AbilityComponent._L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForCharacter_L_Nfort__character_R
// 0x0010 (0x0010 - 0x0000)
struct Game_Abilities_AbilityComponent__L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForCharacter_L_Nfort__character_R final
{
public:
	class UObject*                                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Abilities_AbilityComponent._L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForPlayer_L_Nplayer__component_R
// 0x0010 (0x0010 - 0x0000)
struct Game_Abilities_AbilityComponent__L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForPlayer_L_Nplayer__component_R final
{
public:
	class USimulation_player_component*           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_stat_container._L_2fFortnite_2ecom_2fGame_2fstat__container_N_RGetStatValue_L_Nint_R
// 0x0010 (0x0010 - 0x0000)
struct Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RGetStatValue_L_Nint_R final
{
public:
	int64                                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_stat_container._L_2fFortnite_2ecom_2fGame_2fstat__container_N_RIncrementStat_L_Nint_M_Nint_R
// 0x0018 (0x0018 - 0x0000)
struct Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RIncrementStat_L_Nint_M_Nint_R final
{
public:
	struct VerseFortniteInternal_0::Ftuple_Lint_Mint_R __verse_0xB2CDDD72_Argument;                  // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_stat_container._L_2fFortnite_2ecom_2fGame_2fstat__container_N_RSetStatValue_L_Nint_M_Nint_R
// 0x0018 (0x0018 - 0x0000)
struct Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RSetStatValue_L_Nint_M_Nint_R final
{
public:
	struct VerseFortniteInternal_0::Ftuple_Lint_Mint_R __verse_0xB2CDDD72_Argument;                  // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_Abilities_gameplay_ability_asset._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability__asset_N_RGetAbilityType
// 0x0010 (0x0010 - 0x0000)
struct Game_Abilities_gameplay_ability_asset__L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability__asset_N_RGetAbilityType final
{
public:
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_fort_building_settings_component._L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuilding_L_NPlayerSettingState_R
// 0x0001 (0x0001 - 0x0000)
struct Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuilding_L_NPlayerSettingState_R final
{
public:
	EGame_PlayerSettingState                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_fort_building_settings_component._L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuildingOnWater_L_NPlayerSettingState_R
// 0x0001 (0x0001 - 0x0000)
struct Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuildingOnWater_L_NPlayerSettingState_R final
{
public:
	EGame_PlayerSettingState                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_fort_building_settings_component._L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditing_L_NPlayerSettingState_R
// 0x0001 (0x0001 - 0x0000)
struct Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditing_L_NPlayerSettingState_R final
{
public:
	EGame_PlayerSettingState                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_fort_building_settings_component._L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditingHostile_L_NPlayerSettingState_R
// 0x0001 (0x0001 - 0x0000)
struct Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditingHostile_L_NPlayerSettingState_R final
{
public:
	EGame_PlayerSettingState                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_fort_building_settings_component._L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetTrapPlacement_L_NPlayerSettingState_R
// 0x0001 (0x0001 - 0x0000)
struct Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetTrapPlacement_L_NPlayerSettingState_R final
{
public:
	EGame_PlayerSettingState                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_fortnite_building_component._L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeDamaged
// 0x0002 (0x0002 - 0x0000)
struct Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeDamaged final
{
public:
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_fortnite_building_component._L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeReplaced
// 0x0002 (0x0002 - 0x0000)
struct Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeReplaced final
{
public:
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_fortnite_building_component._L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeDamaged_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeDamaged_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_fortnite_building_component._L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeReplaced_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeReplaced_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_fortnite_building_component._L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RwasPlayerBuilt
// 0x0002 (0x0002 - 0x0000)
struct Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RwasPlayerBuilt final
{
public:
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_Item_player_pickup_component._L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RattemptPartialCollect_L_Nitem__type_M_Nint_M_Nplayer__component_R
// 0x0018 (0x0018 - 0x0000)
struct Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RattemptPartialCollect_L_Nitem__type_M_Nint_M_Nplayer__component_R final
{
public:
	struct Ftuple_Litem__type_Mint_Mplayer__component_R __verse_0xB2CDDD72_Argument;                 // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Item_player_pickup_component._L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetNumOfItemType_L_Nitem__type_R
// 0x0010 (0x0010 - 0x0000)
struct Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetNumOfItemType_L_Nitem__type_R final
{
public:
	class UGame_Item_item_type*                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Item_player_pickup_component._L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetPrimaryItemType
// 0x0010 (0x0010 - 0x0000)
struct Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetPrimaryItemType final
{
public:
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGame_Item_item_type*                   RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Item_player_pickup_component._L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgivePickupTo_L_Nplayer__component_R
// 0x0008 (0x0008 - 0x0000)
struct Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgivePickupTo_L_Nplayer__component_R final
{
public:
	class USimulation_player_component*           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Item_player_pickup_component._L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RtossPickup_L_Nvector3_M_N_Qplayer__component_R
// 0x0020 (0x0020 - 0x0000)
struct Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RtossPickup_L_Nvector3_M_N_Qplayer__component_R final
{
public:
	struct Ftuple_Lvector3_M_Qplayer__component_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player_PlayerStatus._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStatus_N_RgetStatus_L_Nplayer__component_M_Nplayer__status__type_R
// 0x0018 (0x0018 - 0x0000)
struct Game_Player_PlayerStatus__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStatus_N_RgetStatus_L_Nplayer__component_M_Nplayer__status__type_R final
{
public:
	struct Ftuple_Lplayer__component_Mplayer__status__type_R __verse_0xB2CDDD72_Argument;            // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_Item_PlayerPickupComponent._L_2fFortnite_2ecom_2fGame_2fItem_2fPlayerPickupComponent_N_RcreatePickup_L_Ncomponent_M_Nfort__item__definition_M_Nint_M_Nvector3_R
// 0x0038 (0x0038 - 0x0000)
struct Game_Item_PlayerPickupComponent__L_2fFortnite_2ecom_2fGame_2fItem_2fPlayerPickupComponent_N_RcreatePickup_L_Ncomponent_M_Nfort__item__definition_M_Nint_M_Nvector3_R final
{
public:
	struct Ftuple_Lcomponent_Mfort__item__definition_Mint_Mvector3_R __verse_0xB2CDDD72_Argument;    // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player_PlayerTeam._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RContainsHumanPlayers_L_Nplayer__team_R
// 0x0008 (0x0008 - 0x0000)
struct Game_Player_PlayerTeam__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RContainsHumanPlayers_L_Nplayer__team_R final
{
public:
	struct FGame_Player_player_team               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              RetVal;                                            // 0x0004(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player_PlayerTeam._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_REquals_L_Nplayer__team_M_Nplayer__team_R
// 0x000C (0x000C - 0x0000)
struct Game_Player_PlayerTeam__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_REquals_L_Nplayer__team_M_Nplayer__team_R final
{
public:
	struct Ftuple_Lplayer__team_Mplayer__team_R   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_Player_PlayerTeam._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetFirstTeam
// 0x0008 (0x0008 - 0x0000)
struct Game_Player_PlayerTeam__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetFirstTeam final
{
public:
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGame_Player_player_team               RetVal;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseFortniteInternal.Game_Player_PlayerTeam._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetInvalidTeam
// 0x0008 (0x0008 - 0x0000)
struct Game_Player_PlayerTeam__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetInvalidTeam final
{
public:
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGame_Player_player_team               RetVal;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseFortniteInternal.Game_Player_PlayerTeam._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetNextTeam_L_Nplayer__team_R
// 0x0008 (0x0008 - 0x0000)
struct Game_Player_PlayerTeam__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetNextTeam_L_Nplayer__team_R final
{
public:
	struct FGame_Player_player_team               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGame_Player_player_team               RetVal;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseFortniteInternal.Game_Player_PlayerTeam._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetTeam_L_Nplayer_R
// 0x0010 (0x0010 - 0x0000)
struct Game_Player_PlayerTeam__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetTeam_L_Nplayer_R final
{
public:
	class USimulation_player*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGame_Player_player_team               RetVal;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseFortniteInternal.Game_Player_PlayerTeam._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetTeamColor_L_Nplayer__team_R
// 0x0020 (0x0020 - 0x0000)
struct Game_Player_PlayerTeam__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetTeamColor_L_Nplayer__team_R final
{
public:
	struct FGame_Player_player_team               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColors_color                          RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseFortniteInternal.Game_Player_PlayerTeam._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetTeamMembers_L_Nplayer__team_R
// 0x0018 (0x0018 - 0x0000)
struct Game_Player_PlayerTeam__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetTeamMembers_L_Nplayer__team_R final
{
public:
	struct FGame_Player_player_team               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USimulation_player*>             RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseFortniteInternal.Game_Player_PlayerTeam._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetTeamSize_L_Nplayer__team_R
// 0x0010 (0x0010 - 0x0000)
struct Game_Player_PlayerTeam__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RGetTeamSize_L_Nplayer__team_R final
{
public:
	struct FGame_Player_player_team               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player_PlayerTeam._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RPickTeam_L_Nplayer_M_Nplayer__team_R
// 0x0018 (0x0018 - 0x0000)
struct Game_Player_PlayerTeam__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RPickTeam_L_Nplayer_M_Nplayer__team_R final
{
public:
	struct Ftuple_Lplayer_Mplayer__team_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	struct FGame_Player_player_team               RetVal;                                            // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseFortniteInternal.Game_Player_PlayerTeam._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RSetTeam_L_Nplayer_M_Nplayer__team_R
// 0x0018 (0x0018 - 0x0000)
struct Game_Player_PlayerTeam__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTeam_N_RSetTeam_L_Nplayer_M_Nplayer__team_R final
{
public:
	struct Ftuple_Lplayer_Mplayer__team_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_Movement_projectile_movement_component._L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetBounciness_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct Game_Movement_projectile_movement_component__L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetBounciness_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Movement_projectile_movement_component._L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetDirection_L_Nvector3_R
// 0x0018 (0x0018 - 0x0000)
struct Game_Movement_projectile_movement_component__L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetDirection_L_Nvector3_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseFortniteInternal.Game_Movement_projectile_movement_component._L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetFriction_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct Game_Movement_projectile_movement_component__L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetFriction_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Movement_projectile_movement_component._L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetGravity_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct Game_Movement_projectile_movement_component__L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetGravity_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Movement_projectile_movement_component._L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetShouldBounce_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct Game_Movement_projectile_movement_component__L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetShouldBounce_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_Movement_projectile_movement_component._L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetSpeed_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct Game_Movement_projectile_movement_component__L_2fFortnite_2ecom_2fGame_2fMovement_2fprojectile__movement__component_N_RSetSpeed_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player.Game_Player_player_team$Factory
// 0x0004 (0x0004 - 0x0000)
struct Game_Player_Game_Player_player_team_Factory final
{
public:
	struct FGame_Player_player_team               RetVal;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseFortniteInternal.Game_Player_fort_player_component._L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RGetUniqueID
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) Game_Player_fort_player_component__L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RGetUniqueID final
{
public:
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player_fort_player_component._L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RIsActive_L_N_Kchar_R
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) Game_Player_fort_player_component__L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RIsActive_L_N_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_Player_fort_player_component._L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RPopActiveState_L_N_Kchar_R
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) Game_Player_fort_player_component__L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RPopActiveState_L_N_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_Player_fort_player_component._L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RPushActiveState_L_N_Kchar_R
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) Game_Player_fort_player_component__L_2fFortnite_2ecom_2fGame_2fPlayer_2ffort__player__component_N_RPushActiveState_L_N_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_Player_player_start_component._L_2fFortnite_2ecom_2fGame_2fPlayer_2fplayer__start__component_N_RaddTags_L_N_K_Kchar_R
// 0x0010 (0x0010 - 0x0000)
struct Game_Player_player_start_component__L_2fFortnite_2ecom_2fGame_2fPlayer_2fplayer__start__component_N_RaddTags_L_N_K_Kchar_R final
{
public:
	TArray<FVerseStringProperty_>                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
};

// Function VerseFortniteInternal.Game_Player_player_start_component._L_2fFortnite_2ecom_2fGame_2fPlayer_2fplayer__start__component_N_RgetPosition
// 0x0020 (0x0020 - 0x0000)
struct Game_Player_player_start_component__L_2fFortnite_2ecom_2fGame_2fPlayer_2fplayer__start__component_N_RgetPosition final
{
public:
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseFortniteInternal.Game_Player_PlayerAttributes._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerAttributes_N_RAddToNumericAttribute_L_Nplayer_M_NPlayerAttribute_M_Nfloat_R
// 0x0018 (0x0018 - 0x0000)
struct Game_Player_PlayerAttributes__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerAttributes_N_RAddToNumericAttribute_L_Nplayer_M_NPlayerAttribute_M_Nfloat_R final
{
public:
	struct Ftuple_Lplayer_MPlayerAttribute_Mfloat_R __verse_0xB2CDDD72_Argument;                     // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player_PlayerAttributes._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerAttributes_N_RGetNumericAttributeValue_L_Nplayer_M_NPlayerAttribute_R
// 0x0018 (0x0018 - 0x0000)
struct Game_Player_PlayerAttributes__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerAttributes_N_RGetNumericAttributeValue_L_Nplayer_M_NPlayerAttribute_R final
{
public:
	struct Ftuple_Lplayer_MPlayerAttribute_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player_PlayerAttributes._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerAttributes_N_RModifyNumericAttribute_L_Nplayer_M_NPlayerAttribute_M_NPlayerAttributeOperation_M_Nfloat_R
// 0x0018 (0x0018 - 0x0000)
struct Game_Player_PlayerAttributes__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerAttributes_N_RModifyNumericAttribute_L_Nplayer_M_NPlayerAttribute_M_NPlayerAttributeOperation_M_Nfloat_R final
{
public:
	struct Ftuple_Lplayer_MPlayerAttribute_MPlayerAttributeOperation_Mfloat_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player_PlayerInventory._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInventory_N_RClearDroppableItems_L_Nplayer_R
// 0x0008 (0x0008 - 0x0000)
struct Game_Player_PlayerInventory__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInventory_N_RClearDroppableItems_L_Nplayer_R final
{
public:
	class USimulation_player*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player_PlayerInventory._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInventory_N_RRemoveFromInventory_L_Nplayer_M_N_Kchar_M_Nint_R
// 0x0028 (0x0028 - 0x0000)
struct Game_Player_PlayerInventory__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInventory_N_RRemoveFromInventory_L_Nplayer_M_N_Kchar_M_Nint_R final
{
public:
	struct Ftuple_Lplayer_M_Kchar_Mint_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0020(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_Player_PlayerInventory._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInventory_N_RTryAddItemToInventory_L_Nplayer_M_Nfort__item__definition_M_Nint_M_Nlogic_R
// 0x0028 (0x0028 - 0x0000)
struct Game_Player_PlayerInventory__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInventory_N_RTryAddItemToInventory_L_Nplayer_M_Nfort__item__definition_M_Nint_M_Nlogic_R final
{
public:
	struct Ftuple_Lplayer_Mfort__item__definition_Mint_Mlogic_R __verse_0xB2CDDD72_Argument;         // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0020(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player_PlayerInventory._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInventory_N_RTryAddToInventory_L_Nplayer_M_N_Kchar_M_Nint_M_Nlogic_R
// 0x0028 (0x0028 - 0x0000)
struct Game_Player_PlayerInventory__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInventory_N_RTryAddToInventory_L_Nplayer_M_N_Kchar_M_Nint_M_Nlogic_R final
{
public:
	struct Ftuple_Lplayer_M_Kchar_Mint_Mlogic_R   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0028)(Parm, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player_PlayerInvulnerable._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInvulnerable_N_RIsPlayerInvulnerable_L_Nplayer_R
// 0x0010 (0x0010 - 0x0000)
struct Game_Player_PlayerInvulnerable__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInvulnerable_N_RIsPlayerInvulnerable_L_Nplayer_R final
{
public:
	class USimulation_player*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player_PlayerInvulnerable._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInvulnerable_N_RSetPlayerInvulnerability_L_Nplayer_M_Nlogic_R
// 0x0010 (0x0010 - 0x0000)
struct Game_Player_PlayerInvulnerable__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerInvulnerable_N_RSetPlayerInvulnerability_L_Nplayer_M_Nlogic_R final
{
public:
	struct Ftuple_Lplayer_Mlogic_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player_PlayerSpectator._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RGetPlayersSpectatingTarget_L_Nplayer_R
// 0x0018 (0x0018 - 0x0000)
struct Game_Player_PlayerSpectator__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RGetPlayersSpectatingTarget_L_Nplayer_R final
{
public:
	class USimulation_player*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class USimulation_player*>             RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseFortniteInternal.Game_Player_PlayerSpectator._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RIsSpectator_L_Nplayer_R
// 0x0010 (0x0010 - 0x0000)
struct Game_Player_PlayerSpectator__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RIsSpectator_L_Nplayer_R final
{
public:
	class USimulation_player*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player_PlayerSpectator._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RSetSpectator_L_Nplayer_R
// 0x0010 (0x0010 - 0x0000)
struct Game_Player_PlayerSpectator__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RSetSpectator_L_Nplayer_R final
{
public:
	class USimulation_player*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player_PlayerSpectator._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RSpectateEliminator_L_Nplayer_R
// 0x0010 (0x0010 - 0x0000)
struct Game_Player_PlayerSpectator__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RSpectateEliminator_L_Nplayer_R final
{
public:
	class USimulation_player*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player_PlayerSpectator._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RSpectatePlayer_L_Nplayer_M_Nplayer_R
// 0x0018 (0x0018 - 0x0000)
struct Game_Player_PlayerSpectator__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerSpectator_N_RSpectatePlayer_L_Nplayer_M_Nplayer_R final
{
public:
	struct Ftuple_Lplayer_Mplayer_R               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player_PlayerStartComponent._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStartComponent_N_RfindAllInPlayspaceWithTags_L_Ncomponent_M_N_K_Kchar_R
// 0x0028 (0x0028 - 0x0000)
struct Game_Player_PlayerStartComponent__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStartComponent_N_RfindAllInPlayspaceWithTags_L_Ncomponent_M_N_K_Kchar_R final
{
public:
	struct Ftuple_Lcomponent_M_K_Kchar_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	TArray<class UGame_Player_player_start_component*> RetVal;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseFortniteInternal.Game_Player_PlayerStasis._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStasis_N_RPutInStasis_L_Nplayer_R
// 0x0008 (0x0008 - 0x0000)
struct Game_Player_PlayerStasis__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStasis_N_RPutInStasis_L_Nplayer_R final
{
public:
	class USimulation_player*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player_PlayerStasis._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStasis_N_RPutInStasisAdvanced_L_Nplayer_M_Nlogic_M_Nlogic_M_Nlogic_R
// 0x0010 (0x0010 - 0x0000)
struct Game_Player_PlayerStasis__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStasis_N_RPutInStasisAdvanced_L_Nplayer_M_Nlogic_M_Nlogic_M_Nlogic_R final
{
public:
	struct Ftuple_Lplayer_Mlogic_Mlogic_Mlogic_R  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player_PlayerStasis._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStasis_N_RReleaseFromStasis_L_Nplayer_R
// 0x0008 (0x0008 - 0x0000)
struct Game_Player_PlayerStasis__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStasis_N_RReleaseFromStasis_L_Nplayer_R final
{
public:
	class USimulation_player*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player_PlayerVisibility._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerVisibility_N_RSetIsHidden_L_Nplayer_M_Nlogic_R
// 0x0010 (0x0010 - 0x0000)
struct Game_Player_PlayerVisibility__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerVisibility_N_RSetIsHidden_L_Nplayer_M_Nlogic_R final
{
public:
	struct Ftuple_Lplayer_Mlogic_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetMatchStat_L_Nint_R
// 0x0010 (0x0010 - 0x0000)
struct Game_match_stats__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetMatchStat_L_Nint_R final
{
public:
	int64                                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetPlayerStat_L_Nplayer_M_Nint_R
// 0x0018 (0x0018 - 0x0000)
struct Game_match_stats__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetPlayerStat_L_Nplayer_M_Nint_R final
{
public:
	struct Ftuple_Lplayer_Mint_R                  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetTeamStat_L_Nplayer__team_M_Nint_R
// 0x0018 (0x0018 - 0x0000)
struct Game_match_stats__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RGetTeamStat_L_Nplayer__team_M_Nint_R final
{
public:
	struct Ftuple_Lplayer__team_Mint_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementMatchStat_L_Nint_M_Nint_R
// 0x0018 (0x0018 - 0x0000)
struct Game_match_stats__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementMatchStat_L_Nint_M_Nint_R final
{
public:
	struct VerseFortniteInternal_0::Ftuple_Lint_Mint_R __verse_0xB2CDDD72_Argument;                  // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementPlayerStat_L_Nplayer_M_Nint_M_Nint_R
// 0x0020 (0x0020 - 0x0000)
struct Game_match_stats__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementPlayerStat_L_Nplayer_M_Nint_M_Nint_R final
{
public:
	struct Ftuple_Lplayer_Mint_Mint_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementTeamStat_L_Nplayer__team_M_Nint_M_Nint_R
// 0x0020 (0x0020 - 0x0000)
struct Game_match_stats__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RIncrementTeamStat_L_Nplayer__team_M_Nint_M_Nint_R final
{
public:
	struct Ftuple_Lplayer__team_Mint_Mint_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RReset
// 0x0001 (0x0001 - 0x0000)
struct Game_match_stats__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RReset final
{
public:
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetMatchStat_L_Nint_M_Nint_R
// 0x0010 (0x0010 - 0x0000)
struct Game_match_stats__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetMatchStat_L_Nint_M_Nint_R final
{
public:
	struct VerseFortniteInternal_0::Ftuple_Lint_Mint_R __verse_0xB2CDDD72_Argument;                  // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetPlayerStat_L_Nplayer_M_Nint_M_Nint_R
// 0x0018 (0x0018 - 0x0000)
struct Game_match_stats__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetPlayerStat_L_Nplayer_M_Nint_M_Nint_R final
{
public:
	struct Ftuple_Lplayer_Mint_Mint_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_match_stats._L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetTeamStat_L_Nplayer__team_M_Nint_M_Nint_R
// 0x0018 (0x0018 - 0x0000)
struct Game_match_stats__L_2fFortnite_2ecom_2fGame_2fmatch__stats_N_RSetTeamStat_L_Nplayer__team_M_Nint_M_Nint_R final
{
public:
	struct Ftuple_Lplayer__team_Mint_Mint_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rbegin
// 0x0001 (0x0001 - 0x0000)
struct Game_StormController_storm_controller_component__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rbegin final
{
public:
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rend
// 0x0001 (0x0001 - 0x0000)
struct Game_StormController_storm_controller_component__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rend final
{
public:
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rexists
// 0x0002 (0x0002 - 0x0000)
struct Game_StormController_storm_controller_component__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rexists final
{
public:
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rpause
// 0x0001 (0x0001 - 0x0000)
struct Game_StormController_storm_controller_component__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rpause final
{
public:
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rreset
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) Game_StormController_storm_controller_component__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rreset final
{
public:
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
