#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseMovement_0

#include "Basic.hpp"

#include "VerseMovement_0_structs.hpp"
#include "VerseNative_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"


namespace SDK::Params
{

// Function VerseMovement.VerseMovement._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_N_RGetPlayerMoveComponent_L_Nplayer__component_R
// 0x0010 (0x0010 - 0x0000)
struct VerseMovement__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_N_RGetPlayerMoveComponent_L_Nplayer__component_R final
{
public:
	class USimulation_player_component*           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseMovement.VerseMovement.VerseMovement_move_config$Factory
// 0x0058 (0x0058 - 0x0000)
struct VerseMovement_VerseMovement_move_config_Factory final
{
public:
	struct FVerseMovement_move_config             RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	TArray<struct FVerseMovement_move_config_entry> _ExprResult_0;                                   // 0x0010(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_1;                        // 0x0020(0x0010)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_config_entry> _ForResult_1;                                    // 0x0030(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_2;                                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_3;                                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_3;                         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0051(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function VerseMovement.VerseMovement.VerseMovement_move_config_entry$Factory
// 0x00D0 (0x00D0 - 0x0000)
struct VerseMovement_VerseMovement_move_config_entry_Factory final
{
public:
	struct FVerseMovement_move_config_entry       RetVal;                                            // 0x0000(0x0030)(Parm, OutParm, ReturnParm)
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0030(0x0010)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>    _ExprResult_1;                                     // 0x0040(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_1;                        // 0x0050(0x0010)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_trigger>    _ForResult_2;                                      // 0x0060(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_3;                                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_4;                                      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_3;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_5 : 1;                                 // 0x0081(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVerseMovement_move_response>   _ExprResult_6;                                     // 0x0088(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_5;                        // 0x0098(0x0010)(ContainsInstancedReference)
	TArray<struct FVerseMovement_move_response>   _ForResult_7;                                      // 0x00A8(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_8;                                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_9;                                      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_7;                         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_10 : 1;                                // 0x00C9(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function VerseMovement.VerseMovement.VerseMovement_move_input_trigger_params$Factory
// 0x0068 (0x0068 - 0x0000)
struct VerseMovement_VerseMovement_move_input_trigger_params_Factory final
{
public:
	struct FVerseMovement_move_input_trigger_params RetVal;                                          // 0x0000(0x0038)(Parm, OutParm, ReturnParm)
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0038(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResult_1;                                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__1;                             // 0x0050(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_2 : 1;                                 // 0x0052(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_3;                                // 0x0053(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector2                   _ExprResult_4;                                     // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseMovement.VerseMovement.VerseMovement_move_physics_trigger_params$Factory
// 0x0030 (0x0030 - 0x0000)
struct VerseMovement_VerseMovement_move_physics_trigger_params_Factory final
{
public:
	struct FVerseMovement_move_physics_trigger_params RetVal;                                        // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_0;                                     // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseMovement.VerseMovement.VerseMovement_move_response$Factory
// 0x0090 (0x0090 - 0x0000)
struct VerseMovement_VerseMovement_move_response_Factory final
{
public:
	struct FVerseMovement_move_response           RetVal;                                            // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_0;                                     // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResult_1;                                     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__1;                             // 0x0070(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_2 : 1;                                 // 0x0072(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_3;                                // 0x0073(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   _ExprResult_4;                                     // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseMovement.VerseMovement.VerseMovement_move_trace_trigger_params$Factory
// 0x0060 (0x0060 - 0x0000)
struct VerseMovement_VerseMovement_move_trace_trigger_params_Factory final
{
public:
	struct FVerseMovement_move_trace_trigger_params RetVal;                                          // 0x0000(0x0038)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_0;                                     // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResult_1;                                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__1;                             // 0x0058(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_2 : 1;                                 // 0x005A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_3;                                // 0x005B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseMovement.VerseMovement.VerseMovement_move_trigger$Factory
// 0x0118 (0x0118 - 0x0000)
struct VerseMovement_VerseMovement_move_trigger_Factory final
{
public:
	struct FVerseMovement_move_trigger            RetVal;                                            // 0x0000(0x0090)(Parm, OutParm, ReturnParm)
	struct FVerseMovement_move_input_trigger_params _ExprResult_0;                                   // 0x0090(0x0038)()
	struct FVerseMovement_move_physics_trigger_params _ExprResult_1;                                 // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVerseMovement_move_trace_trigger_params _ExprResult_2;                                   // 0x00E0(0x0038)(NoDestructor)
};

// Function VerseMovement.VerseMovement_movement_component._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RAddAngularImpulse_L_Nvector3_R
// 0x0018 (0x0018 - 0x0000)
struct VerseMovement_movement_component__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RAddAngularImpulse_L_Nvector3_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseMovement.VerseMovement_movement_component._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RAddImpulse_L_Nvector3_R
// 0x0018 (0x0018 - 0x0000)
struct VerseMovement_movement_component__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RAddImpulse_L_Nvector3_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseMovement.VerseMovement_movement_component._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RDisableInput_L_Nplayer__component_R
// 0x0008 (0x0008 - 0x0000)
struct VerseMovement_movement_component__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RDisableInput_L_Nplayer__component_R final
{
public:
	class USimulation_player_component*           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseMovement.VerseMovement_movement_component._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_REnableInput_L_Nplayer__component_R
// 0x0008 (0x0008 - 0x0000)
struct VerseMovement_movement_component__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_REnableInput_L_Nplayer__component_R final
{
public:
	class USimulation_player_component*           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseMovement.VerseMovement_movement_component._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetConfig_L_Nmove__config__asset_R
// 0x0008 (0x0008 - 0x0000)
struct VerseMovement_movement_component__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetConfig_L_Nmove__config__asset_R final
{
public:
	class UVerseMovement_move_config_asset*       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseMovement.VerseMovement_movement_component._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetConfig_L_Nmove__config_R
// 0x0010 (0x0010 - 0x0000)
struct VerseMovement_movement_component__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetConfig_L_Nmove__config_R final
{
public:
	struct FVerseMovement_move_config             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm)
};

// Function VerseMovement.VerseMovement_movement_component._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetEnabled_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct VerseMovement_movement_component__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetEnabled_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseMovement.VerseMovement_movement_component._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetPosition_L_Nvector3_R
// 0x0018 (0x0018 - 0x0000)
struct VerseMovement_movement_component__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetPosition_L_Nvector3_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseMovement.VerseMovement_movement_component._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetRotation_L_Nrotation_R
// 0x0020 (0x0020 - 0x0000)
struct VerseMovement_movement_component__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetRotation_L_Nrotation_R final
{
public:
	struct FVerseRotation                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, NoDestructor)
};

// Function VerseMovement.VerseMovement_movement_component._L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetVelocity_L_Nvector3_R
// 0x0018 (0x0018 - 0x0000)
struct VerseMovement_movement_component__L_2fUnrealEngine_2ecom_2fEngine_2fVerseMovement_2fmovement__component_N_RSetVelocity_L_Nvector3_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseMovement.VerseMovement_VerseMovementUtil.$InitCDO
// 0x0D68 (0x0D68 - 0x0000)
struct VerseMovement_VerseMovementUtil__InitCDO final
{
public:
	struct FVerseMovement_move_config             _ExprResult_0;                                     // 0x0000(0x0010)()
	TArray<struct FVerseMovement_move_config_entry> _ExprResult_1;                                   // 0x0010(0x0010)(ContainsInstancedReference)
	struct FVerseMovement_move_config_entry       _ExprResult_2;                                     // 0x0020(0x0030)()
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0050(0x0010)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>    _ExprResult_4;                                     // 0x0060(0x0010)(ContainsInstancedReference)
	struct FVerseMovement_move_trigger            _ExprResult_5;                                     // 0x0070(0x0090)()
	struct FVerseMovement_move_input_trigger_params _ExprResult_6;                                   // 0x0100(0x0038)()
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0138(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResult_8;                                     // 0x0148(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__1;                             // 0x0150(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_9 : 1;                                 // 0x0152(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_10;                               // 0x0153(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector2                   _ExprResult_11;                                    // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FVerseMovement_move_response>   _ExprResult_12;                                    // 0x0168(0x0010)(ContainsInstancedReference)
	struct FVerseMovement_move_response           _ExprResult_13;                                    // 0x0178(0x0050)(NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_14;                                    // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResult_15;                                    // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__3;                             // 0x01E8(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_16 : 1;                                // 0x01EA(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_17;                               // 0x01EB(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   _ExprResult_18;                                    // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVerseMovement_move_config_entry       _ExprResult_19;                                    // 0x0208(0x0030)()
	FVerseStringProperty_                         _ExprResult_20;                                    // 0x0238(0x0010)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>    _ExprResult_21;                                    // 0x0248(0x0010)(ContainsInstancedReference)
	struct FVerseMovement_move_trigger            _ExprResult_22;                                    // 0x0258(0x0090)()
	struct FVerseMovement_move_input_trigger_params _ExprResult_23;                                  // 0x02E8(0x0038)()
	FVerseStringProperty_                         _ExprResult_24;                                    // 0x0320(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResult_25;                                    // 0x0330(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__5;                             // 0x0338(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_26 : 1;                                // 0x033A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_27;                               // 0x033B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector2                   _ExprResult_28;                                    // 0x0340(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FVerseMovement_move_response>   _ExprResult_29;                                    // 0x0350(0x0010)(ContainsInstancedReference)
	struct FVerseMovement_move_response           _ExprResult_30;                                    // 0x0360(0x0050)(NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_31;                                    // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResult_32;                                    // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__7;                             // 0x03D0(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_33 : 1;                                // 0x03D2(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_34;                               // 0x03D3(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D5[0x3];                                      // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   _ExprResult_35;                                    // 0x03D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVerseMovement_move_config_entry       _ExprResult_36;                                    // 0x03F0(0x0030)()
	FVerseStringProperty_                         _ExprResult_37;                                    // 0x0420(0x0010)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>    _ExprResult_38;                                    // 0x0430(0x0010)(ContainsInstancedReference)
	struct FVerseMovement_move_trigger            _ExprResult_39;                                    // 0x0440(0x0090)()
	struct FVerseMovement_move_input_trigger_params _ExprResult_40;                                  // 0x04D0(0x0038)()
	FVerseStringProperty_                         _ExprResult_41;                                    // 0x0508(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResult_42;                                    // 0x0518(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__9;                             // 0x0520(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_43 : 1;                                // 0x0522(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_44;                               // 0x0523(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_525[0x3];                                      // 0x0525(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector2                   _ExprResult_45;                                    // 0x0528(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVerseMovement_move_trigger            _ExprResult_46;                                    // 0x0538(0x0090)()
	struct FVerseMovement_move_trace_trigger_params _ExprResult_47;                                  // 0x05C8(0x0038)(NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_48;                                    // 0x0600(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResult_49;                                    // 0x0618(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__11;                            // 0x0620(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_50 : 1;                                // 0x0622(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_51;                               // 0x0623(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_625[0x3];                                      // 0x0625(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVerseMovement_move_response>   _ExprResult_52;                                    // 0x0628(0x0010)(ContainsInstancedReference)
	struct FVerseMovement_move_response           _ExprResult_53;                                    // 0x0638(0x0050)(NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_54;                                    // 0x0688(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResult_55;                                    // 0x06A0(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__13;                            // 0x06A8(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_56 : 1;                                // 0x06AA(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_57;                               // 0x06AB(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AD[0x3];                                      // 0x06AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   _ExprResult_58;                                    // 0x06B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVerseMovement_move_config_entry       _ExprResult_59;                                    // 0x06C8(0x0030)()
	FVerseStringProperty_                         _ExprResult_60;                                    // 0x06F8(0x0010)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>    _ExprResult_61;                                    // 0x0708(0x0010)(ContainsInstancedReference)
	struct FVerseMovement_move_trigger            _ExprResult_62;                                    // 0x0718(0x0090)()
	struct FVerseMovement_move_input_trigger_params _ExprResult_63;                                  // 0x07A8(0x0038)()
	FVerseStringProperty_                         _ExprResult_64;                                    // 0x07E0(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResult_65;                                    // 0x07F0(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__15;                            // 0x07F8(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_66 : 1;                                // 0x07FA(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_67;                               // 0x07FB(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7FD[0x3];                                      // 0x07FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector2                   _ExprResult_68;                                    // 0x0800(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVerseMovement_move_trigger            _ExprResult_69;                                    // 0x0810(0x0090)()
	struct FVerseMovement_move_trace_trigger_params _ExprResult_70;                                  // 0x08A0(0x0038)(NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_71;                                    // 0x08D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResult_72;                                    // 0x08F0(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__17;                            // 0x08F8(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_73 : 1;                                // 0x08FA(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_74;                               // 0x08FB(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8FD[0x3];                                      // 0x08FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVerseMovement_move_response>   _ExprResult_75;                                    // 0x0900(0x0010)(ContainsInstancedReference)
	struct FVerseMovement_move_response           _ExprResult_76;                                    // 0x0910(0x0050)(NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_77;                                    // 0x0960(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResult_78;                                    // 0x0978(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__19;                            // 0x0980(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_79 : 1;                                // 0x0982(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_80;                               // 0x0983(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_985[0x3];                                      // 0x0985(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   _ExprResult_81;                                    // 0x0988(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVerseMovement_move_config_entry       _ExprResult_82;                                    // 0x09A0(0x0030)()
	FVerseStringProperty_                         _ExprResult_83;                                    // 0x09D0(0x0010)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>    _ExprResult_84;                                    // 0x09E0(0x0010)(ContainsInstancedReference)
	struct FVerseMovement_move_trigger            _ExprResult_85;                                    // 0x09F0(0x0090)()
	struct FVerseMovement_move_input_trigger_params _ExprResult_86;                                  // 0x0A80(0x0038)()
	FVerseStringProperty_                         _ExprResult_87;                                    // 0x0AB8(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResult_88;                                    // 0x0AC8(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__21;                            // 0x0AD0(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_89 : 1;                                // 0x0AD2(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_90;                               // 0x0AD3(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD5[0x3];                                      // 0x0AD5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector2                   _ExprResult_91;                                    // 0x0AD8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FVerseMovement_move_response>   _ExprResult_92;                                    // 0x0AE8(0x0010)(ContainsInstancedReference)
	struct FVerseMovement_move_response           _ExprResult_93;                                    // 0x0AF8(0x0050)(NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_94;                                    // 0x0B48(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResult_95;                                    // 0x0B60(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__23;                            // 0x0B68(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_96 : 1;                                // 0x0B6A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_97;                               // 0x0B6B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B6D[0x3];                                      // 0x0B6D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   _ExprResult_98;                                    // 0x0B70(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVerseMovement_move_config_entry       _ExprResult_99;                                    // 0x0B88(0x0030)()
	FVerseStringProperty_                         _ExprResult_100;                                   // 0x0BB8(0x0010)(HasGetValueTypeHash)
	TArray<struct FVerseMovement_move_trigger>    _ExprResult_101;                                   // 0x0BC8(0x0010)(ContainsInstancedReference)
	struct FVerseMovement_move_trigger            _ExprResult_102;                                   // 0x0BD8(0x0090)()
	struct FVerseMovement_move_trace_trigger_params _ExprResult_103;                                 // 0x0C68(0x0038)(NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_104;                                   // 0x0CA0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResult_105;                                   // 0x0CB8(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__25;                            // 0x0CC0(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_106 : 1;                               // 0x0CC2(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_107;                              // 0x0CC3(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC5[0x3];                                      // 0x0CC5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVerseMovement_move_response>   _ExprResult_108;                                   // 0x0CC8(0x0010)(ContainsInstancedReference)
	struct FVerseMovement_move_response           _ExprResult_109;                                   // 0x0CD8(0x0050)(NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_110;                                   // 0x0D28(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResult_111;                                   // 0x0D40(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__27;                            // 0x0D48(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_112 : 1;                               // 0x0D4A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_113;                              // 0x0D4B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4D[0x3];                                      // 0x0D4D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   _ExprResult_114;                                   // 0x0D50(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

