#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Verse

#include "Basic.hpp"


namespace SDK
{

// VerseStruct Verse.Colors_color
// 0x0018 (0x0018 - 0x0000)
struct FColors_color final
{
public:
	double                                        __verse_0x35184040_R;                              // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x98BF8727_G;                              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xAA4F5910_B;                              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct Verse.tuple_L_K_Kchar_M_Kchar_R
// 0x0020 (0x0020 - 0x0000)
struct Ftuple_L_K_Kchar_M_Kchar_R final
{
public:
	TArray<FVerseStringProperty_>                 __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct Verse.tuple_L_Kany_M_Kany_R
// 0x0020 (0x0020 - 0x0000)
struct Ftuple_L_Kany_M_Kany_R final
{
public:
	TArray<FVerseDynamicProperty_>                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
	TArray<FVerseDynamicProperty_>                __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(InstancedReference, ContainsInstancedReference)
};

// VerseStruct Verse.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct Verse::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct Verse.tuple_L_Kany_Mtuple_L_R_Many_R
// 0x0028 (0x0028 - 0x0000)
struct Ftuple_L_Kany_Mtuple_L_R_Many_R final
{
public:
	TArray<FVerseDynamicProperty_>                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
	struct Verse::Ftuple_L_R                      __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0001)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        __verse_0x932BF92E_Elem2;                          // 0x0018(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct Verse.tuple_Lint_M_Kany_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lint_M_Kany_R final
{
public:
	int64                                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference, ContainsInstancedReference)
};

// VerseStruct Verse.tuple_L_Kany_Mtuple_L_R_Mint_R
// 0x0020 (0x0020 - 0x0000)
struct Ftuple_L_Kany_Mtuple_L_R_Mint_R final
{
public:
	TArray<FVerseDynamicProperty_>                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
	struct Verse::Ftuple_L_R                      __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0001)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         __verse_0x932BF92E_Elem2;                          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct Verse.Verse_locale
// 0x0001 (0x0001 - 0x0000)
struct FVerse_locale final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// VerseStruct Verse.tuple_L_Kany_Mtuple_L_R_Mtuple_L_Kany_M_Kany_R_R
// 0x0038 (0x0038 - 0x0000)
struct Ftuple_L_Kany_Mtuple_L_R_Mtuple_L_Kany_M_Kany_R_R final
{
public:
	TArray<FVerseDynamicProperty_>                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
	struct Verse::Ftuple_L_R                      __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0001)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct Ftuple_L_Kany_M_Kany_R                 __verse_0x932BF92E_Elem2;                          // 0x0018(0x0020)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct Verse.tuple_Lany_Many_R
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) Ftuple_Lany_Many_R final
{
public:
	FVerseDynamicProperty_                        __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseDynamicProperty_                        __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct Verse.tuple_L_Kany_Mtuple_L_R_Mtuple_Lany_Many_R_R
// 0x0038 (0x0038 - 0x0000)
struct Ftuple_L_Kany_Mtuple_L_R_Mtuple_Lany_Many_R_R final
{
public:
	TArray<FVerseDynamicProperty_>                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
	struct Verse::Ftuple_L_R                      __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0001)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct Ftuple_Lany_Many_R                     __verse_0x932BF92E_Elem2;                          // 0x0018(0x0020)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct Verse.tuple_L_Kany_Mtuple_L_R_Mtuple_Lint_M_Kany_R_R
// 0x0030 (0x0030 - 0x0000)
struct Ftuple_L_Kany_Mtuple_L_R_Mtuple_Lint_M_Kany_R_R final
{
public:
	TArray<FVerseDynamicProperty_>                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
	struct Verse::Ftuple_L_R                      __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0001)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct Ftuple_Lint_M_Kany_R                   __verse_0x932BF92E_Elem2;                          // 0x0018(0x0018)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct Verse.tuple_Lint_Many_R
// 0x0018 (0x0018 - 0x0000)
struct Verse::Ftuple_Lint_Many_R final
{
public:
	int64                                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct Verse.tuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Many_R_R
// 0x0030 (0x0030 - 0x0000)
struct Ftuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Many_R_R final
{
public:
	TArray<FVerseDynamicProperty_>                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
	struct Verse::Ftuple_L_R                      __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0001)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct Verse::Ftuple_Lint_Many_R              __verse_0x932BF92E_Elem2;                          // 0x0018(0x0018)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct Verse.tuple_Lint_Mcolor_R
// 0x0020 (0x0020 - 0x0000)
struct Ftuple_Lint_Mcolor_R final
{
public:
	int64                                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColors_color                          __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
};

// VerseStruct Verse.tuple_Lint_Mint_R
// 0x0010 (0x0010 - 0x0000)
struct Verse::Ftuple_Lint_Mint_R final
{
public:
	int64                                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct Verse.tuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Mint_R_R
// 0x0028 (0x0028 - 0x0000)
struct Ftuple_L_Kany_Mtuple_L_R_Mtuple_Lint_Mint_R_R final
{
public:
	TArray<FVerseDynamicProperty_>                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
	struct Verse::Ftuple_L_R                      __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0001)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct Verse::Ftuple_Lint_Mint_R              __verse_0x932BF92E_Elem2;                          // 0x0018(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct Verse.tuple_Ltype_7b0_7d_Mint_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Ltype_7b0_7d_Mint_R final
{
public:
	int64                                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct Verse.tuple_L_Kany_Mtuple_L_R_Mtuple_Ltype_7b0_7d_Mint_R_R
// 0x0028 (0x0028 - 0x0000)
struct Ftuple_L_Kany_Mtuple_L_R_Mtuple_Ltype_7b0_7d_Mint_R_R final
{
public:
	TArray<FVerseDynamicProperty_>                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
	struct Verse::Ftuple_L_R                      __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0001)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct Ftuple_Ltype_7b0_7d_Mint_R             __verse_0x932BF92E_Elem2;                          // 0x0018(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct Verse.tuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R
// 0x0070 (0x0070 - 0x0000)
struct Verse::Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UObject*>   __verse_0x932BF92E_Elem2;                          // 0x0020(0x0050)(InstancedReference, ContainsInstancedReference)
};

// VerseStruct Verse.tuple_L_Kchar_M_Kchar_R
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) Verse::Ftuple_L_Kchar_M_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct Verse.tuple_L_Kchar_M_Kchar_M_Ktuple_L_Kchar_M_Kchar_R_Mlocale_R
// 0x0038 (0x0038 - 0x0000)
struct Ftuple_L_Kchar_M_Kchar_M_Ktuple_L_Kchar_M_Kchar_R_Mlocale_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
	TArray<struct Verse::Ftuple_L_Kchar_M_Kchar_R> __verse_0x932BF92E_Elem2;                         // 0x0020(0x0010)(InstancedReference, ContainsInstancedReference)
	struct FVerse_locale                          __verse_0xF64C4596_Elem3;                          // 0x0030(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
};

// VerseStruct Verse.tuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R
// 0x0010 (0x0010 - 0x0000)
struct Verse::Ftuple_Lfloat_Mtuple_L_R_Mtuple_L_R_R final
{
public:
	double                                        __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct Verse::Ftuple_L_R                      __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(InstancedReference, HasGetValueTypeHash)
	struct Verse::Ftuple_L_R                      __verse_0x932BF92E_Elem2;                          // 0x0009(0x0001)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct Verse.tuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) Verse::Ftuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0009)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              __verse_0x932BF92E_Elem2;                          // 0x0020(0x0019)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};

// VerseStruct Verse.tuple_L_Kchar_M_QWhere_Nlocale_R
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) Ftuple_L_Kchar_M_QWhere_Nlocale_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0002)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};

// VerseStruct Verse.tuple_Lcolor_Mcolor_R
// 0x0030 (0x0030 - 0x0000)
struct Ftuple_Lcolor_Mcolor_R final
{
public:
	struct FColors_color                          __verse_0x18E3F084_Elem0;                          // 0x0000(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x7D844C3C_Elem1;                          // 0x0018(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
};

// VerseStruct Verse.tuple_Lcolor_Mfloat_R
// 0x0020 (0x0020 - 0x0000)
struct Ftuple_Lcolor_Mfloat_R final
{
public:
	struct FColors_color                          __verse_0x18E3F084_Elem0;                          // 0x0000(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	double                                        __verse_0x7D844C3C_Elem1;                          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct Verse.tuple_Lcolor_Mint_R
// 0x0020 (0x0020 - 0x0000)
struct Ftuple_Lcolor_Mint_R final
{
public:
	struct FColors_color                          __verse_0x18E3F084_Elem0;                          // 0x0000(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	int64                                         __verse_0x7D844C3C_Elem1;                          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct Verse.tuple_Lfloat_M_QWhere_Nlocale_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lfloat_M_QWhere_Nlocale_R final
{
public:
	double                                        __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0002)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};

// VerseStruct Verse.tuple_Lfloat_Mcolor_R
// 0x0020 (0x0020 - 0x0000)
struct Ftuple_Lfloat_Mcolor_R final
{
public:
	double                                        __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColors_color                          __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
};

// VerseStruct Verse.tuple_Lfloat_Mfloat_Mfloat_R
// 0x0018 (0x0018 - 0x0000)
struct Verse::Ftuple_Lfloat_Mfloat_Mfloat_R final
{
public:
	double                                        __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct Verse.tuple_Lfloat_Mfloat_R
// 0x0010 (0x0010 - 0x0000)
struct Verse::Ftuple_Lfloat_Mfloat_R final
{
public:
	double                                        __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct Verse.tuple_Lfloat_Mtuple_L_R_Mfloat_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lfloat_Mtuple_L_R_Mfloat_R final
{
public:
	double                                        __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct Verse::Ftuple_L_R                      __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct Verse.tuple_Lint_M_QWhere_Nlocale_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lint_M_QWhere_Nlocale_R final
{
public:
	int64                                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0002)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};

// VerseStruct Verse.tuple_Lint_Mint_Mint_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lint_Mint_Mint_R final
{
public:
	int64                                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

