#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseAIBase

#include "Basic.hpp"

#include "FortniteAI_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EntityCore_classes.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class VerseAIBase.AIActionsHandlerComponent
// 0x0030 (0x00D0 - 0x00A0)
class UAIActionsHandlerComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x30];                                      // 0x00A0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIActionsHandlerComponent">();
	}
	static class UAIActionsHandlerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIActionsHandlerComponent>();
	}
};

// Class VerseAIBase.AIComponent
// 0x0018 (0x0098 - 0x0080)
class UAIComponent : public UEntityEnableableComponent
{
public:
	class AFortPawn*                              CachedPawn;                                        // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AAIController*                          CachedAIController;                                // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnControllerEndPlay(class AActor* InSource, EEndPlayReason Reason);
	void OnPossessedPawnChanged(class APawn* OldPawn, class APawn* NewPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIComponent">();
	}
	static class UAIComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIComponent>();
	}
};

// Class VerseAIBase.AIActionsComponent
// 0x0020 (0x00B8 - 0x0098)
class UAIActionsComponent : public UAIComponent
{
public:
	uint8                                         Pad_98[0x20];                                      // 0x0098(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIActionsComponent">();
	}
	static class UAIActionsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIActionsComponent>();
	}
};

// Class VerseAIBase.AIBehaviorScript
// 0x0010 (0x0090 - 0x0080)
class UAIBehaviorScript : public UEntityEnableableComponent
{
public:
	uint8                                         Pad_80[0x10];                                      // 0x0080(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnControllerEndPlay(class AActor* InSource, EEndPlayReason Reason);
	void OnPossessedPawnChanged(class APawn* OldPawn, class APawn* NewPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIBehaviorScript">();
	}
	static class UAIBehaviorScript* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIBehaviorScript>();
	}
};

// Class VerseAIBase.AIBehaviorScriptComponent
// 0x0008 (0x00A8 - 0x00A0)
class UAIBehaviorScriptComponent final : public UActorComponent
{
public:
	class UAIBehaviorScript*                      AIBehaviorScript;                                  // 0x00A0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UAIBehaviorScript* GetBehaviorScript();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIBehaviorScriptComponent">();
	}
	static class UAIBehaviorScriptComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIBehaviorScriptComponent>();
	}
};

// Class VerseAIBase.FortAthenaAISpawnerDataComponent_Verse
// 0x0020 (0x0050 - 0x0030)
class UFortAthenaAISpawnerDataComponent_Verse final : public UFortAthenaAISpawnerDataComponent_ScriptBase
{
public:
	TArray<TSubclassOf<class UEntityComponent>>   EntityComponents;                                  // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class UEntityComponent>> EntityComponentInstances;                         // 0x0040(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	void AddUniqueEntityComponent(TSubclassOf<class UEntityComponent> EntityComponent);
	void AddUniqueEntityComponentInstance(class UEntityComponent* EntityComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAISpawnerDataComponent_Verse">();
	}
	static class UFortAthenaAISpawnerDataComponent_Verse* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAISpawnerDataComponent_Verse>();
	}
};

// Class VerseAIBase.VerseAISpawner
// 0x0088 (0x0F90 - 0x0F08)
class AVerseAISpawner final : public AFortCreativeDeviceProp
{
public:
	TArray<TSubclassOf<class UEntityScriptComponent>> VerseScriptComponents;                         // 0x0F08(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortAthenaAISpawnerData>   AISpawnerData;                                     // 0x0F18(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AFortPawn*>                      SpawnedList;                                       // 0x0F20(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UFortMinigameProgressComponent*         MinigameProgress;                                  // 0x0F30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAISpawnerUtilityComponent*         AISpawnerUtilityComponent;                         // 0x0F38(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortActorOptionsComponent*             OptionsComponent;                                  // 0x0F40(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UEnvQuery>               SpawnEQSQuery;                                     // 0x0F48(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F70[0x20];                                     // 0x0F70(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InternalOnAIDied(class AController* KilledController, bool bIsABot, class AFortPawn* KilledAIPawn, class AFortPlayerPawn* KilledPlayerPawn, class AController* KillerController);
	void InternalOnSpawned(class APawn* Pawn, const int32 RequestID);
	void KillAllBots(const bool bForceDoNotDropLoot);
	void OnEQSFinished(const TArray<struct FVector>& QueryResultLocations);
	void OnPreSpawn(class UFortAthenaAISpawnerDataComponentList* ComponentList);
	void OnPropertiesLoaded();
	void OnSpawned(class AFortPawn* Pawn);
	void RequestSpawn();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAISpawner">();
	}
	static class AVerseAISpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVerseAISpawner>();
	}
};

}

