#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortniteInternal

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "EntityActor_classes.hpp"
#include "EntityCore_classes.hpp"
#include "VerseFortniteInternal_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class VerseFortniteInternal.FortAnimNotify_UEFNGameplayTag
// 0x0000 (0x0040 - 0x0040)
class UFortAnimNotify_UEFNGameplayTag final : public UFortAnimNotify_GameplayTag
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimNotify_UEFNGameplayTag">();
	}
	static class UFortAnimNotify_UEFNGameplayTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimNotify_UEFNGameplayTag>();
	}
};

// Class VerseFortniteInternal.FortGameplayAbility_PlayAnim
// 0x0010 (0x0B38 - 0x0B28)
class UFortGameplayAbility_PlayAnim : public UFortGameplayAbility
{
public:
	class UAnimMontage*                           MontageToPlay;                                     // 0x0B28(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayRate;                                          // 0x0B30(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B34[0x4];                                      // 0x0B34(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBlendOut(const struct FGameplayTag& NotifyTag);
	void OnCancelled(const struct FGameplayTag& NotifyTag);
	void OnCompleted(const struct FGameplayTag& NotifyTag);
	void OnInterrupted(const struct FGameplayTag& NotifyTag);
	void OnNotifyBegin(const struct FGameplayTag& NotifyTag);
	void OnNotifyEnd(const struct FGameplayTag& NotifyTag);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayAbility_PlayAnim">();
	}
	static class UFortGameplayAbility_PlayAnim* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayAbility_PlayAnim>();
	}
};

// Class VerseFortniteInternal.FortGameplayAbility_PlayAnimAndApplyEffect
// 0x0018 (0x0B50 - 0x0B38)
class UFortGameplayAbility_PlayAnimAndApplyEffect final : public UFortGameplayAbility_PlayAnim
{
public:
	bool                                          bWaitForAnimNotify;                                // 0x0B38(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B39[0x7];                                      // 0x0B39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            EffectToApply;                                     // 0x0B40(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTargetingPreset*                       TargetingPreset;                                   // 0x0B48(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayAbility_PlayAnimAndApplyEffect">();
	}
	static class UFortGameplayAbility_PlayAnimAndApplyEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayAbility_PlayAnimAndApplyEffect>();
	}
};

// Class VerseFortniteInternal.VerseFortniteAbilityComponentBase
// 0x0008 (0x0098 - 0x0090)
class UVerseFortniteAbilityComponentBase : public UEntityActorComponent
{
public:
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteAbilityComponentBase">();
	}
	static class UVerseFortniteAbilityComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteAbilityComponentBase>();
	}
};

// Class VerseFortniteInternal.BuildingActorEntityInteropComponent
// 0x0008 (0x0068 - 0x0060)
class UBuildingActorEntityInteropComponent final : public UEntityComponent
{
public:
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuildingActorEntityInteropComponent">();
	}
	static class UBuildingActorEntityInteropComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuildingActorEntityInteropComponent>();
	}
};

// Class VerseFortniteInternal.VerseFortniteMovementComponentBase
// 0x0000 (0x0090 - 0x0090)
class UVerseFortniteMovementComponentBase : public UEntityActorComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteMovementComponentBase">();
	}
	static class UVerseFortniteMovementComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteMovementComponentBase>();
	}
};

// Class VerseFortniteInternal.FortControllerStateHandlerComponent
// 0x0000 (0x00A0 - 0x00A0)
class UFortControllerStateHandlerComponent final : public UControllerComponent
{
public:
	void NotifyOfStateChange(class FString* State, bool Active);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortControllerStateHandlerComponent">();
	}
	static class UFortControllerStateHandlerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortControllerStateHandlerComponent>();
	}
};

// Class VerseFortniteInternal.FortAthenaMutator_BuildingSettings
// 0x0018 (0x0348 - 0x0330)
class AFortAthenaMutator_BuildingSettings final : public AFortAthenaMutator
{
public:
	uint8                                         Pad_330[0x18];                                     // 0x0330(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_BuildingSettings">();
	}
	static class AFortAthenaMutator_BuildingSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_BuildingSettings>();
	}
};

// Class VerseFortniteInternal.FortBuildingSettingsComponentBase
// 0x0010 (0x0090 - 0x0080)
class UFortBuildingSettingsComponentBase : public UEntityEnableableComponent
{
public:
	class AFortAthenaMutator_BuildingSettings*    Mutator;                                           // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPlayerSettingStateInternal                   Building;                                          // 0x0088(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPlayerSettingStateInternal                   BuildingOnWater;                                   // 0x0089(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPlayerSettingStateInternal                   Editing;                                           // 0x008A(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPlayerSettingStateInternal                   EditingHostile;                                    // 0x008B(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPlayerSettingStateInternal                   TrapPlacement;                                     // 0x008C(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_Settings();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBuildingSettingsComponentBase">();
	}
	static class UFortBuildingSettingsComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBuildingSettingsComponentBase>();
	}
};

// Class VerseFortniteInternal.FortPlayspaceComponentHelper
// 0x0008 (0x0030 - 0x0028)
class UFortPlayspaceComponentHelper final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandlePlayerDied(class AFortPlayerPawnAthena* FortPlayerPawnAthena);
	void HandlePlayerPawnPossessed(class APawn* Pawn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayspaceComponentHelper">();
	}
	static class UFortPlayspaceComponentHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayspaceComponentHelper>();
	}
};

// Class VerseFortniteInternal.VerseFortniteEntitySubsystem
// 0x0010 (0x0040 - 0x0030)
class UVerseFortniteEntitySubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteEntitySubsystem">();
	}
	static class UVerseFortniteEntitySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteEntitySubsystem>();
	}
};

}

