#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseAIBase_0

#include "Basic.hpp"

#include "VerseAIBase_0_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"


namespace SDK::Params
{

// Function VerseAIBase.VerseAIBase_fort_navigation_interface.MoveInRangeToAttack
// 0x0028 (0x0028 - 0x0000)
struct VerseAIBase_fort_navigation_interface_MoveInRangeToAttack final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_navigation_interface.RoamAround
// 0x0028 (0x0028 - 0x0000)
struct VerseAIBase_fort_navigation_interface_RoamAround final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.task_VerseAIBase_fort_character_actions_interface$LootObject_L_Nfort__loot__info_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseAIBase_fort_character_actions_interface_LootObject_L_Nfort__loot__info_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAIBase.task_VerseAIBase_fort_character_actions_interface$AttackObstacle_L_Nfort__obstacle__info_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseAIBase_fort_character_actions_interface_AttackObstacle_L_Nfort__obstacle__info_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAIBase.task_VerseAIBase_fort_character_actions_interface$LookAt_L_Nvector3_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseAIBase_fort_character_actions_interface_LookAt_L_Nvector3_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAIBase.task_VerseAIBase_ai_behavior$OnBegin.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseAIBase_ai_behavior_OnBegin_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAIBase.task_VerseAIBase_fort_character_actions_interface$PlayRandomEmote.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseAIBase_fort_character_actions_interface_PlayRandomEmote_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAIBase.task_VerseAIBase_fort_character_actions_interface$AttackThreat_L_Nfort__threat__info_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseAIBase_fort_character_actions_interface_AttackThreat_L_Nfort__threat__info_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAIBase.task_VerseAIBase_fort_character_actions_interface$Idle_L_Nfloat_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseAIBase_fort_character_actions_interface_Idle_L_Nfloat_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAIBase.task_VerseAIBase_fort_character_actions_interface$Revive_L_Nagent_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseAIBase_fort_character_actions_interface_Revive_L_Nagent_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_item_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__item__interface_N_RHasTag_L_Nfort__item__descriptor_M_Nfort__item__tag_R
// 0x0028 (0x0028 - 0x0000)
struct VerseAIBase_fort_item_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__item__interface_N_RHasTag_L_Nfort__item__descriptor_M_Nfort__item__tag_R final
{
public:
	struct VerseAIBase_0::Ftuple_Lfort__item__descriptor_Mfort__item__tag_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0020(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Crouch.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseAIBase_fort_character_movement_interface_Crouch_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Jump.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseAIBase_fort_character_movement_interface_Jump_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Slide.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseAIBase_fort_character_movement_interface_Slide_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Sprint.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseAIBase_fort_character_movement_interface_Sprint_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAIBase.task_VerseAIBase_fort_character_movement_interface$TacticalSprint.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseAIBase_fort_character_movement_interface_TacticalSprint_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Walk.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseAIBase_fort_character_movement_interface_Walk_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAIBase.task_VerseAIBase_fort_navigation_interface$MoveInRangeToAttack.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseAIBase_fort_navigation_interface_MoveInRangeToAttack_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAIBase.task_VerseAIBase_fort_navigation_interface$RoamAround.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseAIBase_fort_navigation_interface_RoamAround_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAIBase.task_VerseAIBase_navigation_interface$NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseAIBase_navigation_interface_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_RGetThreatLocation_L_Nfort__threat__info_R
// 0x0048 (0x0048 - 0x0000)
struct VerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_RGetThreatLocation_L_Nfort__threat__info_R final
{
public:
	struct FVerseAIBase_fort_threat_info          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, NoDestructor)
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_RMakeNavigationTarget_L_Nagent_R
// 0x0018 (0x0018 - 0x0000)
struct VerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_RMakeNavigationTarget_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        InstancingGraph;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseAIBase_navigation_target*         __verse_0xB482F2DD_CurrentlyInstantiatedObject;    // 0x0010(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_RMakeNavigationTarget_L_Nfort__loot__info_R
// 0x0038 (0x0038 - 0x0000)
struct VerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_RMakeNavigationTarget_L_Nfort__loot__info_R final
{
public:
	struct FVerseAIBase_fort_loot_info            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0028)(Parm, NoDestructor)
	uint64                                        InstancingGraph;                                   // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseAIBase_navigation_target*         __verse_0xB482F2DD_CurrentlyInstantiatedObject;    // 0x0030(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_RMakeNavigationTarget_L_Nfort__threat__info_R
// 0x0040 (0x0040 - 0x0000)
struct VerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_RMakeNavigationTarget_L_Nfort__threat__info_R final
{
public:
	struct FVerseAIBase_fort_threat_info          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, NoDestructor)
	uint64                                        InstancingGraph;                                   // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseAIBase_navigation_target*         __verse_0xB482F2DD_CurrentlyInstantiatedObject;    // 0x0038(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_RMakeNavigationTarget_L_Nvector3_R
// 0x0028 (0x0028 - 0x0000)
struct VerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_RMakeNavigationTarget_L_Nvector3_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint64                                        InstancingGraph;                                   // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseAIBase_navigation_target*         __verse_0xB482F2DD_CurrentlyInstantiatedObject;    // 0x0020(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortCharacterActions_U_L_Nfort__character_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct VerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortCharacterActions_U_L_Nfort__character_M_Ntuple_L_R_R final
{
public:
	struct VerseAIBase_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortCharacterMovement_U_L_Nfort__character_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct VerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortCharacterMovement_U_L_Nfort__character_M_Ntuple_L_R_R final
{
public:
	struct VerseAIBase_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortInventory_U_L_Nfort__character_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct VerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortInventory_U_L_Nfort__character_M_Ntuple_L_R_R final
{
public:
	struct VerseAIBase_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortLeash_U_L_Nfort__character_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct VerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortLeash_U_L_Nfort__character_M_Ntuple_L_R_R final
{
public:
	struct VerseAIBase_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortLootPerception_U_L_Nfort__character_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct VerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortLootPerception_U_L_Nfort__character_M_Ntuple_L_R_R final
{
public:
	struct VerseAIBase_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortNavigation_U_L_Nfort__character_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct VerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortNavigation_U_L_Nfort__character_M_Ntuple_L_R_R final
{
public:
	struct VerseAIBase_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortObstaclePerception_U_L_Nfort__character_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct VerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortObstaclePerception_U_L_Nfort__character_M_Ntuple_L_R_R final
{
public:
	struct VerseAIBase_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortThreatPerception_U_L_Nfort__character_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct VerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortThreatPerception_U_L_Nfort__character_M_Ntuple_L_R_R final
{
public:
	struct VerseAIBase_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortWeaponActions_U_L_Nfort__character_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct VerseAIBase__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortWeaponActions_U_L_Nfort__character_M_Ntuple_L_R_R final
{
public:
	struct VerseAIBase_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase.VerseAIBase_fort_item_descriptor$Factory
// 0x0018 (0x0018 - 0x0000)
struct VerseAIBase_VerseAIBase_fort_item_descriptor_Factory final
{
public:
	struct FVerseAIBase_fort_item_descriptor      RetVal;                                            // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseAIBase.VerseAIBase.VerseAIBase_fort_loot_info$Factory
// 0x0028 (0x0028 - 0x0000)
struct VerseAIBase_VerseAIBase_fort_loot_info_Factory final
{
public:
	struct FVerseAIBase_fort_loot_info            RetVal;                                            // 0x0000(0x0028)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseAIBase.VerseAIBase.VerseAIBase_fort_obstacle_info$Factory
// 0x0028 (0x0028 - 0x0000)
struct VerseAIBase_VerseAIBase_fort_obstacle_info_Factory final
{
public:
	struct FVerseAIBase_fort_obstacle_info        RetVal;                                            // 0x0000(0x0028)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseAIBase.VerseAIBase.VerseAIBase_fort_threat_info$Factory
// 0x0030 (0x0030 - 0x0000)
struct VerseAIBase_VerseAIBase_fort_threat_info_Factory final
{
public:
	struct FVerseAIBase_fort_threat_info          RetVal;                                            // 0x0000(0x0030)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseAIBase.VerseAIBase.VerseAIBase_fort_weapon_descriptor$Factory
// 0x0018 (0x0018 - 0x0000)
struct VerseAIBase_VerseAIBase_fort_weapon_descriptor_Factory final
{
public:
	struct FVerseAIBase_fort_weapon_descriptor    RetVal;                                            // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseAIBase.VerseAIBase_ai_behavior._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_RGetAgent
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) VerseAIBase_ai_behavior__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_RGetAgent final
{
public:
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_ai_behavior._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd
// 0x0001 (0x0001 - 0x0000)
struct VerseAIBase_ai_behavior__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd final
{
public:
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_ai_behavior.OnBegin
// 0x0028 (0x0028 - 0x0000)
struct VerseAIBase_ai_behavior_OnBegin final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_character_actions_interface.AttackObstacle_L_Nfort__obstacle__info_R
// 0x0048 (0x0048 - 0x0000)
struct VerseAIBase_fort_character_actions_interface_AttackObstacle_L_Nfort__obstacle__info_R final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_obstacle_info        __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0028)(Parm, NoDestructor)
	class UConcurrency_task*                      RetVal;                                            // 0x0040(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_character_actions_interface.AttackThreat_L_Nfort__threat__info_R
// 0x0050 (0x0050 - 0x0000)
struct VerseAIBase_fort_character_actions_interface_AttackThreat_L_Nfort__threat__info_R final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_threat_info          __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0030)(Parm, NoDestructor)
	class UConcurrency_task*                      RetVal;                                            // 0x0048(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_character_actions_interface.Idle_L_Nfloat_R
// 0x0028 (0x0028 - 0x0000)
struct VerseAIBase_fort_character_actions_interface_Idle_L_Nfloat_R final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_character_actions_interface.LookAt_L_Nvector3_R
// 0x0038 (0x0038 - 0x0000)
struct VerseAIBase_fort_character_actions_interface_LookAt_L_Nvector3_R final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UConcurrency_task*                      RetVal;                                            // 0x0030(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_character_actions_interface.LootObject_L_Nfort__loot__info_R
// 0x0048 (0x0048 - 0x0000)
struct VerseAIBase_fort_character_actions_interface_LootObject_L_Nfort__loot__info_R final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_loot_info            __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0028)(Parm, NoDestructor)
	class UConcurrency_task*                      RetVal;                                            // 0x0040(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_character_actions_interface.PlayRandomEmote
// 0x0028 (0x0028 - 0x0000)
struct VerseAIBase_fort_character_actions_interface_PlayRandomEmote final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_character_actions_interface.Revive_L_Nagent_R
// 0x0028 (0x0028 - 0x0000)
struct VerseAIBase_fort_character_actions_interface_Revive_L_Nagent_R final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_character_movement_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp
// 0x0002 (0x0002 - 0x0000)
struct VerseAIBase_fort_character_movement_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp final
{
public:
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    RetVal;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_character_movement_interface.Crouch
// 0x0028 (0x0028 - 0x0000)
struct VerseAIBase_fort_character_movement_interface_Crouch final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_character_movement_interface.Jump
// 0x0028 (0x0028 - 0x0000)
struct VerseAIBase_fort_character_movement_interface_Jump final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_character_movement_interface.Slide
// 0x0028 (0x0028 - 0x0000)
struct VerseAIBase_fort_character_movement_interface_Slide final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_character_movement_interface.Sprint
// 0x0028 (0x0028 - 0x0000)
struct VerseAIBase_fort_character_movement_interface_Sprint final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_character_movement_interface.TacticalSprint
// 0x0028 (0x0028 - 0x0000)
struct VerseAIBase_fort_character_movement_interface_TacticalSprint final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_character_movement_interface.Walk
// 0x0028 (0x0028 - 0x0000)
struct VerseAIBase_fort_character_movement_interface_Walk final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_inventory_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R
// 0x0030 (0x0030 - 0x0000)
struct VerseAIBase_fort_inventory_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R final
{
public:
	struct VerseAIBase_0::Ftuple_Lfort__inventory__item__asset_Mint_R __verse_0xB2CDDD72_Argument;   // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0019)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseAIBase.VerseAIBase_fort_inventory_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R
// 0x0020 (0x0020 - 0x0000)
struct VerseAIBase_fort_inventory_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R final
{
public:
	struct FVerseAIBase_fort_item_descriptor      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, NoDestructor)
	uint8                                         RetVal : 1;                                        // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseAIBase.VerseAIBase_fort_inventory_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R
// 0x0020 (0x0020 - 0x0000)
struct VerseAIBase_fort_inventory_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R final
{
public:
	struct FVerseAIBase_fort_item_descriptor      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, NoDestructor)
	FOptionProperty_                              RetVal;                                            // 0x0018(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_inventory_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems
// 0x0018 (0x0018 - 0x0000)
struct VerseAIBase_fort_inventory_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems final
{
public:
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVerseAIBase_fort_item_descriptor> RetVal;                                         // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseAIBase.VerseAIBase_fort_inventory_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) VerseAIBase_fort_inventory_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon final
{
public:
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0019)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseAIBase.VerseAIBase_fort_inventory_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R
// 0x0038 (0x0038 - 0x0000)
struct VerseAIBase_fort_inventory_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R final
{
public:
	struct FVerseAIBase_fort_item_descriptor      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, NoDestructor)
	FOptionProperty_                              RetVal;                                            // 0x0018(0x0019)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseAIBase.VerseAIBase_fort_inventory_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R
// 0x0020 (0x0020 - 0x0000)
struct VerseAIBase_fort_inventory_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R final
{
public:
	struct FVerseAIBase_fort_item_descriptor      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, NoDestructor)
	uint8                                         RetVal : 1;                                        // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseAIBase.VerseAIBase_fort_inventory_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R
// 0x0018 (0x0018 - 0x0000)
struct VerseAIBase_fort_inventory_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R final
{
public:
	FVerseFunctionProperty_                       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_inventory_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R
// 0x0008 (0x0008 - 0x0000)
struct VerseAIBase_fort_inventory_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R final
{
public:
	int64                                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_leash_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RClearLeash
// 0x0001 (0x0001 - 0x0000)
struct VerseAIBase_fort_leash_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RClearLeash final
{
public:
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_leash_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R
// 0x0018 (0x0018 - 0x0000)
struct VerseAIBase_fort_leash_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R final
{
public:
	struct VerseAIBase_0::Ftuple_Lagent_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument;                 // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_leash_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R
// 0x0028 (0x0028 - 0x0000)
struct VerseAIBase_fort_leash_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R final
{
public:
	struct VerseAIBase_0::Ftuple_Lvector3_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument;               // 0x0000(0x0028)(Parm, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_loot_perception_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RBestObjectTolootChangedEvent
// 0x0010 (0x0010 - 0x0000)
struct VerseAIBase_fort_loot_perception_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RBestObjectTolootChangedEvent final
{
public:
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_loot_perception_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RGetBestObjectToLoot
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) VerseAIBase_fort_loot_perception_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RGetBestObjectToLoot final
{
public:
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0029)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseAIBase.VerseAIBase_fort_obstacle_perception_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RGetObstacleInfo
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) VerseAIBase_fort_obstacle_perception_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RGetObstacleInfo final
{
public:
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0029)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseAIBase.VerseAIBase_fort_obstacle_perception_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RObstacleChangedEvent
// 0x0010 (0x0010 - 0x0000)
struct VerseAIBase_fort_obstacle_perception_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RObstacleChangedEvent final
{
public:
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_threat_perception_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatChangedEvent
// 0x0010 (0x0010 - 0x0000)
struct VerseAIBase_fort_threat_perception_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatChangedEvent final
{
public:
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_threat_perception_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatStatusChangedEvent
// 0x0010 (0x0010 - 0x0000)
struct VerseAIBase_fort_threat_perception_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatStatusChangedEvent final
{
public:
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAIBase.VerseAIBase_fort_threat_perception_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RForgetThreat_L_Nfort__threat__info_R
// 0x0030 (0x0030 - 0x0000)
struct VerseAIBase_fort_threat_perception_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RForgetThreat_L_Nfort__threat__info_R final
{
public:
	struct FVerseAIBase_fort_threat_info          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, NoDestructor)
};

// Function VerseAIBase.VerseAIBase_fort_threat_perception_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetCurrentThreatInfo
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) VerseAIBase_fort_threat_perception_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetCurrentThreatInfo final
{
public:
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0031)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseAIBase.VerseAIBase_fort_threat_perception_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetOrCreateThreatInfo_L_Nagent_M_Nlogic_R
// 0x0048 (0x0048 - 0x0000)
struct VerseAIBase_fort_threat_perception_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetOrCreateThreatInfo_L_Nagent_M_Nlogic_R final
{
public:
	struct VerseAIBase_0::Ftuple_Lagent_Mlogic_R  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0031)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseAIBase.VerseAIBase_fort_threat_perception_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetThreatInfo_L_Nagent_R
// 0x0040 (0x0040 - 0x0000)
struct VerseAIBase_fort_threat_perception_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetThreatInfo_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0031)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseAIBase.VerseAIBase_fort_threat_perception_interface._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetThreatsInfo
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) VerseAIBase_fort_threat_perception_interface__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetThreatsInfo final
{
public:
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
