#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseAIBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function VerseAIBase.AIComponent.OnControllerEndPlay
// 0x0010 (0x0010 - 0x0000)
struct AIComponent_OnControllerEndPlay final
{
public:
	class AActor*                                 InSource;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                Reason;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VerseAIBase.AIComponent.OnPossessedPawnChanged
// 0x0010 (0x0010 - 0x0000)
struct AIComponent_OnPossessedPawnChanged final
{
public:
	class APawn*                                  OldPawn;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseAIBase.AIBehaviorScript.OnControllerEndPlay
// 0x0010 (0x0010 - 0x0000)
struct AIBehaviorScript_OnControllerEndPlay final
{
public:
	class AActor*                                 InSource;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                Reason;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VerseAIBase.AIBehaviorScript.OnPossessedPawnChanged
// 0x0010 (0x0010 - 0x0000)
struct AIBehaviorScript_OnPossessedPawnChanged final
{
public:
	class APawn*                                  OldPawn;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseAIBase.AIBehaviorScriptComponent.GetBehaviorScript
// 0x0008 (0x0008 - 0x0000)
struct AIBehaviorScriptComponent_GetBehaviorScript final
{
public:
	class UAIBehaviorScript*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseAIBase.FortAthenaAISpawnerDataComponent_Verse.AddUniqueEntityComponent
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaAISpawnerDataComponent_Verse_AddUniqueEntityComponent final
{
public:
	TSubclassOf<class UEntityComponent>           EntityComponent;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseAIBase.FortAthenaAISpawnerDataComponent_Verse.AddUniqueEntityComponentInstance
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaAISpawnerDataComponent_Verse_AddUniqueEntityComponentInstance final
{
public:
	class UEntityComponent*                       EntityComponent;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseAIBase.VerseAISpawner.InternalOnAIDied
// 0x0028 (0x0028 - 0x0000)
struct VerseAISpawner_InternalOnAIDied final
{
public:
	class AController*                            KilledController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsABot;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              KilledAIPawn;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerPawn*                        KilledPlayerPawn;                                  // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                            KillerController;                                  // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseAIBase.VerseAISpawner.InternalOnSpawned
// 0x0010 (0x0010 - 0x0000)
struct VerseAISpawner_InternalOnSpawned final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RequestID;                                         // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VerseAIBase.VerseAISpawner.KillAllBots
// 0x0001 (0x0001 - 0x0000)
struct VerseAISpawner_KillAllBots final
{
public:
	bool                                          bForceDoNotDropLoot;                               // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseAIBase.VerseAISpawner.OnEQSFinished
// 0x0010 (0x0010 - 0x0000)
struct VerseAISpawner_OnEQSFinished final
{
public:
	TArray<struct FVector>                        QueryResultLocations;                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function VerseAIBase.VerseAISpawner.OnPreSpawn
// 0x0008 (0x0008 - 0x0000)
struct VerseAISpawner_OnPreSpawn final
{
public:
	class UFortAthenaAISpawnerDataComponentList*  ComponentList;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseAIBase.VerseAISpawner.OnSpawned
// 0x0008 (0x0008 - 0x0000)
struct VerseAISpawner_OnSpawned final
{
public:
	class AFortPawn*                              Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

