#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortniteInternal

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function VerseFortniteInternal.FortGameplayAbility_PlayAnim.OnBlendOut
// 0x0004 (0x0004 - 0x0000)
struct FortGameplayAbility_PlayAnim_OnBlendOut final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortniteInternal.FortGameplayAbility_PlayAnim.OnCancelled
// 0x0004 (0x0004 - 0x0000)
struct FortGameplayAbility_PlayAnim_OnCancelled final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortniteInternal.FortGameplayAbility_PlayAnim.OnCompleted
// 0x0004 (0x0004 - 0x0000)
struct FortGameplayAbility_PlayAnim_OnCompleted final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortniteInternal.FortGameplayAbility_PlayAnim.OnInterrupted
// 0x0004 (0x0004 - 0x0000)
struct FortGameplayAbility_PlayAnim_OnInterrupted final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortniteInternal.FortGameplayAbility_PlayAnim.OnNotifyBegin
// 0x0004 (0x0004 - 0x0000)
struct FortGameplayAbility_PlayAnim_OnNotifyBegin final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortniteInternal.FortGameplayAbility_PlayAnim.OnNotifyEnd
// 0x0004 (0x0004 - 0x0000)
struct FortGameplayAbility_PlayAnim_OnNotifyEnd final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortniteInternal.FortControllerStateHandlerComponent.NotifyOfStateChange
// 0x0018 (0x0018 - 0x0000)
struct FortControllerStateHandlerComponent_NotifyOfStateChange final
{
public:
	class FString                                 State;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Active;                                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VerseFortniteInternal.FortPlayspaceComponentHelper.HandlePlayerDied
// 0x0008 (0x0008 - 0x0000)
struct FortPlayspaceComponentHelper_HandlePlayerDied final
{
public:
	class AFortPlayerPawnAthena*                  FortPlayerPawnAthena;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VerseFortniteInternal.FortPlayspaceComponentHelper.HandlePlayerPawnPossessed
// 0x0008 (0x0008 - 0x0000)
struct FortPlayspaceComponentHelper_HandlePlayerPawnPossessed final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

