#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VGameplayRst_0

#include "Basic.hpp"

#include "VGameplayRst_0_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"
#include "Verse_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function VGameplayRst.VGameplayRst_Transform_positionable._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fpositionable_N_RGetPosition
// 0x0020 (0x0020 - 0x0000)
struct VGameplayRst_Transform_positionable__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fpositionable_N_RGetPosition final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VGameplayRst.task_VGameplayRst_Physics_collision_component$WaitEndOverlap.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VGameplayRst_Physics_collision_component_WaitEndOverlap_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.task_VGameplayRst_Components_dynamic_activation_component$WaitForTransitionBegin.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VGameplayRst_Components_dynamic_activation_component_WaitForTransitionBegin_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.task_VGameplayRst_Physics_collision_component$WaitHit.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VGameplayRst_Physics_collision_component_WaitHit_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.task_VGameplayRst_Components_dynamic_activation_component$WaitForTransitionComplete.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VGameplayRst_Components_dynamic_activation_component_WaitForTransitionComplete_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.task_VGameplayRst_Physics_physics_trace$WaitPhysicsTrace.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VGameplayRst_Physics_physics_trace_WaitPhysicsTrace_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.task_VGameplayRst_Messaging_debug_command_component$__WaitForCommand_L_N_Kchar_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VGameplayRst_Messaging_debug_command_component___WaitForCommand_L_N_Kchar_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.task_VGameplayRst_Physics_collision_component$WaitBeginOverlap.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VGameplayRst_Physics_collision_component_WaitBeginOverlap_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Lights_point_light_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fLights_2fpoint__light__component_N_RGetAttenuationRadius
// 0x0010 (0x0010 - 0x0000)
struct VGameplayRst_Lights_point_light_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fLights_2fpoint__light__component_N_RGetAttenuationRadius final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Lights_point_light_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fLights_2fpoint__light__component_N_RGetColor
// 0x0020 (0x0020 - 0x0000)
struct VGameplayRst_Lights_point_light_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fLights_2fpoint__light__component_N_RGetColor final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColors_color                          RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VGameplayRst.VGameplayRst_Lights_point_light_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fLights_2fpoint__light__component_N_RGetIntensity
// 0x0010 (0x0010 - 0x0000)
struct VGameplayRst_Lights_point_light_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fLights_2fpoint__light__component_N_RGetIntensity final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Lights_point_light_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fLights_2fpoint__light__component_N_RGetSourceLength
// 0x0010 (0x0010 - 0x0000)
struct VGameplayRst_Lights_point_light_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fLights_2fpoint__light__component_N_RGetSourceLength final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Lights_point_light_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fLights_2fpoint__light__component_N_RGetSourceRadius
// 0x0010 (0x0010 - 0x0000)
struct VGameplayRst_Lights_point_light_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fLights_2fpoint__light__component_N_RGetSourceRadius final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Lights_point_light_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fLights_2fpoint__light__component_N_RSetAttenuationRadius_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct VGameplayRst_Lights_point_light_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fLights_2fpoint__light__component_N_RSetAttenuationRadius_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Lights_point_light_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fLights_2fpoint__light__component_N_RSetColor_L_Ncolor_R
// 0x0018 (0x0018 - 0x0000)
struct VGameplayRst_Lights_point_light_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fLights_2fpoint__light__component_N_RSetColor_L_Ncolor_R final
{
public:
	struct FColors_color                          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VGameplayRst.VGameplayRst_Lights_point_light_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fLights_2fpoint__light__component_N_RSetIntensity_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct VGameplayRst_Lights_point_light_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fLights_2fpoint__light__component_N_RSetIntensity_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Lights_point_light_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fLights_2fpoint__light__component_N_RSetSourceLength_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct VGameplayRst_Lights_point_light_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fLights_2fpoint__light__component_N_RSetSourceLength_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Lights_point_light_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fLights_2fpoint__light__component_N_RSetSourceRadius_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct VGameplayRst_Lights_point_light_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fLights_2fpoint__light__component_N_RSetSourceRadius_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Audio_audio_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fAudio_2faudio__component_N_RBeginSound
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Audio_audio_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fAudio_2faudio__component_N_RBeginSound final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Audio_audio_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fAudio_2faudio__component_N_REndSound
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Audio_audio_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fAudio_2faudio__component_N_REndSound final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Audio_audio_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fAudio_2faudio__component_N_RSetSound_L_Nsound_R
// 0x0008 (0x0008 - 0x0000)
struct VGameplayRst_Audio_audio_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fAudio_2faudio__component_N_RSetSound_L_Nsound_R final
{
public:
	class UAssets_sound*                          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Geometry_skeletal_mesh_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RBeginAnimation_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RBeginAnimation_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};

// Function VGameplayRst.VGameplayRst_Geometry_skeletal_mesh_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_REndAnimation
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_REndAnimation final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Geometry_skeletal_mesh_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPlayRate__FIXME
// 0x0010 (0x0010 - 0x0000)
struct VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPlayRate__FIXME final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Geometry_skeletal_mesh_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPosition__FIXME
// 0x0010 (0x0010 - 0x0000)
struct VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RGetAnimationPosition__FIXME final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Geometry_skeletal_mesh_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RIsPlayingAnimation
// 0x0002 (0x0002 - 0x0000)
struct VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RIsPlayingAnimation final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VGameplayRst.VGameplayRst_Geometry_skeletal_mesh_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimation_L_Nanimation_R
// 0x0008 (0x0008 - 0x0000)
struct VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimation_L_Nanimation_R final
{
public:
	class UAssets_animation*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Geometry_skeletal_mesh_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimationBlueprint_L_Nanimation__blueprint_R
// 0x0008 (0x0008 - 0x0000)
struct VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimationBlueprint_L_Nanimation__blueprint_R final
{
public:
	class UAssets_animation_blueprint*            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Geometry_skeletal_mesh_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimationInstance_L_Nanimation__instance_R
// 0x0008 (0x0008 - 0x0000)
struct VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimationInstance_L_Nanimation__instance_R final
{
public:
	class UAssets_animation_instance*             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Geometry_skeletal_mesh_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimationMode_L_Ndefault__animation__mode__type_R
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimationMode_L_Ndefault__animation__mode__type_R final
{
public:
	EVGameplayRst_Geometry_default_animation_mode_type __verse_0xB2CDDD72_Argument;                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Geometry_skeletal_mesh_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimationPlayRate__FIXME_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimationPlayRate__FIXME_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Geometry_skeletal_mesh_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimationPosition__FIXME_L_Nfloat_M_Nlogic_R
// 0x0010 (0x0010 - 0x0000)
struct VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimationPosition__FIXME_L_Nfloat_M_Nlogic_R final
{
public:
	struct Ftuple_Lfloat_Mlogic_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Geometry_skeletal_mesh_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetMaterial_L_Nmaterial_R
// 0x0008 (0x0008 - 0x0000)
struct VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetMaterial_L_Nmaterial_R final
{
public:
	class UAssets_material*                       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Geometry_skeletal_mesh_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetSkeletalMesh_L_Nskeletal__mesh_R
// 0x0008 (0x0008 - 0x0000)
struct VGameplayRst_Geometry_skeletal_mesh_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetSkeletalMesh_L_Nskeletal__mesh_R final
{
public:
	class UAssets_skeletal_mesh*                  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Components_dynamic_activation_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RBeginTransition_L_Nfloat_M_Nactivation__state_R
// 0x0010 (0x0010 - 0x0000)
struct VGameplayRst_Components_dynamic_activation_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RBeginTransition_L_Nfloat_M_Nactivation__state_R final
{
public:
	struct Ftuple_Lfloat_Mactivation__state_R     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Components_dynamic_activation_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RLinkComponent_L_Ncomponent_R
// 0x0008 (0x0008 - 0x0000)
struct VGameplayRst_Components_dynamic_activation_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RLinkComponent_L_Ncomponent_R final
{
public:
	class UEntityComponent*                       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Components_dynamic_activation_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RReset
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Components_dynamic_activation_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RReset final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Components_dynamic_activation_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RUnlinkComponent_L_Ncomponent_R
// 0x0008 (0x0008 - 0x0000)
struct VGameplayRst_Components_dynamic_activation_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RUnlinkComponent_L_Ncomponent_R final
{
public:
	class UEntityComponent*                       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Components_dynamic_activation_component.WaitForTransitionBegin
// 0x0028 (0x0028 - 0x0000)
struct VGameplayRst_Components_dynamic_activation_component_WaitForTransitionBegin final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Components_dynamic_activation_component.WaitForTransitionComplete
// 0x0028 (0x0028 - 0x0000)
struct VGameplayRst_Components_dynamic_activation_component_WaitForTransitionComplete final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Transform_position_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__positionable_N_RSetPosition_L_Nvector3_R
// 0x0018 (0x0018 - 0x0000)
struct VGameplayRst_Transform_position_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__positionable_N_RSetPosition_L_Nvector3_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VGameplayRst.VGameplayRst_Transform_position_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fposition__component_N_RAddToPosition_L_Nvector3_R
// 0x0018 (0x0018 - 0x0000)
struct VGameplayRst_Transform_position_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fposition__component_N_RAddToPosition_L_Nvector3_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VGameplayRst.VGameplayRst_Transform_position_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fpositionable_N_RGetPosition
// 0x0020 (0x0020 - 0x0000)
struct VGameplayRst_Transform_position_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fpositionable_N_RGetPosition final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VGameplayRst.VGameplayRst_Components_script_component.$InitCDO
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Components_script_component__InitCDO final
{
public:
	uint8                                         _ExprResult_0 : 1;                                 // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function VGameplayRst.VGameplayRst_Components_script_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RAddToCreateComponentList_L_N_Ktype_Lany_M_20component_R_R
// 0x0010 (0x0010 - 0x0000)
struct VGameplayRst_Components_script_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RAddToCreateComponentList_L_N_Ktype_Lany_M_20component_R_R final
{
public:
	TArray<class UClass*>                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
};

// Function VGameplayRst.VGameplayRst_Components_script_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RAddToRequiredComponentList_L_N_Ktype_Lany_M_20component_R_R
// 0x0010 (0x0010 - 0x0000)
struct VGameplayRst_Components_script_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RAddToRequiredComponentList_L_N_Ktype_Lany_M_20component_R_R final
{
public:
	TArray<class UClass*>                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
};

// Function VGameplayRst.VGameplayRst_Components_script_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RGetAllComponentsOfType_L_Nany_R
// 0x0018 (0x0018 - 0x0000)
struct VGameplayRst_Components_script_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RGetAllComponentsOfType_L_Nany_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UEntityComponent*>               RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VGameplayRst.VGameplayRst_Components_script_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RGetComponentOfType_L_Nany_R
// 0x0010 (0x0010 - 0x0000)
struct VGameplayRst_Components_script_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RGetComponentOfType_L_Nany_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Components_script_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RGetFullname
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) VGameplayRst_Components_script_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RGetFullname final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Components_script_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RGetName
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) VGameplayRst_Components_script_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RGetName final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Components_script_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RIsEnabled
// 0x0002 (0x0002 - 0x0000)
struct VGameplayRst_Components_script_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RIsEnabled final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VGameplayRst.VGameplayRst_Components_script_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RIsOwner_L_Nentity_R
// 0x0010 (0x0010 - 0x0000)
struct VGameplayRst_Components_script_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RIsOwner_L_Nentity_R final
{
public:
	class UVerseEngine_Entity_entity*             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VGameplayRst.VGameplayRst_Components_script_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnBegin
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Components_script_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnBegin final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Components_script_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnCreate
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Components_script_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnCreate final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Components_script_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnEnabledChanged_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Components_script_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnEnabledChanged_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};

// Function VGameplayRst.VGameplayRst_Components_script_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnEnd
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Components_script_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnEnd final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Components_script_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnPostCreate
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Components_script_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnPostCreate final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Components_script_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnTick_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct VGameplayRst_Components_script_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnTick_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Components_script_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RSetEnabled_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Components_script_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RSetEnabled_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};

// Function VGameplayRst.VGameplayRst_Components_script_component._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RSetTickEnabled_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_Components_script_component__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RSetTickEnabled_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};

// Function VGameplayRst.VGameplayRst_Datastore_DatastoreComponent._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDatastore_2fDatastoreComponent_N_RClearAllDatastoreValues_L_Nplayer__component_R
// 0x0008 (0x0008 - 0x0000)
struct VGameplayRst_Datastore_DatastoreComponent__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDatastore_2fDatastoreComponent_N_RClearAllDatastoreValues_L_Nplayer__component_R final
{
public:
	class USimulation_player_component*           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Datastore_DatastoreComponent._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDatastore_2fDatastoreComponent_N_RSetDatastoreValue_L_Nplayer__component_M_N_Kchar_M_N_Kchar_R
// 0x0028 (0x0028 - 0x0000)
struct VGameplayRst_Datastore_DatastoreComponent__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDatastore_2fDatastoreComponent_N_RSetDatastoreValue_L_Nplayer__component_M_N_Kchar_M_N_Kchar_R final
{
public:
	struct Ftuple_Lplayer__component_M_Kchar_M_Kchar_R __verse_0xB2CDDD72_Argument;                  // 0x0000(0x0028)(Parm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Datastore_DatastoreComponent._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDatastore_2fDatastoreComponent_N_RSetDatastoreValueInt_L_Nplayer__component_M_N_Kchar_M_Nint_R
// 0x0020 (0x0020 - 0x0000)
struct VGameplayRst_Datastore_DatastoreComponent__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDatastore_2fDatastoreComponent_N_RSetDatastoreValueInt_L_Nplayer__component_M_N_Kchar_M_Nint_R final
{
public:
	struct Ftuple_Lplayer__component_M_Kchar_Mint_R __verse_0xB2CDDD72_Argument;                     // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_DebugDraw._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDebugDraw_N_RDrawDebugArrow_L_Nvector3_M_Nvector3_M_Narrow__draw__params_R
// 0x0078 (0x0078 - 0x0000)
struct VGameplayRst_DebugDraw__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDebugDraw_N_RDrawDebugArrow_L_Nvector3_M_Nvector3_M_Narrow__draw__params_R final
{
public:
	struct Ftuple_Lvector3_Mvector3_M_QParams_Narrow__draw__params_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0078)(Parm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_DebugDraw._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDebugDraw_N_RDrawDebugBox_L_Nvector3_M_Nrotation_M_Nbox__draw__params_R
// 0x00A0 (0x00A0 - 0x0000)
struct VGameplayRst_DebugDraw__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDebugDraw_N_RDrawDebugBox_L_Nvector3_M_Nrotation_M_Nbox__draw__params_R final
{
public:
	struct Ftuple_Lvector3_Mrotation_M_QParams_Nbox__draw__params_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument; // 0x0000(0x00A0)(Parm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_DebugDraw._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDebugDraw_N_RDrawDebugCapsule_L_Nvector3_M_Nrotation_M_Ncapsule__draw__params_R
// 0x0090 (0x0090 - 0x0000)
struct VGameplayRst_DebugDraw__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDebugDraw_N_RDrawDebugCapsule_L_Nvector3_M_Nrotation_M_Ncapsule__draw__params_R final
{
public:
	struct Ftuple_Lvector3_Mrotation_M_QParams_Ncapsule__draw__params_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0090)(Parm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_DebugDraw._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDebugDraw_N_RDrawDebugCone_L_Nvector3_M_Nvector3_M_Ncone__draw__params_R
// 0x0090 (0x0090 - 0x0000)
struct VGameplayRst_DebugDraw__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDebugDraw_N_RDrawDebugCone_L_Nvector3_M_Nvector3_M_Ncone__draw__params_R final
{
public:
	struct Ftuple_Lvector3_Mvector3_M_QParams_Ncone__draw__params_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0090)(Parm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_DebugDraw._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDebugDraw_N_RDrawDebugCylinder_L_Nvector3_M_Nvector3_M_Ncylinder__draw__params_R
// 0x0090 (0x0090 - 0x0000)
struct VGameplayRst_DebugDraw__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDebugDraw_N_RDrawDebugCylinder_L_Nvector3_M_Nvector3_M_Ncylinder__draw__params_R final
{
public:
	struct Ftuple_Lvector3_Mvector3_M_QParams_Ncylinder__draw__params_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0090)(Parm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_DebugDraw._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDebugDraw_N_RDrawDebugLine_L_Nvector3_M_Nvector3_M_Nline__draw__params_R
// 0x0070 (0x0070 - 0x0000)
struct VGameplayRst_DebugDraw__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDebugDraw_N_RDrawDebugLine_L_Nvector3_M_Nvector3_M_Nline__draw__params_R final
{
public:
	struct Ftuple_Lvector3_Mvector3_M_QParams_Nline__draw__params_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0070)(Parm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_DebugDraw._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDebugDraw_N_RDrawDebugPoint_L_Nvector3_M_Npoint__draw__params_R
// 0x0058 (0x0058 - 0x0000)
struct VGameplayRst_DebugDraw__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDebugDraw_N_RDrawDebugPoint_L_Nvector3_M_Npoint__draw__params_R final
{
public:
	struct Ftuple_Lvector3_M_QParams_Npoint__draw__params_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0058)(Parm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_DebugDraw._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDebugDraw_N_RDrawDebugSphere_L_Nvector3_M_Nsphere__draw__params_R
// 0x0068 (0x0068 - 0x0000)
struct VGameplayRst_DebugDraw__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDebugDraw_N_RDrawDebugSphere_L_Nvector3_M_Nsphere__draw__params_R final
{
public:
	struct VGameplayRst_0::Ftuple_Lvector3_M_QParams_Nsphere__draw__params_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0068)(Parm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_DebugDraw._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDebugDraw_N_RFlushPersistentDebugLines
// 0x0001 (0x0001 - 0x0000)
struct VGameplayRst_DebugDraw__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDebugDraw_N_RFlushPersistentDebugLines final
{
public:
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_DebugDraw.VGameplayRst_DebugDraw_arrow_draw_params$Factory
// 0x0068 (0x0068 - 0x0000)
struct VGameplayRst_DebugDraw_VGameplayRst_DebugDraw_arrow_draw_params_Factory final
{
public:
	struct FVGameplayRst_DebugDraw_arrow_draw_params RetVal;                                         // 0x0000(0x0040)(Parm, OutParm, ReturnParm)
	struct FColors_color                          _ExprResult_0;                                     // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResult_1;                                     // 0x0058(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__1;                             // 0x0061(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_2 : 1;                                 // 0x0063(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_3;                                // 0x0064(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_DebugDraw.VGameplayRst_DebugDraw_box_draw_params$Factory
// 0x0090 (0x0090 - 0x0000)
struct VGameplayRst_DebugDraw_VGameplayRst_DebugDraw_box_draw_params_Factory final
{
public:
	struct FVGameplayRst_DebugDraw_box_draw_params RetVal;                                           // 0x0000(0x0050)(Parm, OutParm, ReturnParm)
	struct FSpatialMath_vector3                   _ExprResult_0;                                     // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FColors_color                          _ExprResult_1;                                     // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResult_2;                                     // 0x0080(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__1;                             // 0x0089(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_3 : 1;                                 // 0x008B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_4;                                // 0x008C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_DebugDraw.VGameplayRst_DebugDraw_capsule_draw_params$Factory
// 0x0070 (0x0070 - 0x0000)
struct VGameplayRst_DebugDraw_VGameplayRst_DebugDraw_capsule_draw_params_Factory final
{
public:
	struct FVGameplayRst_DebugDraw_capsule_draw_params RetVal;                                       // 0x0000(0x0048)(Parm, OutParm, ReturnParm)
	struct FColors_color                          _ExprResult_0;                                     // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResult_1;                                     // 0x0060(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__1;                             // 0x0069(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_2 : 1;                                 // 0x006B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_3;                                // 0x006C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_DebugDraw.VGameplayRst_DebugDraw_cone_draw_params$Factory
// 0x0080 (0x0080 - 0x0000)
struct VGameplayRst_DebugDraw_VGameplayRst_DebugDraw_cone_draw_params_Factory final
{
public:
	struct FVGameplayRst_DebugDraw_cone_draw_params RetVal;                                          // 0x0000(0x0058)(Parm, OutParm, ReturnParm)
	struct FColors_color                          _ExprResult_0;                                     // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResult_1;                                     // 0x0070(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__1;                             // 0x0079(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_2 : 1;                                 // 0x007B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_3;                                // 0x007C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_DebugDraw.VGameplayRst_DebugDraw_cylinder_draw_params$Factory
// 0x0080 (0x0080 - 0x0000)
struct VGameplayRst_DebugDraw_VGameplayRst_DebugDraw_cylinder_draw_params_Factory final
{
public:
	struct FVGameplayRst_DebugDraw_cylinder_draw_params RetVal;                                      // 0x0000(0x0058)(Parm, OutParm, ReturnParm)
	struct FColors_color                          _ExprResult_0;                                     // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResult_1;                                     // 0x0070(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__1;                             // 0x0079(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_2 : 1;                                 // 0x007B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_3;                                // 0x007C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_DebugDraw.VGameplayRst_DebugDraw_line_draw_params$Factory
// 0x0060 (0x0060 - 0x0000)
struct VGameplayRst_DebugDraw_VGameplayRst_DebugDraw_line_draw_params_Factory final
{
public:
	struct FVGameplayRst_DebugDraw_line_draw_params RetVal;                                          // 0x0000(0x0038)(Parm, OutParm, ReturnParm)
	struct FColors_color                          _ExprResult_0;                                     // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResult_1;                                     // 0x0050(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__1;                             // 0x0059(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_2 : 1;                                 // 0x005B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_3;                                // 0x005C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_DebugDraw.VGameplayRst_DebugDraw_point_draw_params$Factory
// 0x0060 (0x0060 - 0x0000)
struct VGameplayRst_DebugDraw_VGameplayRst_DebugDraw_point_draw_params_Factory final
{
public:
	struct FVGameplayRst_DebugDraw_point_draw_params RetVal;                                         // 0x0000(0x0038)(Parm, OutParm, ReturnParm)
	struct FColors_color                          _ExprResult_0;                                     // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResult_1;                                     // 0x0050(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__1;                             // 0x0059(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_2 : 1;                                 // 0x005B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_3;                                // 0x005C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_DebugDraw.VGameplayRst_DebugDraw_sphere_draw_params$Factory
// 0x0070 (0x0070 - 0x0000)
struct VGameplayRst_DebugDraw_VGameplayRst_DebugDraw_sphere_draw_params_Factory final
{
public:
	struct FVGameplayRst_DebugDraw_sphere_draw_params RetVal;                                        // 0x0000(0x0048)(Parm, OutParm, ReturnParm)
	struct FColors_color                          _ExprResult_0;                                     // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              _ExprResult_1;                                     // 0x0060(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__1;                             // 0x0069(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_2 : 1;                                 // 0x006B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_3;                                // 0x006C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_EntityUtil._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RCreateAndAddComponent_L_Nint_M_Ntype_Lany_M_20component_R_R
// 0x0018 (0x0018 - 0x0000)
struct VGameplayRst_EntityUtil__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RCreateAndAddComponent_L_Nint_M_Ntype_Lany_M_20component_R_R final
{
public:
	struct Ftuple_Lint_Mcomponent_R               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UEntityComponent*                       RetVal;                                            // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_EntityUtil._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RGetComponentOfTypeFromComponent_L_Ncomponent_M_Nany_R
// 0x0018 (0x0018 - 0x0000)
struct VGameplayRst_EntityUtil__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RGetComponentOfTypeFromComponent_L_Ncomponent_M_Nany_R final
{
public:
	struct VGameplayRst_0::Ftuple_Lcomponent_Many_R __verse_0xB2CDDD72_Argument;                     // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_EntityUtil._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RGetComponentOfTypeFromComponentForEntity_L_Ncomponent_M_Nint_M_Nany_R
// 0x0020 (0x0020 - 0x0000)
struct VGameplayRst_EntityUtil__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RGetComponentOfTypeFromComponentForEntity_L_Ncomponent_M_Nint_M_Nany_R final
{
public:
	struct Ftuple_Lcomponent_Mint_Many_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_EntityUtil._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RSpawnEmptyEntity_L_Ntransform_M_N_Kchar_R
// 0x0080 (0x0080 - 0x0000)
struct VGameplayRst_EntityUtil__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RSpawnEmptyEntity_L_Ntransform_M_N_Kchar_R final
{
public:
	struct Ftuple_Ltransform_M_Kchar_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0070)(Parm, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_EntityUtil._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RSpawnEntity_L_Ntransform_M_N_Kchar_R
// 0x0080 (0x0080 - 0x0000)
struct VGameplayRst_EntityUtil__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RSpawnEntity_L_Ntransform_M_N_Kchar_R final
{
public:
	struct Ftuple_Ltransform_M_Kchar_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0070)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_EntityUtil._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RSpawnEntity_L_Nvector3_M_N_Kchar_R
// 0x0030 (0x0030 - 0x0000)
struct VGameplayRst_EntityUtil__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RSpawnEntity_L_Nvector3_M_N_Kchar_R final
{
public:
	struct VGameplayRst_0::Ftuple_Lvector3_M_Kchar_R __verse_0xB2CDDD72_Argument;                    // 0x0000(0x0028)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_EntityUtil._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RSpawnEntity_L_Nvector3_M_Nvector3_M_Nvector3_M_N_Kchar_R
// 0x0060 (0x0060 - 0x0000)
