#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VKDownloadOnDemandUI

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Class VKDownloadOnDemandUI.DownloadOnDemandProjectManagementTab
// 0x00A0 (0x0308 - 0x0268)
class UDownloadOnDemandProjectManagementTab final : public UUserWidget
{
public:
	uint8                                         Pad_268[0x30];                                     // 0x0268(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UDownloadOnDemandProject*               Project;                                           // 0x0298(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A0[0x10];                                     // 0x02A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       TextBlock_ProjectTitle;                            // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       TextBlock_LinkCode;                                // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       TextBlock_VersionNumber;                           // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       TextBlock_LatestVersionNumber;                     // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_LatestVersionSpinner;                        // 0x02D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       TextBlock_Description;                             // 0x02D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_RemoveProject;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_UpdateProject;                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*              Switcher_Props;                                    // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTileView*                        CommonTileView_ProjectAssetTiles;                  // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       TextBlock_NoPropsMessage;                          // 0x0300(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void RemoveProjectConfirmed();
	void UpdateProjectConfirmed();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandProjectManagementTab">();
	}
	static class UDownloadOnDemandProjectManagementTab* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandProjectManagementTab>();
	}
};

// Class VKDownloadOnDemandUI.DownloadOnDemandTabPanel
// 0x00A8 (0x0498 - 0x03F0)
class UDownloadOnDemandTabPanel final : public UFortCreativeContentBrowserTabPanelBase
{
public:
	struct FDataTableRowHandle                    AddProjectWithLinkCodeInputRowHandle;              // 0x03F0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    AddSelectedProjectInputRowHandle;                  // 0x0400(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    ManageSelectedProjectInputRowHandle;               // 0x0410(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	TSubclassOf<class UDownloadOnDemandProjectDetailsSidePanel> DownloadOnDemandProjectDetailsSidePanelClass; // 0x0420(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UDownloadOnDemandAddProjectModal> DownloadOnDemandAddProjectModalClass;        // 0x0428(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UDownloadOnDemandMessageModal> DownloadOnDemandMessageModalClass;              // 0x0430(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 AddProjectsWithMnemonicEntitlementName;            // 0x0438(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDownloadOnDemandProject*               SelectedProject;                                   // 0x0448(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_450[0x10];                                     // 0x0450(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlay*                               Overlay_AddProjectParent;                          // 0x0460(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTileView*                        CommonTileView_ProjectTiles;                       // 0x0468(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*              Switcher_DownloadOnDemandPanels;                   // 0x0470(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_AddProject;                                 // 0x0478(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHorizontalBox*                         HorizontalBox_EntitlementCheckMessage;             // 0x0480(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHorizontalBox*                         HorizontalBox_EntitlementCheckFailed;              // 0x0488(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDownloadOnDemandProjectManagementTab*  ProjectManagementTab;                              // 0x0490(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandTabPanel">();
	}
	static class UDownloadOnDemandTabPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandTabPanel>();
	}
};

// Class VKDownloadOnDemandUI.DownloadOnDemandTab_EntitlementCreationCondition
// 0x0010 (0x0038 - 0x0028)
class UDownloadOnDemandTab_EntitlementCreationCondition final : public UCreativeContentBrowserTab_CreationCondition
{
public:
	class FString                                 EntitlementName;                                   // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandTab_EntitlementCreationCondition">();
	}
	static class UDownloadOnDemandTab_EntitlementCreationCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandTab_EntitlementCreationCondition>();
	}
};

// Class VKDownloadOnDemandUI.DownloadOnDemandAddProjectModal
// 0x0048 (0x03F0 - 0x03A8)
class UDownloadOnDemandAddProjectModal final : public UCommonActivatableWidget
{
public:
	class UDownloadOnDemandProject*               Project;                                           // 0x03A8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3B0[0x10];                                     // 0x03B0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UEditableTextBox*                       EditableTextBox_DownloadLinkCode;                  // 0x03C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_AddProject;                                 // 0x03C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Cancel;                                     // 0x03D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDownloadOnDemandProjectTileImage*      ProjectTileImage_Preview;                          // 0x03D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_ProjectTitle;                              // 0x03E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       TextBlock_ProjectTitle;                            // 0x03E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleDownloadLinkIdTextChanged(const class FText& InputLinkCode);
	void UpdateLightningViolator(ESlateVisibility InVisibility, const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandAddProjectModal">();
	}
	static class UDownloadOnDemandAddProjectModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandAddProjectModal>();
	}
};

// Class VKDownloadOnDemandUI.DownloadOnDemandMessageModal
// 0x0018 (0x03C0 - 0x03A8)
class UDownloadOnDemandMessageModal final : public UCommonActivatableWidget
{
public:
	class UCommonTextBlock*                       TextBlock_MessageTitle;                            // 0x03A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       TextBlock_Message;                                 // 0x03B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Close;                                      // 0x03B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandMessageModal">();
	}
	static class UDownloadOnDemandMessageModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandMessageModal>();
	}
};

// Class VKDownloadOnDemandUI.DownloadOnDemandProjectDetailsSidePanel
// 0x0010 (0x0278 - 0x0268)
class UDownloadOnDemandProjectDetailsSidePanel final : public UUserWidget
{
public:
	class UDownloadOnDemandProjectTile*           DownloadOnDemandProjectTile_CurrentProjectEntry;   // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCreativeContentBrowserItemInfo*        ContentBrowserItemInfo_ItemDetails;                // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandProjectDetailsSidePanel">();
	}
	static class UDownloadOnDemandProjectDetailsSidePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandProjectDetailsSidePanel>();
	}
};

// Class VKDownloadOnDemandUI.DownloadOnDemandStatusFeed
// 0x0010 (0x0278 - 0x0268)
class UDownloadOnDemandStatusFeed final : public UUserWidget
{
public:
	bool                                          bOverrideOldStatusWithNewStatus;                   // 0x0268(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortDynamicEntryBox*                   EntryBox_DownloadStatusContainer;                  // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandStatusFeed">();
	}
	static class UDownloadOnDemandStatusFeed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandStatusFeed>();
	}
};

// Class VKDownloadOnDemandUI.DownloadOnDemandStatusFeedLine
// 0x0008 (0x0270 - 0x0268)
class UDownloadOnDemandStatusFeedLine final : public UUserWidget
{
public:
	class UCommonTextBlock*                       TextBlock_DownloadStatus;                          // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandStatusFeedLine">();
	}
	static class UDownloadOnDemandStatusFeedLine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandStatusFeedLine>();
	}
};

// Class VKDownloadOnDemandUI.DownloadOnDemandProjectAssetTileInitializer
// 0x0010 (0x0038 - 0x0028)
class UDownloadOnDemandProjectAssetTileInitializer final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaysetPropItemDefinition*         PropItemDefinition;                                // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandProjectAssetTileInitializer">();
	}
	static class UDownloadOnDemandProjectAssetTileInitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandProjectAssetTileInitializer>();
	}
};

// Class VKDownloadOnDemandUI.DownloadOnDemandProjectAssetTile
// 0x0040 (0x1470 - 0x1430)
class UDownloadOnDemandProjectAssetTile final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_1430[0x8];                                     // 0x1430(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UDownloadOnDemandProjectAssetTileInitializer* Initializer;                                 // 0x1438(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1440[0x10];                                    // 0x1440(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 Image_Item;                                        // 0x1450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_Spinner;                                     // 0x1458(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonNumericTextBlock*                NumericTextBlock_ItemCount;                        // 0x1460(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1468[0x8];                                     // 0x1468(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandProjectAssetTile">();
	}
	static class UDownloadOnDemandProjectAssetTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandProjectAssetTile>();
	}
};

// Class VKDownloadOnDemandUI.DownloadOnDemandProjectTile
// 0x01F0 (0x1620 - 0x1430)
class UDownloadOnDemandProjectTile final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_1430[0x10];                                    // 0x1430(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            SelectedHighlightBrush;                            // 0x1440(0x00C0)(Edit, NativeAccessSpecifierPrivate)
	struct FSlateBrush                            HoveredHighlightBrush;                             // 0x1500(0x00C0)(Edit, NativeAccessSpecifierPrivate)
	bool                                          bIsSelected;                                       // 0x15C0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_15C1[0x7];                                     // 0x15C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDownloadOnDemandProject*               Project;                                           // 0x15C8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_15D0[0x10];                                    // 0x15D0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UDownloadOnDemandProjectTileImage*      ProjectTileImage_Preview;                          // 0x15E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_UpdatePending;                               // 0x15E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_AddProject;                                  // 0x15F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_Spinner;                                     // 0x15F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_Error;                                       // 0x1600(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                               SizeBox_Label;                                     // 0x1608(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       TextBlock_Label;                                   // 0x1610(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonBorder*                          Border_Highlight;                                  // 0x1618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnLabelUpdated();
	void UpdateLabel(bool bShowLabel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandProjectTile">();
	}
	static class UDownloadOnDemandProjectTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandProjectTile>();
	}
};

// Class VKDownloadOnDemandUI.DownloadOnDemandProjectTileImage
// 0x0038 (0x02A0 - 0x0268)
class UDownloadOnDemandProjectTileImage final : public UUserWidget
{
public:
	class UTexture*                               EmptyProjectTexture;                               // 0x0268(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bOverrideGrayScale : 1;                            // 0x0270(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GreyScaleOverride;                                 // 0x0274(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDownloadOnDemandProject*               Project;                                           // 0x0278(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_280[0x10];                                     // 0x0280(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 Image_ProjectPreview;                              // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_LoadingImageSpinner;                         // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandProjectTileImage">();
	}
	static class UDownloadOnDemandProjectTileImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandProjectTileImage>();
	}
};

}

