#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Augments_CollectionPlayerProgressTrack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Augments_CollectionPlayerProgressTrack.WBP_Augments_CollectionPlayerProgressTrack_C
// 0x0050 (0x0320 - 0x02D0)
class UWBP_Augments_CollectionPlayerProgressTrack_C final : public UAthenaCollectionPlayerProgressContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUniformGridPanel*                      GridPanel;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RaceTrack;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SetMaxnumber;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Discovered;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Title;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Title_Text;                                        // 0x0308(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void PreConstruct(bool IsDesignTime);
	void PlayIntro();
	void ExecuteUbergraph_WBP_Augments_CollectionPlayerProgressTrack(int32 EntryPoint);
	void Construct();
	void BP_OverrideCategoryTitle(const class FText& OverrideTitle);
	void BP_OnPlayerProgressEntriesCreated(const TArray<class UAthenaCollectionPlayerProgress*>& PlayerProgressEntries, int32 NumToCollect);
	void BP_OnPlayerProgressContainerReset();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Augments_CollectionPlayerProgressTrack_C">();
	}
	static class UWBP_Augments_CollectionPlayerProgressTrack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Augments_CollectionPlayerProgressTrack_C>();
	}
};

}

