#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PanelRebootRally_Header

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_PanelRebootRally_Header.WBP_PanelRebootRally_Header_C.ExecuteUbergraph_WBP_PanelRebootRally_Header
// 0x0030 (0x0030 - 0x0000)
struct WBP_PanelRebootRally_Header_C_ExecuteUbergraph_WBP_PanelRebootRally_Header final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEligible;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0018(0x0018)(ConstParm)
};

// Function WBP_PanelRebootRally_Header.WBP_PanelRebootRally_Header_C.OnRebootRallyEligibilityUpdated
// 0x0001 (0x0001 - 0x0000)
struct WBP_PanelRebootRally_Header_C_OnRebootRallyEligibilityUpdated final
{
public:
	bool                                          bEligible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

