#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RebootRallyPopupModal_QRCode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RebootRallyPopupModal_QRCode.WBP_RebootRallyPopupModal_QRCode_C
// 0x0040 (0x1420 - 0x13E0)
class UWBP_RebootRallyPopupModal_QRCode_C final : public URebootRallyQRCode
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x13E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_QRCode;                                      // 0x13E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_QRAction;                                     // 0x13F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsInvite;                                         // 0x13F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13F9[0x7];                                     // 0x13F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 QRCodeURL;                                         // 0x1400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bIsSwitch;                                         // 0x1410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void Construct();
	void ExecuteUbergraph_WBP_RebootRallyPopupModal_QRCode(int32 EntryPoint);
	void InputMethodChanged(ECommonInputType NewInputType);
	void OnInitialized();
	void SetIsInvite(bool bIsInvite_0);
	void UpdateQRCode(ECommonInputType NewInputType);
	void UpdateText(ECommonInputType NewInputType);
	void UpdateURL(ECommonInputType NewInputType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RebootRallyPopupModal_QRCode_C">();
	}
	static class UWBP_RebootRallyPopupModal_QRCode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RebootRallyPopupModal_QRCode_C>();
	}
};

}

